[
  {
    "id": 1,
    "imageUrl": "",
    "title": "What’s New in vcpkg (July 2025)",
    "description": "This blog post summarizes changes to the vcpkg package manager as part of the 2025.07.25 registry release, 2025-06-20, 2025-07-16, and 2025-07-21 tool releases, as well as changes to vcpkg documentation throughout July. This release includes a new command for printing package SPDX licenses, binary caching optimizations, and support for visionOS, Solaris, and illumos systems. Some […]\nThe post What’s New in vcpkg (July 2025) appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/whats-new-in-vcpkg-july-2025/",
    "pubDate": "Tue, 05 Aug 2025 20:34:38 +0000",
    "creator": "Augustin Popa",
    "categories": [
      "C++",
      "Vcpkg",
      "vcpkg"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "Federation Platform and Privacy Waves: How Meta distributes compliance-related tasks at scale",
    "description": "We’re exploring Meta’s Federation Platform, a scalable set of tools for managing compliance-related tasks, along with Privacy Waves, our method for batching these tasks and ensuring accountability.  Together, the Federation Platform and Privacy Waves create a structured, effective, and sustainable approach to operationalizing privacy work, enabling Meta to safeguard user data for the billions of [...]\nRead More...\nThe post Federation Platform and Privacy Waves: How Meta distributes compliance-related tasks at scale appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/08/11/security/federation-platform-privacy-waves-meta-distributes-compliance-tasks/",
    "pubDate": "Mon, 11 Aug 2025 16:00:21 +0000",
    "creator": "Unknown",
    "categories": [
      "DevInfra",
      "ML Applications",
      "Security & Privacy"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "AI 스튜디오 앱 빌더로 쇼츠 영상 뚝딱! 바이럴 콘텐츠 자동화 시스템 구축 가이드(무료 앱 공개)",
    "description": "\"조회수 100의 벽, 어떻게 뚫을까?\" AI를 활용한 쇼츠 영상 자동화 시스템으로 콘텐츠 제작 고민을 해결하고, 바이럴 영상을 만드는 노하우를 공개합니다.\n\n\n \n 혹시 유튜브 채널을 시작하고 나서 매일 '오늘은 또 어떤 콘텐츠를 만들어야 하나...' 머리를 쥐어뜯은 경험 있으신가요? 조회수는 정체되어 있고, 아이디어는 고갈되고, '나는 재능이 없나?' 하는 자괴감마저 들 때도 많으실 거예요. 저도 똑같은 고민을 했었고, 정말 막막한 시간을 보냈습니다.\n하지만 만약 이런 고민을 한 방에 해결해 줄 수 있는 시스템이 있다면 어떨까요? 버튼 몇 번만 누르면 사람들이 열광하는 바이럴 콘텐츠 아이디어, 대본, 심지어 이미지까지 자동으로 만들어주는 '콘텐츠 공장'이 내 컴퓨터 안에 생긴다면요! 오늘은 그 상상을 현실로 만드는 모든 과정을 여러분께 보여드리려고 합니다.\n \n바이럴 콘텐츠의 핵심, 제미나이 젬 지침  \n모든 것의 시작은 '어떻게 하면 시청자를 끝까지 붙잡아 둘 수 있을까?'라는 질문에서 시작됐어요. 수많은 바이럴 영상을 분석한 결과, 저는 두 개의 강력한 제미나이 젬 지침을 만들 수 있었습니다. 이 두 개의 젬 지침을 사용하면 콘텐츠 기획부터 제작, 편집까지 완전 자동화된 시스템을 갖게 될 거예요.\n첫 번째는 '썰' 전문가 지침이에요. 유명 유튜브 썰 채널들을 분석해보니, 사람들은 달달한 연애, 짜릿한 복수, 짠한 이별, 소름 돋는 반전 등 12가지 감정의 굴레에서 벗어나지 않더라고요. 이 12개 카테고리를 AI에게 학습시켜서 어떤 주제든 감정선을 관통하는 이야기를 만들도록 한 것이죠.\n두 번째는 '바이럴 쇼핑 대본 생성기' 지침이에요. 이 지침은 광고 공식을 스토리텔링에 완벽하게 녹여낸 PAS(문제 제기, 불안감 증폭, 해결책 제시) 구조를 따릅니다. 마치 '친구가 흥분해서 털어놓는 썰'처럼 느껴지게 만들어서 광고가 아닌 흥미로운 이야기로 받아들이게 하는 것이 핵심입니다.\n\n2025.08.10 - [AI, 미래기술/AI 챗봇 및 지침 무료 배포] - 쇼핑 썰, 일상 썰도 문제없어! AI가 만드는 유튜브 쇼츠 대본 GEM 지침 무료 다운로드\n5단계 스토리텔링 구조: 바이럴 썰 대본의 비밀  ️‍♀️\n썰 전문가 지침의 진짜 핵심은 검증된 5단계 스토리텔링 구조를 강제하는 데 있습니다. 이 구조만 잘 따라가면 어떤 이야기든 시청자를 사로잡을 수 있어요.\n훅킹 (Hooking)  : 3초 안에 시청자의 멱살을 잡는 단계입니다. '이게 뭐지?' 하는 궁금증을 유발해서 스크롤을 멈추게 만들죠.\n갈등 고조 (Rising Action)  ️: 주인공이 겪는 문제를 구체적으로 보여주면서 시청자를 이야기에 서서히 몰입시킵니다.\n절정 (Climax)  : 모든 갈등과 감정이 폭발하는 지점이에요. 여기서 극적인 반전이 터져 나오면서 시청자의 감정을 최고조로 끌어올립니다.\n결말 (Resolution)  : 모든 것이 해결되며 감동이나 교훈, 혹은 깊은 여운을 남깁니다.\n행동 유도 (Call to Action)  ️: \"여러분 생각은 어떠세요?\"와 같은 질문을 던져 댓글을 유도하고, 영상의 참여도를 높이는 단계입니다.\n이 구조에 맞춰서 대본과 각 장면에 맞는 이미지 프롬프트까지 한 번에 생성해주는 것이 바로 첫 번째 지침서의 역할입니다.\n \nAI 스튜디오 '앱 빌더'를 활용한 자동화의 완성  \n강력한 젬 지침이 있어도 문제가 있었어요. 일반 챗봇은 장기 기억이 없어서 대화가 길어지면 핵심 규칙을 까먹고 원치 않는 결과물이 나오기도 했죠. 게다가 이미지 생성도 일곱 장면짜리 대본을 만들려면 일곱 번이나 수동으로 요청해야 하는 비효율적인 작업이었습니다.\n이 모든 문제를 해결해 줄 히든카드가 바로 구글 AI 스튜디오의 '앱 빌더'입니다! 젬 지침을 앱으로 만들면 매번 완벽하게 초기화된 상태에서 지침을 수행하기 때문에 결과물의 품질이 항상 일정해요. 그리고 가장 중요한 점은 이미지 생성도 일괄 처리가 가능하다는 것입니다.\n  알아두세요!\nAI 이미지 생성 API를 활용하면 AI 스튜디오의 하루 사용 제한을 우회할 수 있어요. 유료지만 비용만 지불하면 오픈AI의 '달리 쓰리'나 'GPT 이미지 원' 같은 모델을 원하는 만큼 사용할 수 있습니다. API는 마치 여러분 대신 원하는 정보를 가져다주는 '심부름꾼'이라고 생각하면 쉬워요.\n이 앱을 사용하면 카테고리 선택, 주제 생성, 이미지 스타일, 비율, 장면 수만 설정하고 '대본 생성하기' 버튼만 클릭하면 끝! 장면별 나레이션과 이미지 프롬프트가 모두 정리되어 출력되고, 이미지도 한 번에 생성하거나 개별적으로 수정하여 다시 만들 수 있습니다.\n \n바이럴 쇼핑 콘텐츠 제작: PAS 프레임워크  \n'썰' 생성기를 만들고 테스트하다가 문득 소름 돋는 생각이 스쳐 지나갔습니다. '사람들이 이렇게 이야기에 빠져든다면, 이 강력한 몰입감을 상품 판매에 연결하면 어떻게 될까?' 바로 쿠팡 파트너스나 알리 같은 어필리에이트 마케팅에 적용하는 것이죠.\n  PAS (Problem, Agitate, Solve) 프레임워크\n문제 제기 (Problem): \"인생에서 가장 중요한 면접 전날, 거울을 봤는데 얼굴이 사막처럼 갈라져서 하얗게 각질이 일어난 겁니다\"처럼 독자가 공감할 수 있는 구체적인 문제를 제시합니다.\n불안감 증폭 (Agitate): \"이걸 본 면접관이 '자기 관리도 못 하는 사람이네'라고 생각하면 어떡하지? 이번 기회 놓치면 진짜 내 인생은 끝인데.\"와 같이 시청자를 극한의 불안감으로 몰아넣는 단계입니다.\n해결책 제시 (Solve): 바로 그때, 제품이 '우연히' 나타나 모든 문제를 해결해주는 구원자처럼 등장합니다.\n'바이럴 쇼핑 대본 생성기'는 이 PAS 구조를 활용하여 제품명과 제품 특징만 입력하면 구매욕구를 자극하는 썰 대본을 생성해 줍니다.\n \n이제 여러분 차례! 바이럴 콘텐츠 생성기 앱 사용하기  \n오늘 공개하는 '바이럴 썰 쇼츠 생성기'와 '바이럴 쇼핑 대본 생성기' 앱은 아래 링크를 통해 접속하실 수 있습니다. 접속하신 후 반드시 앱을 복사하여 사용하세요. 그래야 여러분의 필요에 맞게 수정하고, 자유롭게 활용할 수 있습니다.\n바이럴 썰 쇼츠 생성기: [앱 링크]\n바이럴 쇼핑 대본 생성기: [앱 링크]\n앱 사용법은 간단해요. 카테고리나 제품 정보를 선택한 뒤, 원하는 이미지 모델과 스타일, 장면 수 등을 설정하고 버튼만 누르면 됩니다. 여러분만의 바이럴 콘텐츠 공장을 지금 바로 만들어보세요!\n \n마무리: 핵심 요약  \n지금까지 코딩 없이 AI 스튜디오 앱 빌더로 쇼츠 바이럴 콘텐츠 생성기를 만드는 방법을 알아봤습니다. 이제 콘텐츠 아이디어 고갈 걱정은 끝났습니다. 버튼 몇 번만 누르면 바이럴 가능성이 높은 대본과 이미지가 바로 나오니까요!\n \n콘텐츠 제작 시스템, 이것만 기억하세요!\n✨ 바이럴 썰: 12가지 감정 카테고리 기반의 5단계 스토리텔링 구조를 활용하면 됩니다.\n  쇼핑 대본: PAS(문제, 불안감, 해결책) 프레임워크로 구매를 유도하는 썰 대본을 만듭니다.\n  자동화의 핵심:\nAI Studio 앱 빌더 = 젬 지침 + API 연동 (일괄 생성)\n ‍  실행: 버튼 몇 번으로 대본, 이미지 프롬프트, 해시태그까지 한 번에 생성합니다.\n이 시스템으로 효율적인 콘텐츠 제작을 시작하고, 더 이상 아이디어 걱정은 하지 마세요!\n \n자주 묻는 질문 ❓\nQ: AI Studio 앱 빌더를 사용해야 하는 이유가 무엇인가요?\nA: 일반 챗봇은 대화가 길어지면 지침을 잊어버려 오류가 발생할 수 있습니다. 하지만 앱 빌더는 매번 초기화된 상태에서 완벽하게 지침을 수행하여 결과물의 품질이 항상 일정합니다. 또한, 여러 이미지를 한 번에 생성하는 일괄 처리도 가능합니다.\nQ: AI 이미지 생성 API가 왜 필요한가요?\nA: AI 스튜디오 내장 모델은 하루 사용량에 제한이 있습니다. 오픈AI의 '달리 쓰리'나 'GPT 이미지 원' 같은 외부 API를 활용하면 유료지만 원하는 만큼 이미지를 생성할 수 있고, 더 다양한 모델을 활용할 수 있습니다. API는 여러분의 앱이 다른 서비스와 소통할 수 있도록 돕는 심부름꾼과 같은 역할을 합니다.\nQ: 바이럴 콘텐츠 생성기 앱을 어떻게 사용하나요?\nA: 앱을 실행한 후 카테고리(썰 쇼츠)나 제품 정보(쇼핑 대본)를 선택하고, 주제와 이미지 스타일, 장면 수 등을 설정한 뒤 '대본 생성하기' 버튼만 클릭하면 됩니다. 그러면 대본과 이미지 프롬프트가 자동으로 생성되고, 이를 바탕으로 바로 영상을 제작할 수 있습니다.\nQ: 바이럴 썰 쇼츠 대본 지침의 5단계 구조가 궁금해요.\nA: 5단계 구조는 다음과 같습니다: ① 훅킹(궁금증 유발) ② 갈등 고조(몰입 유도) ③ 절정(극적 반전) ④ 결말(감동 및 여운) ⑤ 행동 유도(댓글 유도). 이 구조는 시청자를 영상 끝까지 붙잡아두는 검증된 방법입니다.\nQ: 바이럴 쇼핑 대본 지침의 핵심은 무엇인가요?\nA: 이 지침은 PAS(Problem, Agitate, Solve) 프레임워크를 기반으로 합니다. 먼저 시청자가 공감할 수 있는 문제를 제시하고, 그로 인한 불안감을 증폭시킨 뒤, 마지막에 제품을 해결책으로 제시하며 구매 욕구를 자극하는 방식입니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483639",
    "pubDate": "Sun, 10 Aug 2025 15:20:41 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "AI 스튜디오",
      "API",
      "PAS 프레임워크",
      "바이럴 콘텐츠",
      "쇼츠 자동화",
      "숏폼 콘텐츠",
      "앱 빌더",
      "유튜브 쇼츠",
      "제미나이 젬",
      "콘텐츠 제작"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "악역영애 4컷 만화 - 13화, 장래희망인데스와",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2342",
    "pubDate": "Wed, 06 Aug 2025 16:02:33 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "웹툰"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "Kotlin DSL: What’s New?",
    "description": "In the last few TeamCity releases, we made some improvements to the Kotlin DSL. This is a summary of these enhancements. Custom path for Kotlin DSL files TeamCity has always had strict requirements regarding the directory location for Kotlin DSL files. It insisted on saving the files under the .teamcity directory, which had some drawbacks. […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/teamcity/2025/08/kotlin-dsl-what-s-new/",
    "pubDate": "Tue, 05 Aug 2025 13:57:48 +0000",
    "creator": "Pavel Sher",
    "categories": [
      "kotlin",
      "news"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "동네 야경 - 2025년 8월 2일",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://hodolman.tistory.com/81",
    "pubDate": "Mon, 11 Aug 2025 22:37:01 +0900",
    "creator": "호돌맨",
    "categories": [
      "사진"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "짭 서피스 아크 마우스 주의",
    "description": "2024년 7월 16일에 병행수입이라고 서피스 아크마우스를 하나 구입했었다. 국내 유통가 대비 1/2가격이었다. 박스에 중국어만 가득했지만 박스 디자인도 똑같았고 ms로고가 확실히 박혀있었으므로 중국 내수용이겠지…라고 찝찝하지만 넘어갔다. 그리고 7월 19일에 여의도 더 현대에 서피스랩탑 스냅드래곤 버전 구경하러 갔다가 아크마우스를 떨이로 팔길래 그 때 저렴하게 하나 구입했었다. 이건 개봉하지 않고 그냥 묵혀뒀었다. 병행수입이라 주장하던 아크 마우스를 계속 사용해오다가 … More 짭 서피스 아크 마우스 주의",
    "reviews": [],
    "syllabus": [],
    "link": "https://megayuchi.com/2025/08/11/%ec%a7%ad-%ec%84%9c%ed%94%bc%ec%8a%a4-%ec%95%84%ed%81%ac-%eb%a7%88%ec%9a%b0%ec%8a%a4-%ec%a3%bc%ec%9d%98/",
    "pubDate": "Mon, 11 Aug 2025 08:30:05 +0000",
    "creator": "megayuchi",
    "categories": [
      "IT",
      "Pub",
      "마우스",
      "서피스 아크 마우스",
      "surface arc mouse"
    ]
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "cctv 에 찍힌 귀신 영상",
    "description": "썸네일은 관계 없는거 들고 왔구요\n진짜로 무섭습니다.\n심약하신분은 안보시는게 좋습니다.\n이거 기억 자꾸 나면 길 걷기도 힘듭니다.\n \n영상: https://youtu.be/nC_0i2onolo?t=682\n\n\n\n11분부터 개 깜놀합니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1371",
    "pubDate": "Wed, 6 Aug 2025 07:05:13 +0900",
    "creator": "SIDNFT",
    "categories": [
      "유튜브",
      "귀신영상"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "숨은 알짜 대명화학,패션&middot;물류&middot;항공까지 통합한 지주회사 - 스타트업",
    "description": "제조기업인 줄 알았던 대명화학, 알고 보니 브랜드 플랫폼 대명화학은 이름만 들으면 전통적인 화학 제조기업처럼 들립니다. 하지만 이 기업의 진짜 정체는 지분투자를 기반으로 한 브랜드 인큐베이팅형 지주회사입니다. 코웰패션, 로젠택배, 에어로케이, K-뷰티 유통사 모스트까지 다양한 산업을 수직 계열화하며 안정적인 수익 기반과 폭발적인 성장성을 동시에 확보해가고",
    "reviews": [],
    "syllabus": [],
    "link": "https://brunch.co.kr/@@LOc/305",
    "pubDate": "Thu, 07 Aug 2025 03:00:06 GMT",
    "creator": "고명환",
    "categories": []
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "챗GPT를 '검색엔진'으로 사용하기 전, 꼭 알아야 할 치명적인 단점들",
    "description": "AI 챗봇, 과연 당신의 검색 도우미가 될 수 있을까요? 많은 사람들이 AI 챗봇을 구글이나 네이버 같은 검색 엔진처럼 사용하고 있습니다. 하지만 이 방법이 왜 치명적인 실수를 초래할 수 있는지, 6가지 핵심적인 이유와 함께 현명한 AI 활용법을 제시합니다.\n\n\n \n 요즘 AI 챗봇의 인기가 정말 대단하잖아요. 저도 처음에는 \"와, 이제 검색 안 해도 되겠네!\" 하면서 모든 궁금증을 챗봇에게 물어봤어요. \"맛집 추천해줘\", \"새로운 드라마 줄거리 요약해줘\", \"내일 날씨 어때?\" 같은 질문부터, 심지어 \"부동산 계약서 어떻게 써?\" 같은 중요한 질문까지도요. 그런데 쓰다 보니 뭔가 이상한 점을 발견했습니다. 챗봇이 주는 정보가 항상 정확하지 않고, 가끔은 엉뚱한 이야기를 진짜처럼 꾸며내기도 한다는 사실이었죠.\n이 글에서는 AI 챗봇이 왜 만능 검색 도구가 될 수 없는지, 그 6가지 이유를 솔직하게 이야기해보려고 합니다. 이 글을 끝까지 읽으시면, AI 챗봇을 더 똑똑하고 안전하게 활용하는 방법을 알게 되실 거예요! \n \n1. 존재하지 않는 사실을 진짜처럼 꾸며내는 ‘환각’  \nAI 챗봇의 가장 유명한 약점이 바로 ‘환각(hallucination)’ 현상입니다. 챗봇은 사실을 정확하게 제시하기보다는, 방대한 학습 데이터에서 찾은 문장 패턴을 기반으로 그럴듯하게 들리는 답변을 '창작'하는 데 특화되어 있어요. 마치 능청스러운 이야기꾼 같다고 할까요? 그래서 때로는 있지도 않은 정보를 마치 실제 사실인 것처럼 자신 있게 이야기하기도 합니다.\n실제로 제 지인 중 한 명이 해외여행을 앞두고 비자 정보를 챗봇에게 물어봤어요. \"한국 여권 소지자가 태국에 갈 때 비자가 필요해?\"라고 물었더니, 챗봇은 \"네, 90일 관광 비자를 미리 발급받아야 합니다.\"라고 답했습니다. 하지만 태국은 한국 여권 소지자에 대해 30일 무비자 입국을 허용하고 있죠. 이 지인은 챗봇 답변을 믿고 비자 발급을 알아보다가, 다행히 다른 친구의 조언으로 잘못된 정보라는 걸 알게 되었습니다. 만약 공항에 갔다가 입국 거부라도 당했다면 여행을 망칠 뻔했죠. 챗봇은 검색처럼 정보의 출처를 명시하지 않기에 이런 실수가 더 위험하게 다가옵니다.\n \n2. 데이터의 불투명성과 숨겨진 편향성  ️‍♂️\nAI 챗봇의 또 다른 문제는 훈련에 사용된 데이터가 무엇인지 명확하게 알 수 없다는 점입니다. 인터넷 웹사이트, 책, 포럼 등 방대한 양의 데이터를 학습하지만, 그 데이터가 어떤 기준으로 수집되었고, 어떤 편향을 가지고 있는지 알 길이 없죠. 챗봇의 답변은 그 불투명한 데이터의 결과물일 뿐입니다.\n예를 들어, \"자영업자 종합소득세 신고 방법\"에 대해 물었을 때, 챗봇은 최신 세법이 아닌 몇 년 전의 오래된 세법 정보나, 신뢰할 수 없는 온라인 커뮤니티의 댓글을 기반으로 답변할 수 있습니다. 특히, 특정 지역이나 시기에 치우친 데이터로 학습되면, 한국의 법률이나 문화적 맥락과는 동떨어진 답변을 내놓을 수 있어요. 이런 미묘한 편향성은 자칫 큰 오류를 낳을 수 있습니다.\n⚠️ 주의하세요!\n법률, 의학, 금융 등 전문적인 지식이 필요한 분야에서는 챗봇의 답변을 절대 신뢰해서는 안 됩니다. 반드시 공식 기관의 웹사이트나 전문가의 조언을 확인해야 합니다.\n \n3. 사용자의 의견을 그대로 수용하는 경향  \nAI 챗봇은 보통 \"도움이 되는\" 응답을 생성하도록 설계되어 있습니다. 그래서 사용자의 질문에 담긴 미묘한 뉘앙스나 의견을 그대로 따라가는 경향이 강합니다. 이는 챗봇의 답변이 객관적인 사실보다는 사용자의 관점에 맞춰지게 만든다는 뜻이죠.\n예를 들어, 같은 주제라도 질문의 방식에 따라 완전히 다른 답변을 얻을 수 있습니다.\nQ: \"아침 식사는 건강에 정말 중요하지 않나요?\"\nA: \"아침을 거르는 것이 간헐적 단식에 도움이 되는 등, 아침 식사를 하지 않는 것의 이점도 있습니다.\"라고 답변합니다.\nQ: \"왜 아침 식사가 가장 중요한 식사인가요?\"\nA: \"아침 식사는 하루를 시작하는 데 필요한 에너지를 공급해 주는 등, 아침 식사의 중요성을 강조하는 답변을 내놓습니다.\"\n이처럼 챗봇은 사용자가 원하는 대답을 찾아주는 경향이 강해, 의도치 않게 자신의 편향을 강화하는 도구로 전락할 수 있습니다. 질문을 어떻게 하느냐에 따라 챗봇의 답변이 180도 달라질 수 있다는 것을 꼭 기억해야 합니다.\n \n4. 실시간 정보에 대한 치명적인 약점  \n많은 분들이 챗봇이 마치 실시간으로 인터넷을 검색하는 것처럼 생각하지만, 그렇지 않은 경우가 훨씬 많습니다. 대부분의 챗봇은 특정 시점까지의 데이터로 학습되었고, 그 이후의 최신 정보는 반영되지 않을 수 있어요. 특히 시간이 중요한 정보일수록 챗봇은 더 위험합니다.\n예를 들어, \"이번 주말 서울시청광장에서 열리는 행사 일정 알려줘\"라고 물어보면, 챗봇은 과거에 학습된 데이터나 오래된 웹페이지 정보를 기반으로 엉뚱한 답변을 할 수 있습니다. 혹은 \"새롭게 시행되는 금융 정책에 대해 알려줘\"라는 질문에도, 정책이 발표된 시점 이후에 학습이 이루어지지 않았다면 잘못된 정보를 제공할 가능성이 높습니다. 웹 브라우징 기능이 있는 챗봇도 마찬가지예요. 캐시된 결과나 사전 훈련된 데이터에 의존하는 경향이 있어, 실시간으로 변하는 정보를 정확하게 파악하기 어렵습니다.\n \n5. 맥락과 뉘앙스에 대한 이해 부족  \n언어는 단순한 단어의 조합이 아니죠. 맥락, 뉘앙스, 문화적 배경이 매우 중요합니다. 하지만 AI 챗봇은 아직 이런 복잡한 부분을 완벽하게 이해하지 못합니다. 예를 들어, 한국 사람들은 \"수고하세요\"라는 말을 인사말로 흔히 쓰지만, 챗봇에게 이 문장을 입력하면 문자 그대로 \"고생하라\"는 뜻으로 해석해 부적절한 답변을 내놓을 수 있습니다. 또한, 비꼬는 농담이나 은유적 표현은 제대로 파악하지 못하고 엉뚱한 해석을 내놓기 쉽습니다. 마치 외국인 친구에게 농담을 했는데, 그 친구가 진지하게 받아들이는 상황과 비슷하다고 할까요? 깊은 공감이나 복잡한 감정적 소통은 현재의 챗봇에게 기대하기 어렵습니다.\n \n6. 단순한 조합일 뿐, 진정한 창의성에는 한계가 있다  \nAI 챗봇은 아이디어 브레인스토밍의 훌륭한 도구임에는 분명해요. \"SF 영화의 새로운 줄거리 3가지 알려줘\"라고 물으면 그럴듯한 답변을 내놓을 겁니다. 하지만 이 답변들은 대부분 기존에 학습된 수많은 영화 시나리오들의 조합일 가능성이 높아요. 인간처럼 완전히 새로운 관점, 독창적인 감수성, 깊은 통찰력에서 비롯된 창의적인 아이디어를 만들어내기에는 아직 한계가 있습니다. 진정한 창작의 영역, 예를 들어 기존에 없던 장르를 개척하거나, 사회적 메시지를 담은 예술 작품을 만드는 일은 여전히 인간의 몫입니다. 챗봇은 창작의 파트너일 수는 있지만, 그 자체로 창작자가 될 수는 없다는 점을 기억해야 합니다.\n \nAI 챗봇, 현명하게 사용하는 법  \n결론적으로, AI 챗봇은 우리가 일상에서 겪는 수많은 문제들을 해결하는 데 도움을 줄 수 있는 강력한 도구입니다. 하지만 결코 만능 검색 엔진이 될 수는 없습니다. 법률, 의학, 금융, 실시간 정보 등 정확성과 신뢰성이 중요한 분야에서는 반드시 전문가나 공식 웹사이트를 통해 정보를 확인해야 합니다. 챗봇은 아이디어 브레인스토밍이나 초안 작성 등 보조적인 역할로만 사용하고, 최종 판단은 항상 스스로 내리는 습관을 들이는 것이 좋습니다. AI를 우리의 지적 능력을 확장하는 파트너로 생각하고, 맹목적으로 의존하지 않는다면 더 똑똑하게 AI 시대를 살아갈 수 있을 것입니다.\n혹시 더 궁금한 점이 있다면 언제든지 댓글로 물어봐주세요! AI 챗봇에 대해 함께 이야기 나누고 싶습니다.  \n \n자주 묻는 질문 ❓\nQ: AI 챗봇의 '환각' 현상은 왜 일어나는 건가요?\nA: AI 챗봇은 검색을 하는 것이 아니라, 학습된 데이터를 기반으로 다음 올 단어를 예측하여 문장을 생성하기 때문입니다. 이 과정에서 사실과 무관한 내용을 만들어낼 수 있습니다.\nQ: 그럼 AI 챗봇의 답변은 전혀 믿을 수 없나요?\nA: 완전히 믿을 수 없는 것은 아니지만, 사실 확인이 필요한 정보(법률, 의료, 최신 뉴스 등)는 반드시 다른 신뢰할 수 있는 출처를 통해 확인해야 합니다.\nQ: AI 챗봇은 어떤 용도로 사용하는 것이 가장 좋나요?\nA: 아이디어 브레인스토밍, 복잡한 주제의 개요 파악, 초안 작성 등 창의적이고 보조적인 역할에 활용하는 것이 가장 효과적입니다.\nQ: AI 챗봇의 편향성은 어떻게 해결할 수 있나요?\nA: 챗봇에 의존하기보다는 다양한 출처를 찾아보고, 자신의 주장을 뒷받침하는 정보만 취사선택하는 경향을 경계해야 합니다.\nQ: AI 챗봇이 맥락이나 뉘앙스를 제대로 이해 못하나요?\nA: 현재 AI 챗봇은 단어의 표면적인 의미는 잘 파악하지만, 비꼬는 표현이나 은유적인 농담, 깊은 감정적 맥락은 이해하는 데 한계가 있습니다.\nQ: AI 챗봇이 창의적인 아이디어를 만들어줄 수 없나요?\nA: AI는 기존 데이터를 재조합하여 새로운 아이디어를 제시할 수는 있지만, 인간의 경험과 통찰력에서 나오는 완전히 독창적인 창의성에는 아직 도달하지 못했습니다.\n\n\n\n    {\n        \"@context\": \"https://schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI 챗봇의 '환각' 현상은 왜 일어나는 건가요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  AI 챗봇은 검색을 하는 것이 아니라, 학습된 데이터를 기반으로 다음 올 단어를 예측하여 문장을 생성하기 때문입니다. 이 과정에서 사실과 무관한 내용을 만들어낼 수 있습니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"그럼 AI 챗봇의 답변은 전혀 믿을 수 없나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  완전히 믿을 수 없는 것은 아니지만, 사실 확인이 필요한 정보(법률, 의료, 최신 뉴스 등)는 반드시 다른 신뢰할 수 있는 출처를 통해 확인해야 합니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI 챗봇은 어떤 용도로 사용하는 것이 가장 좋나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  아이디어 브레인스토밍, 복잡한 주제의 개요 파악, 초안 작성 등 창의적이고 보조적인 역할에 활용하는 것이 가장 효과적입니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI 챗봇의 편향성은 어떻게 해결할 수 있나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  챗봇에 의존하기보다는 다양한 출처를 찾아보고, 자신의 주장을 뒷받침하는 정보만 취사선택하는 경향을 경계해야 합니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI 챗봇이 맥락이나 뉘앙스를 제대로 이해 못하나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  현재 AI 챗봇은 단어의 표면적인 의미는 잘 파악하지만, 비꼬는 표현이나 은유적인 농담, 깊은 감정적 맥락은 이해하는 데 한계가 있습니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI 챗봇이 창의적인 아이디어를 만들어줄 수 없나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  AI는 기존 데이터를 재조합하여 새로운 아이디어를 제시할 수는 있지만, 인간의 경험과 통찰력에서 나오는 완전히 독창적인 창의성에는 아직 도달하지 못했습니다.\"\n                }\n            }\n        ]\n    }",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483636",
    "pubDate": "Thu, 7 Aug 2025 11:43:33 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "ai 검색",
      "AI 챗봇",
      "AI 챗봇 한계",
      "AI 환각",
      "검색 엔진",
      "맥락 이해",
      "실시간 정보",
      "인공지능 신뢰",
      "정보 편향",
      "챗GPT 단점"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "전세계 정세는 종교전쟁 상태다 / 미국 중국 러시아 유럽",
    "description": "영상: https://www.youtube.com/watch?v=S2anQSQ6eeg\n\n\n\n \n민주주의와 조차 종교입니자. 기독교조 천주교가 여기에 포함되는지는 잘 모르겠습니다.\n중국은 민주주의가 아니죠 기독교도 아닙니다.\n그래서 미국이 조지는 중이구요\n현재는 돈으로 조질 수 있지만 커지면 진짜 전쟁을 해야할 수도 있습니다.\n \n유럽은 러시아 독일이 기독교에 가깝다고 합니다.\n영국 프랑스는 이슬랑에 가깝다고 합니다.\n지금은 혼내주기 위해 독일을 무장시키지만\n \n사긴이 더 걸려서 결국 이슬람을 선택한다면 \n미국도 더 많은 선을 넘게 될 것입니다.\n \n이슬람 문화가 풍요롭게 한건 딱히 없지만\n우성과 열성을 따져볼때 우성일 수도 있기 때문에 조심하려나 봅니다.\n \n미국이 기를 쓰고 막는데도 이슬람화를 막을 수 없다면 우성이 맞다고 보이네요\n국제 정세가 이렇게 전개되다니 놀랍습니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1370",
    "pubDate": "Tue, 5 Aug 2025 22:04:07 +0900",
    "creator": "SIDNFT",
    "categories": [
      "유튜브",
      "국제"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "What’s Fixed in IntelliJ IDEA 2025.2",
    "description": "Welcome to the first-ever standalone What’s Fixed overview of an IntelliJ IDEA release! We are always working hard to make the IDE even more stable, reliable, and enjoyable to use. In previous releases, information about this work was blended into the What’s New content, making it very long and sometimes hard to grasp. To address […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/idea/2025/08/whats-fixed-intellij-idea-2025-2/",
    "pubDate": "Wed, 06 Aug 2025 10:39:05 +0000",
    "creator": "Dmitriy Smirnov",
    "categories": [
      "news",
      "releases",
      "2025-2",
      "intellij-idea",
      "intellij-idea-2025-2"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "역설계",
    "description": "소프트웨어 엔지니어로 성장하면서 \"저 사람처럼 코드를 작성하고 싶다\" 라는 생각으로 프로젝트 코드를 그대로 따라친 적이 많다.\n원어민의 발음을 쉐도잉 (Shadowing) 하듯이 그들의 프로젝트 코드를 처음 Git log부터 순서대로 따라 작성했다.\n테스트 주도 개발 책에 예제를 활용해서 JUnit을 TDD로 직접 만들어 보거나, 스프링 프레임워크를 따라치면서 로드 존슨을 비롯한 여러 개발자들이 왜 당시에 이렇게 작성했는지 고민해보곤 했다.\n직접 하이버네이트의 기본 기능을 만들어보고 하이버네이트는 내부적으로 어떻게 구현했는지 비교해보기도 했다.\n이렇게 해당 프레임워크들의 Git log대로(고민의 흐름대로) 작성하다보면 그들의 생각을 조금은 엿볼 수 있었다.\n실무에서 무언가 내 의도대로 안되었을 때, 되어야 하는데 안되는 건지, 애초에 안되야 하는게 맞는건지를 조금은 구분할 수 있게 되어 문제가 발생하면 빠르게 예상 되는 지점을 좁힐 수 있었다.\n한때는 무라카미 하루키의 글을 필사하기도 했다.\n\"달리기를 말할 때 내가 하고 싶은 이야기\", \"직업으로서의 소설가\" 같은 책들은 그 당시의 생생한 주변 풍경을 너무 잘 묘사해서 이 표현을 너무 닮고 싶었다.\n히로시마의 선발 투수는 분명 다카하시였던 것으로 알고 있습니다.\n야쿠르트의 선발은 야스다였습니다. 1회 말, 다카하시가 제1구를 던지자 힐턴은 그것을 좌중간에 깔끔하게 띄워 올려 2루타를 만들었습니다. 방망이가 공에 맞는 상쾌한 소리가 진구 구장에 울려 퍼졌습니다. 띄엄띄엄 박수 소리가 주위에서 일었습니다.\n나는 그때 아무런 맥락도 없이, 아무런 근거도 없이 문득 이렇게 생각했습니다.\n‘그래, 나도 소설을 쓸 수 있을지 모른다’라고.\n그때의 감각을 나는 아직도 확실하게 기억합니다.\n하늘에서 뭔가가 하늘하늘 천천히 내려왔고 그것을 두 손으로 멋지게 받아낸 듯한 기분이었습니다.\n어째서 그것이 때마침 내 손안에 떨어졌는지, 그 이유는 잘 모르겠습니다. 그때도 몰랐고 지금도 모릅니다. 하지만 이유야 어찌 됐건 아무튼 그것이 일어났습니다.\n그것은 뭐라고 해야 할까, 일종의 계시 같은 것이었습니다. 영어에 epiphany라는 말이 있습니다. 일본어로 번역하면 ‘본질의 돌연한 현현顯現’ ‘직감적인 진실 파악’이라는 어려운 단어입니다.\n알기 쉽게 말하자면, ‘어느 날 돌연 뭔가가 눈앞에 쓱 나타나고 그것에 의해 모든 일의 양상이 확 바뀐다’라는 느낌입니다.\n바로 그것이 그날 오후에 내 신상에 일어났습니다.\n그 일을 경계로 내 인생의 양상이 확 바뀐 것입니다.\n데이브 힐턴이 톱타자로 진구 구장에서 아름답고 날카로운 2루타를 날린 그 순간에.\n[직업으로서의 소설가 - 제 2회 소설가가 된 무렵]\n컨퍼런스에서 누군가 이목을 끄는 장표를 만들었다면 그걸 사진을 찍어두고 적절한 때에 사용하기도 하고,\n유튜브, 팟캐스트 등에서 좋은 인터뷰 질문이 있으면 그걸 기억해두고 다음 우리 촬영때 그 질문을 응용해서 사용하기도 했다.\n혼자서 창작하는데는 재능이 없다고 생각하고 주변의 많은 재료들을 최대한 흡수해서 응용하는 것을 주로 하던 입장에서는 위로와 함께 좀 더 구체적인 노하우를 얻을 수 있었다.\n1부까지는 역설계라는 말에 어울리는 내용들이였지만, 2부 부터는 탁월한 성과를 내는 사람이 되는 구체적인 방법들을 전달한다.\n그래서 2부 부터는 역설계 내용과는 조금 거리가 있다고 느껴지긴 했지만, 그럼에도 2부 역시 배울게 많았다.\n성장을 위해 선행지표, 후행지표를 제대로 정하는 방법\n최대한 실행에 대한 리스크를 줄이는 방법\n반복적 연습이 아닌 전략적 연습을 수행하는 방법\n전문가에게서 값진 조언을 얻는 법\n등등 그간 보았던 여러 탁월함에 대한 책들의 종합 개론서 같은 느낌이 2부였다.\n당장 실행해야할 액션 아이템들도 얻었다.\n연구 팀은 중간고사 일주일 전에 학생들을 세 그룹으로 나눴다.\n첫 번째 그룹에게는 중간고사에서 좋은 성적을 받는 것을 상상하라고 말했다.\n두 번째 그룹에게는 좋은 성적이 아니라 공부하는 과정을 상상하라고 했다.\n세 번째 그룹에게는 일주일 동안 공부한 시간을 기록하게 했다.\n...\n어느 그룹이 중간고사에서 가장 좋은 성적을 받았을까?\n당연히 공부하는 과정을 상상한 그룹이었다.\n이들은 실제로 더 열심히 공부했고 불안감이 줄었으며 성적도 더 높게 나왔다.\n...\n대조군과 비교할 때, 짐캐리처럼 성공을 상상한 그룹이 중간고사 성적이 가장 낮았다.\n...\n바라는 결과를 달성한 모습을 상상할 때 경험하는 감정적 보상이 성공에 필요한 작업을 수행하려는 욕구를 감소시키기 때문이다.\n[6장 - 뻔한 연습이 아니라 전략적 연습이 필요하다]\n\"결과\"에 대한 상상이 아닌 \"과정\"에 대한 상상이 훨씬 더 높은 성취를 내는데 도움이 된다는 것에 확신이 생겼다.\n프로젝트가 시작 되기 전에 \"이 프로젝트가 잘 되면 어떤 즐거운 결과가 있을 것인지\"를 이야기 했다면, 이제는 프로젝트 진행 과정 중에서 발생할만한 일을 좀 더 자주 이야기하고 팀원들이 미리 상상할 수 있도록 하는 것이 더 좋은 결과물을 낼 수 있겠다는 생각을 했다.\n예컨대 중요한 기획서를 작성하는 중이라면 동료에게 그냥 \"피드백을 달라\"고 하지말고, 첫 단락이 읽는 이의 호기심을 끌어당기는지, 또는 프로젝트 스케줄이 의욕적으로 느껴지는지 물어보라\"\n[7장 - 전문가에게서 값진 조언을 얻는 법]\n하반기 피드백 기간에는 셀프 피드백 항목에 \"동료에게 피드백을 받고 싶은 역량, 프로젝트 등이 있다면 작성해주세요\" 와 같이 어떤 피드백을 받고 싶은지 스스로가 작성하도록 해보는 것도 좋겠다는 생각을 했다.\n책의 마지막에 있는 \"반드시 기억해야 할 10가지\" 에 책의 각 챕터에서 이야기한 내용들을 요약 정리해준 것은 이 책에서 놓치지 말아야할 것들이 무엇인지 한번 더 집어준 것 같아 좀 더 기억에 오래 남을 것 같다.\n오랫만에 하루키의 책을 다시 필사해야겠다.\n책 속 문장\n\"날마다 그 책을 펴서 두 페이지를 필사했다.\n한 문장 한 문장 옮겨 적으면서 글의 리듬을 받아들이고 대화 처리 방식, 단 몇 줄로 인물의 성격을 암시하는 기법 등을 음미했다.\n'낯설게' 느껴지는 음식에서 그런 맛의 추억을 떠올리게 하는 것이 훨씬 더 강렬한 효과를 낸다.\n낯선 맥락 속에서 그런 기본 패턴을 유지하는 것이 핵심이다.\n첫째, 창의성은 고립에서 나오는 것이 아니라 여러 아이디어의 융합에서 나온다.\n...\n둘때, 독창성은 창의성과 동의어가 아니다.\n...\n비즈니스 세계에는 시장을 선점하고도 더 진취적이고 창의적인 경쟁자들에게 밀려 뒤쳐진 사례가 허다하다.\n셋째, 역설계는 창의성을 가로막는 방해물이 아니다.\n오히려 새로운 기술과 지식을 습득해 뭔가를 전과 다른 창의적인 방식으로 만들어 낼 수 있는 저력을 키워준다.\n모방을 위해서는 해당 작품을 만드는 동안 원작자가 내린 결정들에 대해 깊이 생각해보아야 한다.\n또한 모방 작업을 하다 보면 평소에는 그냥 지나쳤을 요소나 기회를 민감하게 인식하게 된다.\n모방은 새로운 관점으로 가는 길을 열어주며, 우리 자신의 작업 방식에 숨겨진 창의적 기회를 찾게 도와준다.\n로빈슨의 강연 방식은 물론 훌륭하다.\n그러나 30초마다 농담이 나오고 풍부한 일화를 곁들인 강연을 누구나 할 수 있는 것은 아니고, 또 모두가 그런 강연을 하고 싶어 하는 것도 아니다.\n본받고 싶은 강연 스타일은 사람마다 다를 수 있다.\n그러니 당신이 선호하는 유형의 다른 강연자를 찾아라. \n그의 강연을 보면서 역방향 개요를 작성하고 특성들을 수치화하고 강연의 얼개를 구성해보라.\n이것은 다양한 결과물을 해부해 효과적인 구조를 발견하는 대단히 유용한 방법이며, 당신은 그 구조와 공식을 당신만의 방식으로 활용할 수 있다\n요컨대 전문가는 비전문가와 생각하는 방식이 다르다.\n그들은 자신도 의식하지 못하는 지름길을 활용하고, 자신이 하는 행동을 깊게 생각하지 않으며, 자신이 아는 것을 모르는 상태를 상상하지 못한다.\n성공적인 작업에 필요한 행동을 분석해서 말해달라고 하면, 그들은 70퍼센트를 빼놓고 말한다.\n그리고 설명해주는 30퍼센트는? 대다수 사람들이 조금 힘겨워하거나 또는 아예 이해하기 힘든 언어로 설명한다.\n새로운 무언가를 창업하려고 하는 사람 중에서 이전의 직장에서 다니면서 하는 사람과, 직장을 관두고 전업으로 하는 사람 중에 누가 더 성공할 것인가?\n전업으로 창업을 준비하는 사람이 더 확률이 높을 것이라고 직관적인 생각이 들지만 실상은 그 반대.\n안정적인 수입이 있는 사람이 여러가지 기회와 가능성을 충분히 살피고 선택하고 결정할 수 있기 때문에, 전자인 직장인으로서 준비하는 것이 더 확률이 높다는 것이다.\n이는 바로 리스크를 선택함에 여유가 있기 때문이며, 이러한 과정에서 아래의 4가지 방법을 모두 적용할 수 있다.\n규모가 작은 청중을 상대로 테스트하고\n가명 활용하기\n먼저 아이디어부터 판매하기\n포트폴리오 다양화하기",
    "reviews": [],
    "syllabus": [],
    "link": "http://jojoldu.tistory.com/841",
    "pubDate": "Mon, 11 Aug 2025 09:50:18 +0900",
    "creator": "향로 (기억보단 기록을)",
    "categories": [
      "도서",
      "쉐도잉",
      "역설계",
      "필사"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "동네 노을 - 2025년 8월 11일",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://hodolman.tistory.com/82",
    "pubDate": "Mon, 11 Aug 2025 22:37:43 +0900",
    "creator": "호돌맨",
    "categories": [
      "사진",
      "노을"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "태국 아유타야, 방콕 여행 사진",
    "description": "아유타야 숙소 입구에서 바라본 여행의 시작\n\n고단함\n\n아유타야\n\n방콕 황금불사원 계단\n\n황금불 사원에서 바라본 방콕 도심\n\n방콕 차이나 타운\n\n차이나타운 근처 카페, 참 마음에 드는 사진\n\n타누싱하 베이커리가 있는 골목\n\n\n방콕 터미널21\n\n벤짜낏띠 공원",
    "reviews": [],
    "syllabus": [],
    "link": "https://hodolman.tistory.com/79",
    "pubDate": "Mon, 11 Aug 2025 22:34:30 +0900",
    "creator": "호돌맨",
    "categories": [
      "여행",
      "방콕",
      "아유타야",
      "태국"
    ]
  }
]