[
  {
    "id": 1,
    "imageUrl": "",
    "title": "New Bug-Fix Releases Are Available for MPS – 2025.2.2, 2025.1.2, 2024.3.5, and 2024.1.6",
    "description": "We’ve released updates for multiple major MPS versions that fix several additional issues. Check out all the updates in each particular version below: MPS 2025.2.2 Download MPS 2025.2.2 here. See the full list of fixed issues here. MPS 2025.1.2 Download MPS 2025.1.2 here. See the full list of fixed issues here. MPS 2024.3.5 Download MPS […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/mps/2026/01/new_bugfix_releases_mps-2025-2-2/",
    "pubDate": "Fri, 02 Jan 2026 12:53:34 +0000",
    "creator": "Vaclav Pech",
    "categories": [
      "releases",
      "release"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "입사 일주일 만에 일본 출장을? LINE Plus Developer Relations 뉴비의 바쁜 적응기",
    "description": "입사한 지 일주일 만에 일본 출장을 다녀왔다고 말씀드리면 대부분 놀랍다는 반응을 보이십니다. 저 역시 그랬습니다. 아직 사내 시스템에조차 익숙치 않은 상태에서 제 역할이 무엇인지 ...",
    "reviews": [],
    "syllabus": [],
    "link": "https://techblog.lycorp.co.jp/ko/a-business-trip-to-japan-only-after-1-week-joining",
    "pubDate": "Tue, 30 Dec 2025 02:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "악역영애 4컷 만화 - 33화, 체육대회인데스와 ③",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2406",
    "pubDate": "Wed, 31 Dec 2025 16:45:22 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "웹툰"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "The Startup Bible – 2025 정리",
    "description": "해마다 12월 마지막 주에는 한 해 동안 쓴 글에 대해 정리하는데, 2025년도 이제 며칠 남지 않아서 이 블로그의 한 해를 정리해 본다. 이 글을 포함, 2025년에 난 약 4만 9,000개의 단어로 만들어진 94개의 글을 올렸는데, 이는 약 4일에 한 번씩 포스팅을 한 셈이다. 매주 월요일, 그리고 목요일 포스팅을 하니까, 포스팅 수치는 거의 같다. 지금 같이(...)",
    "reviews": [],
    "syllabus": [],
    "link": "https://www.thestartupbible.com/2025/12/the-startup-bible-best-of-2025.html",
    "pubDate": "Sun, 28 Dec 2025 21:21:00 +0000",
    "creator": "Kihong Bae",
    "categories": [
      "Uncategorized",
      "스타트업 바이블 1",
      "스타트업 바이블 2",
      "스타트업 바이블 QA"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "2025년에 있었던 일",
    "description": "벌써 또 일 년. 제법 바쁘게 지낸 거 같은데 생각나는 건 엘라스틱 라이센스 이슈 뿐이다. 몇 개월 전 엘라스틱측 클레임이 들어왔다는 출강 기관의 SOS를 받은 것. 요지는 \n\n\n누구 허락 받고 엘라스틱 교육 하느냐\n\n\n현대차로 운전연수 교육하면 현대차 허락 받아라 과정 소개에도 있지만, 내 강의 주제는 엘라스틱이 아닌 데이터 분석이다. 과정을 소개하는 첫 시간에 반드시 강조한다. \n\n엘라스틱 써보고 싶어서 데이터 분석 하나요? 아니죠. 데이터를 잘 분석하고 싶은데  그때 선택할 수 있는 여러 툴 중 엘라스틱을 써보는 겁니다... 이 과정을 다 듣고 나면 엘라스틱을 잘 쓰니까 데이터 분석이 되는 게 아니라, 데이터를 잘 아니까 엘라스틱이 쉬워진다는 사실을 알게 되실 겁니다\n\n\n그럼에도 엘라스틱을 사용하긴 하니 뜨끔했다. 라이센스 위반이라도 했다는 건가? 그럴만한 거리가 있나? 엘라스틱은 아마존과 틀어진 21년, 영리 활동이 가능하면서도 소스코드 공개 의무가 없는 아파치 라이센스 2.0을 버리고 엘라스틱 라이센스를 도입했다.\n\n\nLimitations\nYou may not provide the software to third parties as a hosted or managed service, where the service provides users with access to any substantial set of the features or functionality of the software.\n\nYou may not move, change, disable, or circumvent the license key functionality in the software, and you may not remove or obscure any functionality in the software that is protected by the license key.\n\nYou may not alter, remove, or obscure any licensing, copyright, or other notices of the licensor in the software. Any use of the licensor’s trademarks is subject to applicable law.\n\n\n핵심은 엘라스틱 기능이 포함된 제품의 매매나 (특히 아마존을 겨냥한) 임대 등의 영리 활동 금지.\n\n\n사용자 접근을 제공하는 호스팅 또는 관리형 서비스 형태로 제3자에게 소프트웨어를 제공할 수 없다.\n라이센스 키 기능을 이동, 변경, 비활성화 또는 우회해서는 안 되며, 라이센스 키로 보호되는 소프트웨어 기능을 제거하거나 가려서는 안 된다.\n라이센스, 저작권 또는 기타 고지 사항을 변경, 제거 또는 가려서는 안 된다.\n\n\n\n분명 교육도 영리 활동이지만 교육생이 재현할 수 있도록 기능 시연을 할 뿐, 제품 장사는 하지 않는다. 소스코드나 라이센스를 건드리지도 않는다. 엘라스틱 라이센스는 물론, 작년에 추가된 (영리 활동은 허용하되 소스코드 공개 의무가 있는) AGPL 3.0 라이센스와도 충돌하지 않는다는 얘기.\n\n\n물론 엘라스틱은 생각이 다르니 클레임 걸었겠지. (라이센스에 명시하면 서로 덜 피곤할텐데) 그래도 교육 과정 8년 운영하면서 엘라스틱 저변 확대에 나름 기여했다 생각했는데 감사패를 기대한 건 아니지만 야매 취급은 당황스럽다. 8년 만에 갑자기 교육 시장에 관심 주는 모양새도 뭐랄까, 실적 압박이 심한가(..)\n\n\n기술자문도 라이센스 위반?\n\n\n가끔 자문 요청을 받을 때가 있는데, 모두 교육에서 이어진다는 공통점이 있다. 그런데 (클레임과 가까운 시기에) 처음으로 교육을 거치지 않은 구축 관련 자문 요청을 받았다. 8년 간 교육 진행한 덕에 홍보 좀 됐나 싶어 반가웠는데 자문 범위(데이터 수집 > 전처리 > 분석) 회신을 보냈더니 연락이 뚝 끊김.\n\n\n아무런 밀당 없이 이렇게 바로 잠수탄다고? 문득 혹시 내가 설치/구축 등 엘라스틱 시장 파이를 갉아먹는 자문 활동을 하는지 떠보는 건가란 생각이 들었다. 라이센스에 명시된 내용은 없지만 엘라스틱 비즈니스와 겹치면 기분 나쁘겠지. \n\n\n한 편으론 안타까운 마음도 들었다. 개인이 참여하는 자문 규모가 뻔한데, 파이가 얼마나 작으면 그걸 경계할까(..) 그저 내 추측이 틀렸기만 바람. 일단 설치나 운영 관련 자문 요청은 받지 않는다. 데이터 분석 외엔 관심이 없기도 하고, 기본적 기술 배경이 빈약할수록 데이터 가치 생산보다 설치/구축 결과에만 매달릴 가능성이 높기 때문.\n\n사람들은 포르쉐를 부러워하지, 운전 실력을 부러워하지 않는다. 자본주의 세상에서 비싼 포르쉐는 성공의 상징이기 때문. 비슷한 연유로 빅데이터나 인공지능같은 최신 미국 기술은 정보보안, 나아가 IT 분야의 포르쉐가 된다\n\n\n어쨌든 글로벌 벤더의 클레임이다 보니 출강 기관측은 꽤 고민을 하는 듯했다. 결론은 과정 운영 중단. OSS(OpenSource Software) 버전이니 문제 없다, Opensearch로도 대체 가능하다 설득해봤지만, 뭐 그렇게 됐다. 매출에 큰 영향도 없는 과정을 외부 간섭까지 받아가며 유지하긴 싫겠지.\n\n\n아니면 엘라스틱과 협의를 통해 새로운 교육 과정이 개설될 수도 있고. 그런데 예전에도 엘라스틱 협력사가 운영하는 엘라스틱 엔지니어 과정이 있긴 했었다. 몇 년 못 가 폐강됐지만(..) 이유는 아마도 낮은 수요 때문?\n\n\n감히 조언하자면 뚜렷한 목적 없는 툴 교육은 지속하기 어렵다. 입문 난이도가 높은 분야(정규표현식?)의 특징은 잘 하는 이는 알아서 잘 쓰고, 모르는 이는 아예 시도조차 안 할 때가 많다는 것. 부침이 있었지만 8년 간 과정 운영이 가능했던 이유는 이상징후란 떡밥이 잘 하는 이나 모르는 이 모두에게 나름의 동기로 작용했기 때문이라 생각한다. \n\n\n엘라스틱의 계획은 무엇일까? \n\n\n자격증 여러 개 만든 거 보면 교육 사업에 대한 욕심은 확실히 있어 보인다. 그런데 전통적으로 잘 팔린 자격증은 시스코나 오라클 등 시장 점유율이 높은, 결정적으로 오픈소스가 아닌 제품이었단 말이지. 오픈소스는 알아서 잘 쓰거나, 아예 안 쓰거나로 갈리는 경향이 있어서(..)   \n\n\n나 같으면 불필요한 필드 수천 개씩 추가되는 ECS 정리해서 테이블 구조 깔끔하게 만들어 주는 데이터 전처리 기능을 유료로 팔겠다. 데이터 분석은 결국 분석이 가능한 테이블 구조를 만들 수 있느냐에 달려 있으니 유료 라이센스 판매에 도움이 되지 않을까? 그렇게 유료 사용자 늘리고, 충성도 높여야 교육 시장 파이도 커지지.\n\n\n\n\n그러기엔 너무 멀리 와버렸나? 오픈소스 비즈니스 어렵다 어려워. 그런데 내가 지금 엘라스틱 걱정할 때인가? 세상 쓸 데 없는 걱정이 연예인 걱정 그리고 엘라스틱 걱정 내년엔 스플렁크에나 집중하자. 25년이 얼마 안 남았다. 한 해 동안 방문해주신 분들 모두 해피뉴이어~\n\n\n관련 글\n\n2024년에 있었던 일",
    "reviews": [],
    "syllabus": [],
    "link": "https://kangmyounghun.blogspot.com/2025/12/2025.html",
    "pubDate": "2025-12-31T06:39:00.016Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "Virtualbox의 설치 오류 (업그레이드 오류)",
    "description": "Virtualbox를 업그레이드 하는 경우 이상하게 오류가 잘 발생한다. 이런 경우 십중팔구는 driver 문제이다. 기존 버전을 제거하고 새롭게 설치하는 경우라고 하더라도 아래와 같은 화면을 본다면 거의 99% drv 문제인 경우이다.\nVirtualbox : Installation failed Error: Fatal error during installation.\n\n\n이런 경우에는 재부팅하고 다시 시도하면 되는 경우도 있지만, 안되는 경우에는 다음과 같은 방법으로 시스템에 남겨진 드라이버 정보를 삭제하면 대부분 성공한다.\n \n1. 관리자 권한으로 powershell 실행\n먼저 관리자 권한으로 powershell을 실행한다. 꼭 파워쉘로 실행해야 한다. Windows11이라면 \"<Win + X>\"키를 눌러서 \"터미널(관리자)\"로 실행하면 빠르다. 혹은 \"윈도우 키\"를 누르고 powershell을 치면 \"관리자로 실행\" 혹은 \"Run as Administrator\"라는 메뉴로 실행해도 된다.\n<Ctrl-X>의 메뉴\n\n\n \n2. pnputil 명령 사용\n관리자 권한으로 powershell을 실행한 뒤에는 다음과 같이 pnputil 명령어와 Select-String을 이용해서 vbox 이름이 들어간 driver를 볼 수 있다.\npnputil /enum-drivers | Select-String -Pattern \"vbox\" -Context 1,0\n아래는 위 명령의 실행 예시이다. 결과를 보면 oem2.inf, oem11.inf, oem26.inf 의 드라이버 정보가 담긴 oem.inf 파일이 3개 보인다. oem inf 파일의 갯수는 조금 다를 수도 있다. 하여간 이들이 보인다는 것은 시스템에 Oracle Virtualbox 쓰레기 잔재들이 남아있는 것이다.\nPS C:\\Users\\SYKIM> pnputil /enum-drivers | Select-String -Pattern \"vbox\" -Context 1,0\n\n  게시된 이름:     oem2.inf\n> 원래 이름:      vboxsup.inf\n  게시된 이름:     oem11.inf\n> 원래 이름:      vboxusb.inf\n  게시된 이름:     oem26.inf\n> 원래 이름:      vboxusbmon.inf\n이들을 제거하기 위해 pnputil /delete-driver oem2.inf /uninstall /force 처럼 수동으로 일일히 명령을 내려도 되지만, 그러면 너무 귀찮아진다. 따라서 powershell script 명령으로 한방에 해결할 수 있다. 아래 코드를 복사해서 powershell 관리자 모드에서 명령하면 끝난다. \npnputil /enum-drivers | Select-String \"Published Name|Original Name\" -Context 1,0 | ForEach-Object { if ($_ -match \"Published Name\") { $pub=($_.Line -split \":\\s+\")[1].Trim() }; if ($_ -match \"Original Name\" -and $_.Line -match \"vbox\") { pnputil /delete-driver $pub /uninstall /force } }\n복붙이 어려운 분들을 위해서 아래에 다시 한번 적어두도록 하겠다. 친절하게 어디를 복붙해야 하는지 yellow색으로 색칠해두었다.\npnputil /enum-drivers | Select-String \"Published Name|Original Name\" -Context 1,0 | ForEach-Object { if ($_ -match \"Published Name\") { $pub=($_.Line -split \":\\s+\")[1].Trim() }; if ($_ -match \"Original Name\" -and $_.Line -match \"vbox\") { pnputil /delete-driver $pub /uninstall /force } }\n \n실행한 뒤에는 앞서 확인했던 pnputil /enum-drivers | Select-String -Pattern \"vbox\" -Context 1,0 명령으로 다시 한번 목록이 나오는지 확인한다. 아무것도 나오는게 없다면 재부팅 후에 다시 설치를 시도하면 된다.\n \n3. 잡담\n오라클 버추얼박스는 이상하게 설치, 삭제도 잘 안되고 사용 중에 자잘한 오류도 드럽게 많다. 아니 버전이 7.x까지 왔는데도 이런 기초적인 에러가 발생한다는 것은 개발진의 프로그래밍 능력이 심각하게 떨어지는게 아닌가 의심된다. 강의하러 갔다가 vbox 설치나 업그레이드 때문에 수강하는 분들 랩탑에서 에러 발생하면 진짜 당황스럽다. 얼마전에는 이거 잡다가 시간을 거의 1시간 넘게 허비한 적도 있다.\nVbox, 넌 좀 맞자~\n\n\n \n히스토리\n2025-12-28 릴리즈.",
    "reviews": [],
    "syllabus": [],
    "link": "https://sunyzero.tistory.com/323",
    "pubDate": "Sun, 28 Dec 2025 20:28:22 +0900",
    "creator": "sunyzero",
    "categories": [
      "컴퓨터 관련/윈도 패밀리",
      "pnputil",
      "VBox",
      "virtualbox",
      "virtualbox installation failed"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "2025년 블로그 결산",
    "description": "2025년, 블로그에 52개의 글을 썼습니다.\n건물주의 기쁨과 슬픔 블로그에는 8개)\n1인 개발자를 하면서 좋은 점 중 하나는 사색할 시간이 많다는 것입니다.\n\n익산의 미륵사지에서. 2025년 4월\n2025년에 가장 많이 읽힌 글을 정리해 봤습니다.\n\n\n10위 1인 개발자 셀프 인터뷰\n메이저 신문사의 어떤 기자님께 전화가 와서 인터뷰 내용을 메일로 보내드렸는데…\n\n9위 최고의 사무실은 바로 우리집 방구석\n사무실보다 집이 편하다는 이야기.\n\n8위 풀스택 인생 \n컴퓨터 말고도 인생에 재미있는 일들이 너무 많구나.\n\n7위 인플루언서여서가 아니라 시장이 원했던 거예요\n장난삼아 만들었던 색칠지도가 서비스가 빵 터지면서, 지인들에게 들었던 이야기에 대한 저의 대답.\n\n6위 52시간 보다 더 많이 일하고 싶은 자유\n주당 100시간 씩 일하며 뭔가 끝내주는 걸 만들어 보겠다는 사람들에게는 박수를 쳐주자.\n\n5위 개발자의 장애 공유 문화\n카카오 다닐 적, 장애 났을 때 동료들에게 장애 공유하던 썰.\n\n4위 루틴이 있었던 시절\n아직도 네이버 다니던 시절 매일 루틴하게 지내던 날들이 그립습니다.\n\n3위 AI 도구를 써도 돈 벌기는 힘들다\nAI 코딩을 안 쓰는 사람들은 이제 거의 없을 것 같습니다.\n\n2위 클로드 코드 맥스\n아직도 클로드 코드 맥스를 사용하고 있습니다.\n\n1위 진짜 1인 개발자 전성시대\n2026년에는 개발자, 기획자, 디자이너들이 각자 솔로로 바이브 코딩하며 미지의 땅에 깃발을 꼽으러 달려가는 해가 될 것 같습니다.\n\n구독해주시는 독자 여러분들께 감사드립니다. 항상 건강하시고 행복하시길 바랍니다.\n\n\n함께 읽으면 좋은 글:\n2023년 블로그 결산\n2024년 블로그 결산",
    "reviews": [],
    "syllabus": [],
    "link": "https://jeho.page/essay/2025/12/31/2025-last.html",
    "pubDate": "2025-12-31T06:06:00.000Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "방통대에 편입했다가 자퇴하며 여러 시도를 했던 2025년 회고",
    "description": "2025년도 보내줄 시간이 다가오고 있네요. 매년 하는 것처럼 올해를 어떻게 보냈는지 회고를 작성해봅니다\n과거 회고 글 모음\n    \n데이터 사이언티스트가 되기 위해 진행한 다양한 노력들\n2017년 회고, 2018년 계획\n2018년 회고, 2019년 다짐\nGap Year 및 쏘카 이직 이야기\n2019년 상반기 회고 및 글또 3기 시작\n초보 개발 팀장의 1년 회고 - 좋은 팀장이 되기 위한 노력들\n머신러닝 엔지니어의 2019년 회고\n5년 차를 앞둔 머신러닝 엔지니어의 2020년 회고\n2021년 회고 및 요즘 생각들\n2022년 ~ 23년 1분기 회고. 퇴사 후의 삶\n2024년 회고 - 기억하고 싶은 것과 요즘 생각들\n키워드 : 2025년 회고\n\n\n들어가기 전에\n올해를 어떻게 보냈는지 생각해보면, 사건들이 많진 않다. 왜 그런가 생각해보니 상반기엔 영어 공부를 하느라 시간을 많이 썼다. 직무적인 관점보단 인생에 대한 큰 관점이 더 많다.\n\n떠오르는 사건들\n대학원 진학 결심\n갑자기 대학원 진학을 고민했다. 이런 고민을 하게 된 배경을 자세히 설명해본다\n    \n교육을 하면서, 앞으로 또 어떤 것을 해야 할까?에 대해 고민했다. 어떻게 더 확장할 수 있을까? 한다면 어떤 방향으로 확장할 수 있을까?의 질문을 던졌다\n그러다가 지금 내 교육의 대상이 현업에 있는 사람들과 취준생이라는 것을 인지했고, 취준생 시기보다 더 이른 시기에 만나면 좋지 않을까?란 생각이 들었다\n주변에 교수를 시작하는 친구들도 생기고 있고, 교수는 아니더라도 강사 생활을 통해 학교에서 현업의 이야기나 어떻게 인생을 살아갈지에 대한 이야기를 해주고 싶었다. 인하대에서 김진상 교수님의 수업이 내게 많은 영감을 주었기 때문에 나도 그렇게 전달을 하고 싶었다\n특정 학교에서 강사 제안을 해주셨지만, 결국에 내가 석사 학위가 없어서 진행되지 않았다. 회사를 다녔다면 겸임 교수를 하는 길도 있을텐데, 당장은 회사를 다니지 않아서 진행하기엔 어려웠다. 교육 경력이 있어도 대학에서는 석사 학위에 대한 것을 요구했다\n위와 같은 생각을 하면서 대학에서 강의하기 위한 학위 취득을 고민했다. 그 과정에서 국내 대학원과 해외를 고민했고 지금 하고 있는 일이 있어서 풀타임은 어렵고 영어 공부도 하고 싶다는 마음에 미국 온라인 석사로 마음을 굳혔다.\n    \n미국 온라인 석사 과정은 조지아텍이랑 텍사스 오스틴이 많이 언급된다. 두 학교의 차이는 토플 점수의 컷과 합격률 등이 있었다. 지금 누가 물어보면 자세하게 이야기를 할 수 있을 정도로 정리가 되어있다. 교육 과정이 살짝 지향점이 다르고, 수강 신청 인원 제한이 있는 등 여러 가지 차이점이 있었다\nGeorgia Tech : 토플 100점, Texas Austin : 토플 79점\n조지아텍은 수강신청 인원 제한이 있고, 텍사스 오스틴은 없다. 인원이 다 차서 수업을 못 듣는 스트레스는 텍사스 오스틴이 없고, CS 관점으론 조지아텍이 조금 더 과목이 풍부하고 텍사스 오스틴은 AI쪽을 더 발전시키려는 움직임을 보인다\n25년 1월에 이 생각을 시작하고 2월부터 할 일을 하나씩 시작했다. 그래서 처음으로 시도한 것은 영어 공부(토플)이었다.\n\n영어, 토플 공부\n온라인 석사를 고민하는 사람들은 많지만, 결국에 하는 사람들은 적다. 그 이유는 여러가지가 있겠지만 회사를 다니면서 준비하는 것이 어렵다. 시도는 할 수 있지만 끝까지 하는 것이 어렵다. 온라인 석사 과정에서 제일 선행되어야 하는한 것은 영어 성적이나 서류 합격을 위한 작업이다. 토플 공부를 미루다가 토플도 제대로 안보고 포기할 수도 있다\n    \n그래서 상반기는 거의 영어 공부(토플)만 했다. 그래서 2~6월엔 떠오르는 사건들이 없고, 사진첩이나 캘린더를 봐도 토플의 연속이였다\n토플 시험을 보면서 느낀 점은 ‘와 토플은 정말 긴장도가 엄청 높아지는 시험이구나’였다\n    \n옆에 사람들이 비슷한 템포로 문제를 풀지만, 내가 리스닝을 할 때 스피킹을 시작하는 사람이 있다. 헤드셋을 껴도 잘 들리는 경우도 있고, 옆에 사람들은 하필 또 성량이 높은 사람이라 신경이 쓰인다\n그럼에도 불구하고 내 집중을 높이기 위한 전략을 쓰고, 그 와중에 내 답변을 잘 해야 했다. 이게 실제 면접이랑 거의 비슷한 것 같고, 코딩 테스트와도 비슷한 것 같았다. 평소에 연습을 잘 해두는 것이 중요한 이유다.\n그리고 토플 시험 보는데 드는 비용이 꽤 높다. 그래서 사람들이 시험을 최대한 미루려는 경향을 보인다. 그리고 토플을 좀 더 저렴하게 볼 수 있는 서비스들이 있는데, 이 서비스는 토플 시험비보다 저렴하게 서비스 가격을 구성했다(월 약 3~4만원). 장기적으로 결제를 하는 사람은 적겠지만 시험의 가격이 높으니 월 3~4만원이 상대적으로 저렴해지는 것 같다고 느꼈다\n    \n더불어 간절함이 큰 곳에 더 큰 돈이 몰린다는 생각도 했다. 유학 컨설팅 가격이 생각보다 높았다.\n토플 공부를 하는데, 나는 리스닝이 잘 안된다. 근데 토플의 라이팅과 스피킹은 다 리스닝과 관련 있다. 그래서 리스닝 자체를 올리는데 시간을 투자해야 했고, 리딩은 리스닝보단 괜찮았지만 역시 단어가 굉장히 중요했다. 그리고 빠른 시간에 슥 읽고 핵심적인 부분을 정리하는 것도 중요했다. 시험을 위한 영어라서 영어 실력이 개선되기도 하지만, 시험을 위한 공부를 하는 기분이었다\n막판에 성적이 살짝 부족할 때 아이엘츠를 살펴보기도 했다. 리스닝 관점에서 아이엘츠가 좀 더 수월했다. 아마 처음으로 돌아가면 토플보다 아이엘츠를 시도해볼 것 같다(영국식 영어라서 조금 다르긴 해도)\n처음 공부할 때는 100점을 목표로 했지만, 공부를 하면서 100점이 내게 좀 어려울 수 있겠다 판단했다. 그래서 토플 기준이 낮은 텍사스 오스틴을 생각했다. 텍사스 오스틴은 토플 점수 기준이 79점이긴 하지만, 합격률이 낮은 편이다. 반면 조지아텍은 토플 점수가 넘으면 합격률은 높은 편이다. 텍사스 오스틴은 컴퓨터 공학 학부 수업을 들었는지를 중요하게 판단하고, 레딧에서 확인하니 CS 필수 과목이라고 할 수 있는 6개 과목을 듣고 신청하는 것이 유리하다고 했다.\n결론적으로 오스틴을 지원할 점수는 만들었다. 오스틴 성적은 79점이라 높진 않지만 듣기 실력과 말하기 울렁증으로 참 어려웠다.\n2-3월에 토플 학원을 가기 위해 강남에 아침 9시까지 가서 수업을 들었다. 과거에 토익 공부를 하러 강남으로 갔던 것도 떠오르고, 학생이 된 기분이라 그 당시엔 즐겼다. 물론 성적이 바로 나오지 않을 땐 슬픈 적도 있지만 이럴 때 멘탈 회복을 빠르게 회복하는 방법을 알아서 잘 유지하곤 했다. 근데 다시 생각해도 토플은 보고싶지 않다…ㅋㅋㅋㅋ\n    \n토플을 본 직후에 RC/LC 점수를 보고 너무 슬퍼서 폭싹 속았수다를 보며 더 슬픔으로 덮었다. 드라마를 보니 내 슬픔은 크지 않을수도 있겠는걸.. 이런 생각도 들었다. 내 슬픔이 거시적으로 별거 아니라고 인식하면 슬픔이 사라지는 것 같다\n\n(영단기 홍보 아니고 내돈내산! 월수금 반이 해커스엔 없고 영단기에만 있었다. 영단기에서 강의를 들으면서 선생님과 AI로 토플 학습하는 아이디어 이야기하고 프로토타입 공유했는데 기회가 된다면 나중에 같이 일할 수도 있을 것 같았다)\n\n\n\n방통대 진학\n위에서 언급한 것처럼 미국 온라인 석사를 할 때 CS 필수 과목을 들었는지 확인해야 한다. 조지아텍과 오스틴이 요구하는 과목이 살짝 다르지만 공통적으로 쓸 수 있다. 이걸 어떻게 채울까? 고민하다가 방통대 진학을 하기로 결정했다. 학점 은행제도 할 수는 있지만 비용이나 일정을 고려하면 방통대가 좋고, 방통대 졸업을 하지 않아도 수업을 들었다고 증빙만 하면(성적 증명서를 발급할 수 있으면) 검토한다고 한다\n    \n방통대 컴퓨터 공학 3학년으로 편입했고, 첫 학기는 가볍게 운영체제, 알고리즘, 파이썬만 수강했다. 다시 돌아간다면 이산수학도 들을 것 같다. 오스틴은 이산수학도 요구하고, 조지아텍은 이산수학을 요구하진 않는다.\n한학기 등록금은 36만원 정도 되는데, 1학기 들으면서 강의 퀄리티에 감명을 받았다. 특히 운영체제, 알고리즘 교수님들 강의가 좋았다. 핵심적인 내용을 잘 전달해주셔서 강의를 하는 사람 입장에서도 영감을 받았다.\n중간고사 쯔음 수업은 오프라인 수업도 있고 온라인 수업도 있는데, 오프라인에 가서 수업을 듣는 경험도 오랜만이라 즐거웠다. 시간표가 맞지 않아서 목동에서 수업을 들은 적도 있고, 뚝섬역에서 들은 적도 있다. 둘 다 상관없이 즐거운 경험이였다\n기말고사 볼 때 다양한 분들이 방통대를 수강한다는 것을 깨달았다. 아버지 뻘 나이이신 분들도 수업을 듣고, 할아버지도 계셨는데 나도 나중에 저렇게 배움을 지속해야겠다고 다짐했다\n나중에 농사를 하면서 사는 삶도 생각해서 방통대 농학과에 진학하고 싶다는 생각이 들었다. 진짜 할수도..?\n\n\n\nGDE 활동\n예전부터 Google Cloud Champion Innovator 활동을 하고 있었는데, 3월에 이 프로그램과 GDE(Google Developer Expert)가 통합된다는 메일을 받았다\n    \nGDE는 구글 코리아의 커뮤니티 매니저분이 더 활발하게 소통을 한다는 장점이 있어서, 과거와 달리 더 소속감을 느끼게 되었다. 과거엔 메일만 주고 받아서 덜 소속감을 느꼈다\n과거에 GDE를 하고 싶다는 글을 썼던 적이 있는데, 결국에 되는구나..! 계속 무언가를 하다보니 이렇게 되네!라고 생각이 들었다. 바라고자 하는 것을 기록해두고 계속 노력하면 만나는 경우가 있다\n3월에 GDE + GDG 모임이 있어서 처음으로 가서 인사를 했고, 오랜만에 뵌 분들도 있었다.\n7월에 발표를 제안해주셔서 Google I/O Extended Incheon 2025에서 발표했다. 모교인 인하대에서 10년 전에 강의를 듣던 공간에서 강의를 할 수 있어 영광이였다.\n8월에 Google I/O Connect China가 진행되었고, 국내 GDE들이 갈 수 있다고 해서 가겠다고 해서 상해를 처음 다녀왔다\n    \n그 과정에서 경험한 것들은 GDE로 참여한 Google I/O Connect China 2025에 작성했다\n상해에서 만난 다양한 사람들을 통해 더 열심히 해야겠다고 다짐했고, 영어로 이야기하면서 영어의 중요성을 더 체감했다\n또 기억나는 것은 AI쪽 담당하시는 분이 군대 선임의 누나셨던 것. 엄청난 우연이라 그 때 선임 형에게 연락했다\n8월 기점으로 AI/LLM을 본격적으로 활용하게 되었다\n그 후에는 시간이 맞지 않아 발표하진 못했지만, 다음 해엔 좀 더 발표를 해볼 예정이다\nGemini 3.0이 나와서 AI Sprint에도 참여해서 제품들을 많이 써보고 글을 쓰고 있다. 앞으로 AI나 클라우드 내용을 더 자주 써보고 올릴 예정이다. 내가 자주 할 수 있는 것은 글을 쓰는 것!\n\n\n\n\n발표\n데이터야놀자 발표\n    \n6월에 데이터야놀자에서 개발자 글쓰기 커뮤니티 글또의 데이터 수집부터 데이터 활용까지 발표를 진행했다. 단순한 커뮤니티지만 데이터를 회사처럼 수집하고, 그 데이터를 어떻게 활용하는지를 다루었다. 지표 집계, 스프레드시트 기반 시각화, 데이터 파이프라인(BigQuery) 등 데이터 직무에 계신 분들에게 유용한 관점을 제시하고 싶었다. 회사에서 하는 것처럼 파이프라인을 구성했다\nGROUP BY CUBE 함수를 모르는 분들이 많아서 꼭 알려드리고 싶었고, 파이프라인 구성이 어렵지 않다는 것을 공유하고 싶었다. 유튜브에 영상이 있으니 관심이 있으시면 참고하면 좋겠다\n연차가 있는 분들이 데이터 업계를 위해 계속 발표를 해주면 좋겠다. 이제 나와 비슷하게 공부했던 분들이나 내게 영감을 주신 분들은 잘 보이지 않는다. 여러분들 모두 어디에 계신가요…?\nGoogle I/O Extended Incheon 2025\n    \n7월에 8년 넘게 개발 블로그를 하면서 깨달은 것들이란 주제로 발표했다. 인프런의 블로그 페이지뷰 300만이 알려주는 “실용주의 기술 블로그 글쓰기” 강의가 있지만, 내용을 똑같이 참고하지 않고 앞선 강의를 들은 분들도 영감을 받을 수 있게 새로운 내용들을 추가했다. 글쓰기 레벨을 확립한 것을 많이 인상 깊게 봐주셨고, 실행을 할 수 있게 도움을 드렸다\n마지막 장표에 이런 내용이 있었다 : 처음부터 AI한테 글을 쓰라고 하는 것이 아닌(헬스 PT 선생님에게 대신 운동해달라고 하는 느낌) 내가 일단 작성하고, 피드백 받는 방향으로 AI를 활용하는 것을 추천\n        \n이 내용은 AI 시대에 어떻게 학습하고, 어떻게 AI를 활용해야 할까에 대한 내 생각이다. AI를 그냥 사용하는 것보다 나의 발전을 위한 교보재로 쓰는 것이 더 좋다고 생각한다\nBOAZ 발표\n    \n11월에 BOAZ에서 발표했다. 내가 참여한 동아리라서 후배분들에게 최대한 영감을 많이 드리고 싶었다. 9년 전의 나는 어떤 사람이였고, 어떤 길을 밟아서 지금의 내가 되었는지 공유했다\n이 발표의 마지막 부분엔 AI를 어떻게 활용하는 것이 좋을까에 대한 내용을 전개했다. 이 당시에 개발하고 있던 것이 있어서 개발 환경을 그대로 보여줬다. 대학생분들이 자신의 진로에 대해 많이 고민해보고, 일단 많이 시도해보면 좋겠다. 그 과정에서 얻는 것들이 있을테니\nICT 인턴십\n    \n한국정보산업연합회에서 진행하는 ICT 인턴십에서 커리어 특강을 진행했다. 데이터/AI 직무에 대해 설명했는데, 요즘은 AI에 대해 더 관심을 가지고 있다는 것을 체감했다. 데이터보다 AI라는 단어가 많이 나왔는데, AI가 있기 전에 데이터가 필요하다는 것을 강조했고 어디서든 자신의 자리에서 경험을 늘려보라는 이야기를 전했다\n외부에서 진행하는 컨퍼런스 발표는 2회만 진행했는데, 26년에는 조금 더 많이 발표에 도전해야겠다.\n\n\n\n\n\nAI 엔지니어링 책 번역\n칩 후옌님의 AI 엔지니어링 원서를 번역했다. 이 작업은 올해 초부터 시작했는데 9월 말에 책이 출간되었다. 영어 공부를 하는 과정에서 책을 번역하면서 독해 공부도 했고, AI 엔지니어링 분야에 대해 더 깊게 이해할 수 있었다. 전통적인 머신러닝/딥러닝 위주로 일했던 사람이라 언제 AI를 더 공부할지 고민했다. 파운데이션 모델이 나올 시기부터 학습할 내용이 참 많았는데, 이 부분에 대해 해소할 수 있었다\n한빛미디어에게 24년 12월부터 연락해서 번역하고 싶다고 이야기했다. 이 책이 너무 좋아서 원서로 먼저 보면서 번역을 준비했다\n번역한 내용을 다시 보면서 진짜 많이 읽었다. 10번 넘게 다시 읽으면서 어떻게 해야 더 자연스럽게 표현할 수 있을까? 이해가 잘 안된다면 어떻게 번역해야 할까? 고민했다. 많이 보고, 반복한 결과 좋은 책이 나왔다\n감사하게도 교보문고 10월 IT 분야 판매 1위를 기록했고, 25년 12월 29일 기준 3쇄가 인쇄되었다. 많은 분들이 이 책을 통해 AI/LLM의 핵심적인 지식을 잘 이해하면 좋겠다. 시간이 지나도 변하지 않을 핵심적인 부분을 담은 책이다\n그리고 AI 엔지니어링을 활용해 인프런 챌린지를 진행했다. 인프런에서 챌린지를 진행한 것은 처음이였는데, 책을 읽으며 드는 생각들을 보면서 어떤 내용을 또 전달하면 좋을지 고민했고, 마지막에 있는 라이브 챌린지에서 내가 AI를 어떻게 활용하고 있는지에 대해 다루었다. 작게라도 AI를 써보면서 효용을 느끼시면 좋겠다\n번역 과정에서 이복연님의 이것이 번역이다를 읽고, 번역하는 과정에서 어떻게 해야 더 자연스럽게 표현할 수 있을까?를 생각했다. 직역보다 의역을 선택해서 저자님의 이야기를 독자분들이 더 잘 이해하도록 만드는 것이 역자의 역할이다. 두 집단의 연결 부분이라 이해에 초점을 맞췄다. 직역보다 더 이해가 잘 되도록 풀어서 쓴 부분도 있고, 이해를 위해 각주를 추가했다.\n\n\n\n\n\n\n방통대 자퇴\n위에서 방통대 진학이 나왔는데 같은 해에 자퇴가 나온다. 이렇게 생각하게 된 과정도 여러가지가 있는데 하나씩 작성하면\n    \n11월에 스스로에게 질문을 던졌다 : “지금 나는 행복한가? 활력이 넘치게 살고 있는가?” 이 질문에 대한 답은 그런 경우도 있지만 영어 공부를 하는 과정에서 활력은 적은 편이였다. 성적은 나왔지만 대학원에 가더라도 졸업까지 약 3년은 소요될 것 같다\n이어서 이런 질문을 던졌다 : “3년 후에 어떤 세상이 되어 있을까?” 이 질문에 대해 답은 알 수 없지만, 지금과는 완전히 달라질 수 있다는 것. AI가 더욱 발전할 것이고 그 이후에 교육은 어떻게 되야 할까? 이런 질문으로 이어졌다. 대학에서 진행하는 교육보다 조금 더 변화가 필요하지 않을까? 먼 미래를 생각하는 것보다 지금 할 수 있는 다른 방향으로 고민하는 것이 더 보람찰 것 같다는 생각이 들었다\n3년 후를 생각해보니 그 때를 생각하는 것보다 현실적인 지금 할 수 있는 것에 집중하는 것이 좋다는 결론에 이르렀다.\n위 생각을 하는 과정에서 클로드와 제미나이와 3자 대면으로 4시간 넘게 대화했다. 내 내면을 더 이끌 수 있는 질문을 던지라고 프롬프트를 작성하고 내 생각을 작성하고, 계속 개선했다. 그 결과 보내주기로 결정했다\n방통대 기말고사가 12월인데, 방통대를 진학하면 시험 공부를 위해 꽤 많은 시간을 써야 하고 그 시기에 하루 8시간씩 2주 교육이 진행 예정이었다. 그래서 너무 무리하게 하는 것보다 집중할 것에 집중하기로 결정했다\n누군가는 그럼 휴학하면 되지 않냐고 물어보겠지만, 그럼 계속 아른거릴 것 같아서 그냥 자퇴로 결정했다. 자퇴 신청하니 빠르게 승인이 되었고, 학기 중에 빠르게 자퇴 신청을 해서 등록금의 40% 정도를 돌려 받았다.\n누군가 방통대를 고민한다면 목적에 따라서 추천한다. 강의 퀄리티도 괜찮고 내가 어떤 부분에 부족함이 있었는지 알게 된다. 다만 회사 업무 외에 방통대에 집중할 수 있을 때 하는 것을 추천한다. 욕심은 졸업까지 발목을 잡게 된다.\n나중에 다시 기회가 된다면 대학원에 갈 수는 있지만, 당장은 시대가 변하는 것을 지켜보며 지금 할 수 있는 것을 할 것 같다. 만약 회사를 다니고 있었다면 오히려 심플하게 대학원에 진학했을 것 같다. 몇년 후에 어떻게 살고 있는지 살펴봐야지\n\n\n\n\n강의 - 오프라인 교육을 시도했다\n2025년에도 인프런에 강의를 내려고 했으나, 상반기는 영어 공부로 삭제가 되고 하반기는 상반기에 못한 일을 진행하느라 하반기에 강의 촬영을 못했다. 그래도 강의 기획이나 자료를 조금씩 만들고 있다. 26년에는 강의를 1-2개 정도 내는 것을 목표로 한다. 강의를 더 빠르게 내기 위해 무엇을 해야할지 고민한다. 단순히 AI에게 프롬프트나 대본 쓰고, 커리큘럼 쓰라고 하면 일반적인 내용이 나온다. 결국 기획은 내가 직접 하는 것이 필요하고 AI가 강의 내용을 자세히 써준다고 해도 자세히 보면 엉성한 부분이 많다. 그래서 AI보다 직접 하는 내용이 많다. 단순 작업이나 다른 방향으로 AI를 더 쓰는 것이 좋지 않을까? 생각하고 있다. 자동화 관점에서는 AI가 좋다고 하지만 AI가 만드는 강의 퀄리티는 성에 차지 않는다. 이것도 내년엔 바뀔 수 있을까? 싶지만 (NotebookLM의 발전을 보면) 그래도 여전히 직접 만들고 싶다\n부스트캠프 AI Tech는 여전히 강의를 진행하고 있다. AI 개발 기초, Product Serving, 러닝 마스터 역할. 매 기수마다 계속 내용이 개선되고 있고, 항상 진심을 담아 도와주려고 노력한다. 요즘은 캠퍼분들이 목 상태를 고려해서 천천히 말씀해주셔도 괜찮아요!라는 피드백도 온다. 예전엔 너무 길게 한다는 의견도 있었는데 상반된 의견을 받으니 감사하다. 부스트캠프 AI Tech 수료생분들 모두랑 만나는 날이 있으면 좋겠다\nBigQuery(SQL) 오프라인 교육을 꽤 많이 진행했다. 하반기에 총 200시간 강의한 것 같다. 전서연님의 제안으로 하게 되었는데, 온라인 교육과 달리 오프라인 교육에서 수강생분들을 직접 만나는 경험이 좋았다. 어떻게 해야 더 잘 알려줄까? 어떤 부분을 모르는구나 이런 것들을 생생하게 볼 수 있었다\n    \n그 결과 강의 실력이 더 좋아졌다. 모르는 부분이나 애매한 부분을 직접적으로 알려줄 수 있고, 보조 자료도 많이 만들었다\n다만 목 상태가 여전히 고민이다. 하루 8시간씩 2주 강의를 하면 목에 무리가 간다. 물론 요즘은 관리하는 방법을 터득해서 심하게 아프진 않지만, 회고를 쓰는 시점에 역류성 후두염에 걸렸다. 목 상태는 괜찮은데 위산이 후두로 역류해서 후두가 상한 상태. 어쩐지 목이 계속 가래가 낀 느낌이 들더라. 장기적으로 더 할 수 있을까?에 대한 생각은 계속 있다. 조만간 오프라인 교육을 그만할 수도 있을 것 같기도 하고.. 아직 결정을 내리진 않았다\n여름에 한 강의의 수료생분들이 종종 인스타로 연락이 오는데, 그 강의 들을 때 생각이 난다고 힘이 되었다는 이야기를 들으면 뭉클하고 다 잘되면 좋겠다\n11월에 방통대 자퇴를 결정하고, 강의도 더 즐겁고 재미있게 하려면 뭘 해야 할까? 생각했다. 그리고 AI 엔지니어링 번역하면서 AI/LLM을 활용해보자! 라는 생각에 수강생 자동 질문 답변 시스템을 만들었다. 교육의 보조 자료인 셈인데, 강의를 듣다가 궁금한 것들이 있으면 질문을 하는 웹페이지다. 프롬프트를 공들여서 했고, Gemini 2.5 Flash Lite를 사용해서 비용이 거의 들지 않는다. 이 제품을 계속 고도화할 예정이다. 요즘은 제품 개발이 재미있고, 동시에 여러가지를 돌린다. Antigravity도 큰 도움을 주고 있다\n강의 마지막 시간엔 SQL의 다양한 패턴을 정리한 내용을 공유하며 짧은 편지를 주고 있다. 이 패턴들을 토대로 자신만의 Cheat Sheet를 만들 수 있길\n\n\n\n\n\n인프런 지식 공유자 모임\n글또에서 진행한 강의 만들기 모임에서 강의를 만든 승현님 은찬님이 연말에 진행한 인프런 지식 공유자 모임에 간다고 해서 나도 갔다. 을지로에서 판교까지 가는 길이 너무 멀었지만! 같이 진행한 사람들과 사진을 찍고 싶어서 갔다. 병진님도 같이 하면 좋을텐데 아쉽게 영국에 계셔서 그건 다음으로..!\n오랜만에 뵌 인프런 직원분들도 여전히 따뜻했다. 그리고 GDE 동기(?)이신 박해선 님과 이야기를 나누었다. 나중에 또 만나서 담소를 나눠야겠다\n지식 공유자 모임에서 올해도 상을 주셨는데 더 열심히 해야지.. 잘 해보자…! 여러분 인프런 많이 이용해주세요\n\n\n\n\n개발\n10월 연휴에 비사이드에서 진행하는 SOLO 포텐데이에 참여했다. 1인 개발을 단기간에 경험하도록 하는 프로그램이였는데, 이 기간 내에 프로토타입을 개발했다\n영어 일기 첨삭 웹페이지를 개발했는데, 첫 배포는 1시간만에 진행했다. 그리고 계속 써보면서 기능을 추가했다. 이 시기까지 토플을 공부하던 시기라 내 라이팅 실력을 올리기 위한 피드백 서비스를 개발했다. 실제로 주변 지인에게 공유하니 퀄리티가 좋다고 쓰는 분들이 있다. 이걸 토대로 어떻게 해야 내가 더 공부하게 만들 수 있을까?에 대해 계속 시도하고 있다\n    \n프론트엔드에 대해 자세히 몰라도 AI와 함께 협업하며 혼자 개발을 할 수 있다. 게다가 Firebase Studio를 사용하면 서버 비용 이슈도 크게 줄어든다. 나는 Firebase Studio를 사용해서 개발하고, Firebase로 배포하고 Firestore to BigQuery Extension을 사용해 데이터를 BigQuery로 저장한다. 저장된 데이터는 개인화를 위해 사용된다\nAI가 좋더라~라는 말을 듣고 책을 보는 것보다 자신이 사용할 서비스를 만드는 것이 더 재미있고 빠르게 배운다. 도파민이 생겨서 계속 개발하게 된다. Claude Code 토큰이 만료될 때까지 계속 개발하는 내 모습을 보면서 아 이거 중독되네… 싶었다. 실제로 주변에 클로드 코드 맥스 쓰는 분들은 엄청나게 많은 개발을 시도하고 있다\n이런 경험들을 하면서 미래의 개발 형태는 바뀔 수 있겠다고 생각했고, 아키텍처를 잘 설계하는 것과 의사결정을 잘하는 것이 더 중요해지는 시기가 다가온다고 느꼈다. 아키텍처 설계에 대한 내용도 공부도 하고 계속 시도도 하면서 실력이 올라가고 있다\n아래 이미지는 개발한 영어 일기 첨삭 웹. 매일 쓰고 있다. 피드백도 잘 해주고, 영어 단어도 추천해준다. 이걸 토대로 개인화까지 거의 완성했다. 나중에 사람들에게 공유해야지\n\n\n\n\n여행\n상반기에는 아무것도 안하고, 하반기에 여행을 다녀왔다. 상해(구글 행사 겸), 호주(멜버른, 시드니), 치앙마이, 그리고 국내는 글또 10기 운영진 MT를 2박 3일간 강릉으로 다녀오고, 쏘카 데이터 본부 사람들과 정선에 있는 강원랜드에 다녀왔다\n\n상해\nGoogle I/O Connect China에 참여하기 위해 상해에 방문했다. 행사 4일 전에 출국해서 먼저 상해 여행을 했다. 처음엔 혼자 다닐까 고민하다가 숙소를 찾아보니 다 더블 베드라서 친동생에게 물어봤다. 동생이랑 나이 차이가 6살이 나는데 여태 같이 여행을 간 적이 없다. 그래서 이번 기회에 같이 여행을 다녀오면 좋을 것 같아서 동생에게 일정 가능한지 물어봤다. 이 때 동생에게 “비행기만 너가 알아서 하고 나머진 내가 다 냄”이라고 말해서 동생이 바로 ㄱㄱ!!!라고 외쳤다\n동생은 해외 여행을 많이 안해봐서, 이번 기회에 같이 데려가서 경험을 시켜주고 싶었다. 나도 상해는 처음이지만 동생도 처음이였다. 사실 동생과 첫 여행이 상해라는 점이 기쁘다. 6살 차이가 어릴 땐 컸는데 이젠 다 비슷하다. 동생이나 나나 의견이 강한 편이 아니라 그냥 내가 일정 후루룩 짜고 제시하고 수정할 부분이 있으면 수정해서 여행을 즐겼다\n밀크티는 진짜 많이 먹었고, 우전 수향마을도 참 이뻤고, 헌이우이치엔 양꼬치도 맛있었다. 양꼬치 먹으면서 진지한 대화도 하고 동생을 더 잘 이해할 수 있고 그래도 힘든 일이 있어도 잘~ 살자!라는 이야기를 많이 했다\n그리고 내년에도 같이 일본 여행을 가기로 했다\n상해가 인상 깊은 도시인 점은 전기차가 참 많다. 이게 왜 많은지 AI랑 대화해보니 상하이선 차량을 구매하고 번호판도 구매해야 하는데 번호판의 가격이 1,000 만원이 넘는다. 다만 전기차를 구매하면 번호판이 더 수월해지고, 취득세도 할인해준다. 기타 혜택이 많아서 전기차를 안탈 이유가 없다고 한다. 그리고 인프라도 잘 깔려있어서 어디서나 쉽게 충전을 할 수 있다. 이런 정책을 탑다운으로 시행하는 과정이 신기했다.\n그리고 알리페이 앱 하나로 대부분의 서비스를 이용할 수 있다. 중국에 가면 알리페이, 위챗, 고덕 지도 정도만 있으면 충분하다. 앱 안에 앱이 또 있는 형태인데 이게 가능한가? 싶었는데 중국이라서 가능했다. 한국은 개인 정보의 이슈로 불가능하다.\n    \n그리고 중국의 디디추싱 서비스도 타봤는데, 디디추싱 앱을 보면 타다 시절에 일했던 시기가 떠올랐다. 리텐션을 늘리기 위해 쿠폰 제도도 있고, 앱 내에서 광고도 노출하고, 탑승 장소에 대해 자세한 지침을 주는 등 과거에 타다에서 시도하려고 했던 것들이 구현되어 있어서 신기했다. 그 당시에 같이 일하던 동료들에게 이 사실을 알리기도 했다.\n운이 좋다면 돌아다니는 로봇도 볼 수 있다. 정말 내가 생각한 중국과 다르구나를 느꼈다\n도시도 이쁘고, 물가도 저렴해서 주변에 여행지 고민할 때 상해를 추천한다. 다만 8월엔 기온이 최대 38~39까지 올라가서 추천하진 않는다\n상하이 여행 정보가 필요하면 상하이 여행 정보 링크를 참고하면 된다. 중국어 단어와 헌이우이치엔 줄스는 방법에 대해 작성했다\n\n\n멜번\n상해에 귀국하고 3일 뒤에 호주 여행을 떠났다. 애드파워 동기였던 로운이와 떠나는 여행이였는데, 재미있었다. 둘이 여행한 것은 처음인데 잘 조율하며 다녔다. 멜번이 특히 좋았던 이유는 대자연을 볼 수 있었고, 동물을 볼 수 있었기 때문이다. 애드파워 동기였던 아미와 연락해서 오랜만에 만났는데 시간이 흘러도 여전히 잘 지내고 있다는 점이 좋았다\n    \n현지인분이 멜버른이 아니라 멜번이라고 발음해야 한다고 해서 멜번이라고 발음하고 있다\n멜번 대학교에 갔을 때 석사 진학 뽐뿌가 왔었다… 진짜… 오프라인으로 갈까? 멜번 대학교에 로보틱스 관련 연구실을 밖에서도 볼 수 있었는데 연구에 몰두하는 대학원생분들을 보며 공부에 대한 의지가 올라갔다\n멜번 공항에서 UberX를 타려고 하는데, 다른 지역의 우버와 다르게 차량이 오면 순서대로 탑승하고, 우리의 Pin 번호를 주면 된다. 놀이기구 타는 느낌인데 어떻게 보면 이게 더 효율적일 것 같았다. 호출 후 차가 오는 것을 기다리는 것이 아니라 차가 오고 고객의 탑승 정보를 제공하는 것이라 UX가 완전 반대라고 느꼈다. 그렇지만 이게 효율적일 수도 있지\n    \n이런 현상의 이유도 찾아보니까 호주 공항들은 택시/라디으쉐어 업체에 엄격한 규정을 적용해서 PIN 시스템을 사용한다. 그리고 공항 피업존에 우버 차량이 몰려서 잘못된 차에 타는 거을 방지하려고 했다고 한다. 그리고 공항에서 가짜 우버 기사가 승객을 가로치는 일이 있어서 이런 PIN 인증 시스템을 사용한다\n찾아보니 미국에서 특정 혼잡 지역, 영국, 유럽 일부, 인도에서도 이런 방식을 적용한다. 국가마다 규제나 시스템이 다르니까 다르게 쓰는구나를 깨닫게 된 사건\n동물원에서 쿼카, 캥거루를 봤느데 캥거루를 보니까 엄마는 참 위대하다고 느꼈다. 다 큰 캥거루를 안고 가는데 그런 모습을 보며 부모님을 떠올렸다. 어릴 땐 느끼지 못했는데 나이가 들며 부모님에게 감사함이 커진다\n멜번에만 있는 피콜리나 젤라또 맛집이 진짜 기가 막힌다. 다시 가고 싶다..\n그리고 빅토리아 주립 도서관은 너무 이뻤다. 여기서 공부하고 싶었는데 시간이 없어서 못했다. ㅋㅋㅋ 나중에 간다면 여기서 공부를 해봐야지!!! 그리고 퍼핑빌리 기차도 너무 재밌었다. 또 쿼카가 너무 귀엽다.. 쿼카 최고\n\n\n\n\n\n\n시드니\n시드니는 2회차라서 거의 가이드처럼 다녔다. 과거에 가지 못했던 바다도 가고, 시드니에서 요리 공부했던 NFNG 사장님인 재권이형이 추천해준 가게를 가는 재미도 있었다.\n저녁에 하버브릿지에서 오페라 하우스쪽으로 걸어오는 것도 기억에 남는다. 참 아름다운 도시다.\n시드니 2회차여도 여전히 안해본 것들이 많아서 안해본 것들을 해봤다. 페리 타보기, 돌고래 투어 등\n호주에서 지오펜싱 기술을 모빌리티 서비스에 적극적으로 도입하는 것을 알 수 있었다. 버스 내릴 때 카드를 찍어야 하는데, 미리 찍으면 아직 지오펜스 내가 아니라서 찍히지 않았다. 그냥 지나칠 수 있는 일이지만 이젠 왜 이게 생겼지?를 생각하는 습관이 생겼다. 이런 습관이 생기니 여행도 더 즐겁게 다닐 수 있다\n    \n삼성페이로 버스를 탈 수 있다는 것도 신기했다. 삼성페이 어디까지 발전하나요? 너무 감사합니다 삼성..\n맨리비치에서 아버지와 자식이 같이 운동하는 것을 봤는데, 참 보기 좋았다. 아버지와 어떤 것을 같이 해볼까 고민했다\n레밍턴 케이크 맛집을 귀국하는 날에 찾았다. 아… 거기를 첫 날부터 갔어야 했는데!! 진짜 다시 가면 레밍턴 케이크 매일 1개씩 먹을 것이다. Flour and Stone이란 곳이다\n시드니 여행지 모음에 시드니 여행에 대한 가이드를 정리했다. 주변에 시드니 간다는 사람에게 공유하고 있다\n\n\n치앙마이\n귀국하고 쏘카에서 만난 그랩과 치앙마이에 가게 되었다. 정말 갑자기 가게 되었는데, 치앙마이 비행기가 35만원이라 갑자기 가게 되었다\n치앙마이에서 스쿠터를 타고 다니면 정말 이동이 편하구나를 느꼈고, 덕분에 치앙마이에서 여러 동네를 다닐 수 있었다. 둘 다 치앙마이 1회차가 아니라 관광보다는 진짜 일에 집중했다. 그 와중에 수영도 하고 헬스장도 가고 건강하게 보냈다\n목표를 명확하게 잡으니 집중할 수 있었고, 생각해보니 그랩이랑 예전에 맹그로브 고성도 같이 갔었는데 두번째였다. 그랩과 상황도 비슷해서 여러 이야기를 하면서 집중할 수 있었던 시간이였다\n치앙마이 기억을 떠올리면 이 헬스장이 떠오른다.. 정말 강렬했다… 다들 엄청난 몸을 가지고 계셨다.\n\n\n글또 운영진 MT\n글또 10기를 끝냈고, 잘 마무리를 했다. 아쉬워하는 분들도 있지만 장기적으로 운영을 하려면 여러 요소가 선행되어야 하고, 그걸 하고 싶은지 생각해보면 아직은 그렇지 않아서 중단하기로 결정했다\n    \n커뮤니티를 운영하며 든 생각들은 글또 1~10기. 7년의 커뮤니티 운영 회고에 기록했다\n글또 10기를 마치고 3달 후, 운영진 MT를 강릉으로 갔다(2박 3일). 정말 좋은 숙소를 가겠다고 다짐해서 정말 좋은 곳을 찾아왔다. 어떤 분들은 여기 연애 프로그램 촬영장 아니냐고 말했지만 아무 일도 일어나지 않았다\n내가 좋아하는 음식들을 먹이고, 가리비도 먹이고, 잘 먹을 수 있도록 여러 요리도 했다\n2일차에 모두 사진 찍으러 가는 길에 비가 너무 많이 왔다ㅎ.. 돌아보면 추억이긴 하지만, 그 때 비가 많이 와서 너무 미안하긴 했다\n그래도 잘 놀고, 잘 쉬었다\n운영진분들을 위해 내가 선물 키트도 만들었다. 메타몽 마카다미아 쿠키도 구웠다\n내가 참 좋아한 강릉. 안목해변 근처에서 삼교리 동치미 막국수 먹고 젤라또 먹는 루트를 운영진분들에게 공유했다. 다들 좋아해서 뿌듯했다\n\n\n정선 카지노\n정선 카지노는 다들 가보자고 해서 갔는데, 카지노 입장을 위해 사전 신청을 하고 추첨을 통해 결과를 알려준다\n근데 가려고 하는 사람들 모두 다 합격했다고 하는데 나만 불합격이였다 ㅋㅋㅋ 그 때부터 벌써 가챠가 시작되었다\n사람들이 전날 저녁에 가면 들어갈 수 있을지도 모르니 가보자!해서 갔고, 들어갈 수 있었다\n처음엔 너무 어렵고 무서워서 초심자들끼리 다녔는데, 카지노에 뉴비존(일명 온보딩 지역)이 있다. 거기서 간단히 수업을 듣고 어떻게 해야 하는지 감을 익히고 시도했다\n같이 간 형이 돈을 버는 것을 보고 나도 시도했는데, 난 탕진했다ㅋㅎ 데이터 기반 의사결정 그런거 안통한다. 그냥 한다… 하다가 앞으로 해도 각이 안나오겠는데 싶어서 4만원만 썼다. 체험 비용으로 10만원 생각했는데 그 전에 잘 멈췄다. 빠른 의사결정..!\n카지노에서 사람들이 더 게임을 하도록 어떤 장치가 있는지 살펴보고, 사람들의 표정도 살펴봤다. 오 이런 곳이구나.. 참 신기한 곳이네.. 생각하면서도 제품에서 이걸 적용하려면 어떻게 하려나? 생각했다.\n정선이 참 멀지만 날씨가 좋아서 소풍 가는 기분이였다. 이 모임이 예전에 쏘카에서 바람의 나라 모바일 나와서 같이 하던 사람들인데 이제 게임은 하나도 안하고 가끔씩 만나는 모임이 되었다\n\n\n요즘 생각들\n나만의 동기를 얻는 방법 : 콘서트\n올해는 어쩌다 보니 콘서트를 많이 다녔는데, 콘서트에서 엄청난 영감을 얻는다\n올해는 스텔라장, 유다빈밴드, JYP, 로이킴 콘서트, 아이유 팬밋업에 다녀왔다. 모든 공연들이 다 좋았고, 각자의 깨달음이 있었다. 그렇지만 제일 인상 깊었던 것은 JYP(박진영님) 콘서트\n    \n권진아 님이 공연을 시작해주는데, 권진아 님의 노래를 직접 들으니까 더 빠져들게 되었다\n심사위원이였던 박진영 님과 참여자였던 권진아 님의 장면을 보니, 나도 나중에 강의 수강생분들과 같이 일할 수 있을까?를 생각해보게 되었다. 시간이 흘러 서로를 리스펙할 수 있게 된 관계가 된 것. 너무 멋졌다\n공연 중간에 박진영 님이 음이란 무엇일까?에 대한 이야기를 해주셨는데 자신만의 철학이 너무 좋았다. 음이란 무엇일까? 음악이란 무엇일까? 로 시작하는데 음이 길을 걸을 때 음악이 된다\n내가 왜 콘서트를 좋아하나 생각해보니까, 콘서트는 단순히 노래만 부르는 곳이 아니고 어떤 컨셉을 가질지 고민하면서 스토리텔링을 한다. 이 노래를 왜 이 타이밍에 배치했고, 요즘 느끼는 것을 공유한다. 행사 기획이랑 같은 맥락인데, 개인의 생각이 많이 담겼다\n자신에게 도움을 준 외삼촌, 외숙모, 엄마, 작곡가 형이 공연에 왔다고 언급하는 것도 보기 좋았다. 사람은 혼자 발전하는 것이 아니고 모두 도우며 산다\n사람들에게 모두 일어나서 즐겨요!라고 하셨는데 재밌었다. 부모님 나이이신 분들도 많이 왔는데, 나중에 콘서트에 부모님도 같이 와도 좋을 것 같다고 생각했다\n2시간 50분 정도를 쉼 없이 계속 달리셨다. 어떻게 저렇게 달리시지? 6년 후 환갑이신데 체력이 대박이다.. 나도 저 나이에 저럴 수 있을까? 생각하면 지금부터 열심히 운동해야겠다\n한 회사의 경영자(물론 정확히는 CEO는 아니고 CCO)가 열심히 본업을 하는 것도 대단했다. 보통 저 자리에 있으면 안하는 경우도 있던데\n같이 나이가 들었지만, 여전히 현역처럼 공연을 하는 것이 동시대의 사람들에게 감동일 것 같다. 내가 90년생 연예인분들에게 느끼는 감정과 동일하지 않을까?\n관객들의 함성을 듣고 싶어서 인이어를 계속 안끼고 노래를 했다. 이게 참 대단한 포인트. 노래가 밀리는 느낌도 없었다\n환갑 때 자신의 인생에서 끝내주는 콘서트를 할 예정이라고, 6년 남았다고. 갑자기 나도 환갑에 어떤 일을 하고 있을지 생각해보게 되었다. 다른 사람의 질문은 내게 영감을 준다\n콘서트가 이렇게 흥이 날 수 있구나!를 깨닫게 해준 콘서트. 계속 신났다. 이런 에너지를 준다는 것이 정말 좋다\n박진영 님이 정말 명곡을 많이 냈다는 것을 깨달았다. 소재가 많으면, 할 수 있는 이야기도 다양하다는 것을 깨달았다. GOD, 원더걸스 등\n결국 끝까지 살아남은 사람이 이기는 것. 한때는 최고가 되고 싶었던 적도 있지만 이제는 최고보다는 끝까지 가고 싶다고 말하신다. 나는 어떤 끝을 향해 가고 있는가?\n50살이나 60살이나 늦지 않았다. 지금부터 시작하면 된다. 어르신들이 자주 말하는 말이 이 나이에 뭐~라고 하는데 그냥 해보는 것. 그게 참 중요하고 나이가 들어도 동일하다\n박진영 님의 콘서트를 나중에 또 가고 싶다는 생각이 들었고, 이런 경험을 할 수 있어서 감사했다\n박진영 님의 루틴을 따라하려고 아침마다 올리브 오일을 시도하고 있는데 아직 적응은 안된다….. 내 올리브 오일이 맛이 없는건가?\n앞으로도 주기적으로 영감을 받기 위해 여러 콘서트를 가야겠다. 일단 2월에 10CM 콘서트도 신청했다\n\n\n\n\nAI에 대한 생각\n2025년의 AI는 정말 빠르게 발전했다. 그와 동시에 우리의 삶이 윤택해지기도 하지만, 불안함을 가지고 오기도 한다. 이제 앞으로 어떻게 살아야 할까?라는 질문이 컨퍼런스에서 종종 나온다\n    \n근데 나는 여전히 크게 걱정하진 않는다. 여전히 개발자 필요하고, 데이터 과학자/분석가 필요하다. 미래를 걱정할 수는 있지만 산업 혁명 때의 이야기를 찾아보면 직업 형태의 변화가 있었고, 대규모가 영구적인 실업난을 겪은 기록은 찾기 어렵다.\n그래서 너무 고민하지 말고 AI가 나오면 써보고, 내가 겪는 문제를 고민하고 그러면 되지 않을까\n요즘 같은 시기에 여전히 본질이 중요하다. 본질을 잘 이해하는 상태로 AI 적용하고 그러면서 계속 더 시도하는 것. 그게 진리가 아닐까?\n기술은 계속 바뀐다. 내년엔 또 새로운 것들이 우수수수 나올 것이다\n더 나아가서 누구에게나 도구가 있기 때문에 생각하는 힘, 호기심이 더욱 중요한 가치가 될 것 같다\n그래서 나는 너무 걱정하지 않고 지금 할 수 있는 일들을 하는 편이다\n11월에 방통대를 자퇴하고 어떻게 해야 더 재밌게, 즐겁게 일을 할 수 있지? 그리고 어떻게 해야 더 잘할 수 있지? 강의도 어떻게 더 하지? 이런 고민을 하며 필요한 제품을 만들었다\n    \n그 결과 만든 것이 수강생들을 위한 QnA 시스템. 사람들이 꽤 많이 쓰고, 프롬프트도 잘 작성해서 자세한 답변을 하고 있다\nAI 개발하며 떠오른 것들\n    \n기획을 구체화하는 것이 중요하지만, 제품을 만들기로 다짐했다면 최대한 빨리 배포하기. 나는 시작하고 1-2일차부터 제일 작은 버전 배포하고 계속 쓰면서 수정했음\n처음에 기획, 목표, 와이어프레임, PRD가 있으면 좋다. 근데 작게 시작한다면 없어도 무방한 것 같다. 물론 있으면 더 잘 정돈되는 느낌이 있음. 이 부분은 PM/기획자분들이 잘 진행할 것 같음\nSpeckit을 활용해서 스펙을 명확히 정의했다. Speckit에서 권장하는 흐름(specify -> clarify -> plan -> tasks -> implement)이 있는데, 작은 스펙이라고 생각하면 이 중간 단계를 건너뛰어도 무방하다. 이건 어떻게 보면 사람이 문서를 잘 작성해야 할 일을 AI에게 위임한 것으로 봐도 좋을 것 같다\n배포를 어디에 할 것인가 생각을 해보면 좋다. 나는 Firebase Studio를 활용해서 진행했는데, Firebase와 통합이 잘 되어서 바로 배포를 진행했다. IDE 에서 미리보기를 할 수 있는 URL을 주는데 그건 마치 Dev 겸 내 Local처럼 사용했고, 배포하곤 Prod 환경이라 생각했다. Firebase를 안 쓰면 Vercel + Supabase 조합이 무난하다\n제품을 만든다고 하면, 오류 메시지를 잘 추적해야 한다. 개인이 시작한다면 Sentry 추천한다. 월에 오류 5000개까지 무료인데, 월에 이 정도 오류가 나는 트래픽이라면 오히려 행복해야 할 것 같다\n그와 동시에 사용자 유저 로그도 수집하면 좋다. Google Analytics 4가 무난하다. 일단 추가하고 이벤트를 심자. 그리고 데이터를 BigQuery로 Export해두자\nClaude Code, Gemini CLI 모두 수준급이다. 선택의 문제거나 컨텍스트가 많이 필요하거나 스킬이 필요할 때 선택하면 되는 것 같다\nGitHub에 브랜치를 따고 PR하는 과정에 AI를 도입해도 좋다. 코드 리뷰를 해주는 AI 활용했는데 코드 정리하기 수월했다.\n디자인은 디자인 시스템을 차용해서 디자인 시스템 관련 마크다운을 만들어서 참고하라고 하면 좋은 것 같다. 특정 상황에 어떤 것을 쓰라고 지침을 남겨두면 된다. 이건 회사에서도 공통적으로 참고하고 있을듯\n데이터를 잘 관리하면 좋다. 어떤 질문이 들어오고 어떤 output이 나왔는가? 이건 LLMOps쪽에선 랭스미스 같은 제품을 쓰면 된다. 구글의 GenKit은 이런 것이 없어서 그냥 데이터를 BigQuery에 저장해서 확인해야 할 것 같다. 혹은 데이터 포맷만 맞추면 다른 프레임워크에서 쓸 수 있다.\n어뷰징을 방지하기 위해 프롬프트에 무제한 Input을 허용하지 말고, 제한을 두자. 실제로 지인이 바로 10000자 테스트를 하려고 했음(일기 아닌데 그냥 텍스트 뭉치 붙임^^..)\nGemini API가 굉장히 저렴하다. 일단 Gemini로 시도해보고 원하는 답변이 안나오면 모델을 고민해도 좋을 것 같다. Gemini Flash Lite도 내 작업에선 성능이 좋았음.\nclaude.md 에서 작업이 끝날 때 항상 WORK_LOG.md 작성하라고 해서 작업일지를 작성했다. 이렇게 보니까 지금까지 뭘 했는지 알 수 있다\n더 나아가서 MCP 붙여서 지라나 컨플루언스에 티켓 바로 만들게 할 수도 있을 것 같다. 지라/컨플을 쓰진 않아서 안했지만 노션 칸반에 추가하는 것 가능할 것 같다. 회사에서 일하는 것과 비슷하게 해야지.\n배포했다고 끝이 아니다. 좀 더 해야 한다. 사이드 프로젝트를 단순 배포만 하고 끝내는 경우가 많은데, 계속 해야 한다.\n생각보다 한번 하면 큰 그림을 빠르게 깨닫는다. 한번 하는 것이 어렵지, 해보면 계속 하게 된다. 이런 것도 챌린지처럼 도와주면서 참여자가 할 수 있게 만드는 프로그램을 만들 수 있을 것 같다.\nAI를 활용하며 개발할 때 고민해야 하는 부분\n    \n어느 수준까지 AI에게 위임할 것인가?\n코드를 모두 다 이해할 것인가? 혹은 큰 아키텍처만 이해할 것인가?\n문제를 디버깅할 때 얼마나 시간을 투자할 것인가?\n필수 문서를 어떻게 작성할 것인가?\n버전 관리를 어떻게 할 것인가?\n로그를 어떻게 저장할 것인가?\n오류를 어떻게 대응할 것인가?\nAI 비용을 어떻게 컨트롤할 것인가?\nAI가 개발을 할 때 무엇을 해야 할까? (기획 다듬기, 다른 작업하기, 독서하기 등)\n왠만한 작업은 AI와 잘 진행할 수 있어서 이제 아이디어를 잘 생각하고, 실행하는 것. 이 두가지의 가치가 중요해질 것 같다.\nAI에 대한 지식은 AI 엔지니어링 번역하며 많이 배웠다. 칩 후옌 선생님이 필요한 핵심을 정말 잘 정리해주셨다\nAI 엔지니어에 대한 정의는 변하고 있다\n    \n(1) AI 모델을 직접 만드는 엔지니어\n(2) AI API를 사용해서 제품을 만드는 엔지니어\n지금은 둘 다 AI 엔지니어라고 부르는 것 같은데, 전자의 사람들이 점점 직접 모델을 만들지 않고 후자의 길로 가는 경우도 있는 것 같다. 이런 흐름에 따라 AI 엔지니어의 역할도 점점 애매해지고 있는걸까? 백엔드 개발자가 하는 것이 더 좋을 경우도 있다\n        \n그러나 전통적인 머신러닝의 방법을 차용해서 AI 엔지니어링에 적용할 부분이 분명 있다. 꽤 효과가 있는데, 아직 연결이 되어있지 않은 것 같다\n직접 모델을 만들고 서빙하는 사람이 필요하기에 이 분야에 대해 계속 갈고 닦으면 길이 있을 것이다. 이쪽 라이브러리는 정말 많이 나오고 사라지고 있다\n\n\n\n놓아주는 것의 중요성\n올해는 방통대 편입 ~ 자퇴가 공존하는데, 이 결정을 한 후에 든 생각은 “놓아주는 것이 중요하다”였다. 종종 가지고 있는 것들에 계속 새로운 것을 추가하느라 힘들어하고, 번아웃을 겪는 사람들을 본다. 놓아주는 것이 쉽지 않다고 말하는데, 쉽지 않을 수 있지만 그렇기 때문에 놓는 것이 더 필요하지 않을까?\n모든 것을 가질 수 없다. 적절히 선택을 해야 하고, 매몰 비용이 있더라도 그냥 놓는 것이 앞으로 다가올 시간을 생각했을 때 더 좋을 수 있다. 놓지 못하는 것도 습관이 되어있을 수 있는데, 놓는 것도 습관처럼 연습을 해야하는 것 같다\n대학원을 가지 않겠다고 결정하니 오히려 후련했다. 생각해보면 난 학부 졸업하고 일을 했던 사람으로 계속 그렇게 살려고 했다. 무림에서 정파와 사파가 있으면 나는 정파는 아닐 것 같고, 사파에 가깝지 않을까? 라는 생각이 들었다. 사파인데 정파처럼 하려다가 아 이거 내 길이 아니네 깨닫고 사파로 계속 가는 그런 사람이 나의 모습인 것 같다. 그래도 영어 공부를 하면서 활력을 얻었고, 평온한 호수에 돌을 던져서 움직일 수 있는 동력을 얻었다! 너무 만족스럽다. 이런 방황이 오히려 더 나은 길로 가고 있는 것이라 믿음\n요즘은 잘 놓았더니 너무 행복하고, 하루 하루 즐겁다. 에너지가 넘쳐서 무엇이든 할 수 있을 것 같다(토플 빼고)\n    \n그냥 내 자리에서 할 수 있는 최선을 다 해보자. 강의도 하고, 요즘은 중고등학교까지 확장하고 싶다는 생각도 들고, 뭐든 많이 해보자는 생각을 하고 있다\n회사 경험도 소중해서 좋은 제안이 온다면 그리고 나의 마음이 움직인다면 할 수도 있다고 생각한다\n\n\n\n요즘에 중요한 가치는 무엇일까\n요즘 행복하고 싶다, 행복의 중요성에 대해 이야기를 잘 안한다. 왜 그럴까 생각해보니\n    \n불행함이 있을 때 행복을 추구하는 것 같고, 나는 평온한 상태에 있기 때문에 행복!!을 외치지 않는 것 같다. 고요함을 유지하고 있는 시기랄까\n그래서 인생이 설레고 내일 일어날 때 또 뭘 해볼까! 이런 생각이 든다.\n이런 생각을 원래부터 하던 사람은 아니였고, 의도적으로 긍정적인 생각을 한다. 떠오르지 않으면 의도적으로 내가 기대되는 사건들을 만든다. 예를 들어 새로 생긴 잠실 메타몽 팝업을 간다거나, 해보지 않은 경험을 시도한다거나 등\n요즘 AI의 발전 이후로 커리어에서 더 불안함이 많아지고 있는 것 같다. 어디든 가면 AI가 우리를 대체할까? 라는 질문을 하는 분들이 있고 자신이 가지지 못한 것에 대해 고민하는 분들이 예전보다 더 보이는 것 같다\n    \n불안한 부분에 포커스를 맞춰서 생각하면 계속 불안해진다. 그거만 생각하니까. 그래서 나는 불안한 것보다 긍정적인 것이나 더 좋은 부분만 많이 보려고 한다(낙관적 사고)\n내 마음 먹기에 따라서 세상을 낙관적으로 바라볼 수도 있고, 비관적으로 바라볼 수 있다. 나는 낙관적 사고를 의식하지 않아도 생각하고 있고, 그러면서 사람에 대한 연민도 많이 느낀다. 다들 조금 더 잘되면 좋겠는데..!\n다른 관점으로 생각하면 내가 하고 싶은 것이 무엇인지 몰라서 걱정이 있는 경우도 있는 것 같다\n    \n하고 싶은 것이 없으니 뭘 해야할지 모르겠고, 그러다가 걱정으로 되는 것. 그리고 답이 나오지 않는 어려운 문제일 것 같다\n흑백 요리사 시즌 2를 보면서 좋아하는 것을 하는 사람들의 얼굴은 저런 모습이구나, 불안감보다 잘하는 것에 집중하는 모습을 보며 왜 흑백 요리사에 열광을 하게 되는지 느끼고 있다\n        \n어떤 참여자는 기존에 하던 것을 멈추고 새로운 방식으로 도전하는 사람도 있다. 우리의 삶도 비슷하지 않을까.\n혹은 용기가 아직 없어서 머뭇거릴 수도 있을 것 같고, 작은 성취를 만들어서 계속 더 굴려야 하는 것 같다\n낙관적으로 세상을 바라보면서 안정적인 환경을 만들었다면, 어느 시기가 지난 후 또 의도적으로 나가는 것이 좋지 않나?라는 생각이 든다\n    \n안정적인 상태도 계속 있으면 고여버린다. 조금씩 새로운 경험을 얻어서 새롭게 발전하는 모습이 필요한 것 같다\n나도 올해 영어 공부를 했던 것이 안정적인 환경이고 굳이인 것을 시도해서 새로운 경험과 생각을 얻었다. 뭐라도 해야 뭐라도 얻을 수 있다. 집에만 있는 것이 아니라!\n어떤 시기엔 유지도 중요하고, 어떤 시기엔 시도가 중요하고 시기에 따라 계속 변한다. 발산하고 수렴하고 발산/수렴 프레임워크로 생각하며 산다\n일단 작게 시도하고, 결과를 보고, 그리고 또 시도해보고, 안되면 또 다른 결정해서 또 새로운 길로 가고, 되면 그 길 더 가보고 이게 인생의 큰 진리 중 하나인 것 같다\n또 중요한 것은 유연하게 변하는 능력(메타몽처럼), 실행력, 저항감 이기기\n    \n빠르게 발전할 때 중요한 것은 기본기라고 생각하고 기본기가 있을 때 유연하게 환경에 변화하면서 발전하면 된다. 너무 갑자기 변화하지 않아도 괜찮고 상황에 맞게 적절한 변화가 필요하다\n그 변화를 하는 과정에 실행력이 필요하고, 하기 싫다는 저항감을 이기는 것도 필요하다\n의사결정을 할 때 너무 현실적인 생각을 하는 것보다, 때로는 그냥 하고 싶은 방향으로 하고 의미는 몇년 후에 시간이 지난 후 생각해봐도 괜찮다. 의미를 나중에 아는 경우도 있다\n\n\n\n1인 사업자 4년차\n퇴사한지 벌써 4년이 지났다. 오랜만에 만나는 사람들과 이야기를 나누면 벌써 시간이 그렇게 되었냐고 말한다. 생각해보면 4년이 진짜 빠르게 지나갔다. 할 일들을 계속 처리했는데, 아직도 할 일이 많다\n4년 정도 지나니까 이제 어떻게 하면 더 좋을지가 보이는데 이런 내용들에 관심을 가지는 분들이 있다면 내 경험담을 자세히 다루는 시간을 만들어도 좋을 것 같다\n그냥 퇴사하고 1인 사업자를 하겠다고 하는 분들에겐 덜 추천을 드리고, 미리 준비를 하고 나오라고 권한다. 그리고 세법을 잘 파악해보라고 권한다…\n연차로는 이제 내년이면 내가 10년차라고 한다. 와 진짜 시간이 왜 이렇게 빠른가? 정신을 차리니 이렇게 되어 있다. 1년차가 볼 때는 10년차가 대단해 보일 수 있지만, 내가? 10년차? ㅎ??? 이런 생각이 들기도 한다. 예전에 내가 바라본 10년차 분들도 그랬을까\n    \n할 수 있는 것들이 여전히 많으니 즐겁게 하자~\n\n\n\n올해의 장소 : 광진 정보 도서관\n토플 공부를 하거나 업무를 할 때 자주 방문한 도서관\n한강뷰 자리에 가려면 8시 20분에 도착해야 해서, 진짜 부지런하게 다녔다. 8시 20분에 입실해서 퇴실 시간인 22시까지 있었던 날도 많다\n다들 열심히 공부하시니 나도 집중해야지! 이런 생각이 들고, 시간이 진짜 빨리 가는 공간이라 마치 정신과 시간의 방 같았다\n멀진 않은데 집에서 버스 타고 20분 거리라서 오랜 시간 있을 때 간다. 강이 바로 옆에 있어서 산책하기도 좋고, 평일 점심엔 뷔페가 근처에 있어서 점심 걱정도 적다\n나만의 집중 공간을 만들어서 집중이 필요하면 그 공간에 가면 좋다. 습관 형성 관점에서 새로운 공간에서 새로운 습관을 만들기 수월하다.\n\n\n\n올해의 물건 : 로봇 청소기\n진짜 편하다. 왜 이제 알았을까?\n로봇 청소기를 쓰면서 아 로보틱스 공부를 하고 싶다!! 이런 생각이 들었다. 올해 계획 중 하나였는데 토플하느라 미뤄졌는데 이제 다시 슬슬 올려볼까?\n상해 갔을 때도 로봇이 보여서 너무 신기했다. 로보틱스 관련 일을 할 수 있다면 가슴이 뛸 것 같다.\n글또 10기 운영진분들 모두 감사합니다..\n\n\n올해의 책 : 다정함이 인격이다\n심리 관련 책 중에 가장 인상 깊고, 도움이 되는 책이다. 도서관에서 구매하고 다시 구매했다. 그만큼 다시 보면 좋을 책이고, 많은 사람들이 읽고 힘을 얻으면 좋겠다\n자세한 내용은 인스타그램에 작성했다\n\n\n\n간단한 다짐\n사실 내년에 뭘 이루고 싶다라는 것이 떠오르진 않는다. 오늘을 잘 살아보자!라는 생각만 가득하다\n내년에 강의를 최소 하나는 내고 싶고, 그동안 미뤄둔 책 집필을 이젠 하고 싶다. 예전부터 이야기를 해둔 출판사가 있어서 초고를 쓰고 고민해야겠다\n여러 경험을 하고, 그걸 또 수렴하고 나중에 후회하지 않도록 즐겁게 여러 활동을 해야겠다. 최근 안했던 독서 모임도 참여해보거나 내가 열거나!\n작년 회고에 과거에 했던 것 다시 해본다면? 많이 시도하기, 데일리 다이어리 작성하기, 도전해보기, 초심 잃지 않기, 사람 소중히 여기기는 거의 다 생각하며 살았던 것 같다. 내가 힘들었을 때 도움을 준 친구들에게 감사하다고 갑자기 이야기하며 고마움을 표현했다.\n요리도 더 많이 해보기. 요리를 하면 할수록 재미있다. 이제 마카다미아 쿠키도 굽는다… 메타몽 틀이 생겨서 뭐할까 고민하다가 마카다미아 쿠키도 굽는 삶. 밀가루 덜 쓰면서 베이킹을 하는 방법도 있는 것 같은데 찾아봐야지\n\n글 작성하는데 걸린 시간 : 9시간",
    "reviews": [],
    "syllabus": [],
    "link": "https://zzsza.github.io/diary/2025/12/30/2025-retrospective/",
    "pubDate": "Tue, 30 Dec 2025 00:00:00 +0000",
    "creator": "Unknown",
    "categories": [
      "diary",
      "diary"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "P09_Modular_Humanoid_Lite / 유니티 검사(칼잡이) 애셋 무료 이벤트로 받은거 돌려보았습니다.",
    "description": "새해 매일매일 이벤트 중입니다.\n총 8개 에셋을 매이매일 주고 있습니다.\n\n\n위에껀 이미 다 뿌렸구요\n \n\n\n오늘부터 이렇게 4개 남았습니다.\n \n링크: A Free Asset Every Day  \n\n\n이런식으로 쿠폰 있습니다.\n결재창에서 세금 여부 선택한다음에 쿠폰을 입력할 수 있습니다.\n세금 이랑 쿠폰 UI 가 좀 이상해서 잘 안되게 되있으니\nUI 에 익숙해 지셔야합니다.\n \n이번건 풀버전은 아닙니다.\n이번에 주는건 라이트 버전이고 \n풀버전이 따로 있습니다.\n풀버전 링크: P09_Modular_Humanoid | 캐릭터 | Unity Asset Store\n영상: DARKDECEMBER 쉬운 성장안 KR 16x9 ACP\n\n\n\n이상하다 머리카락 안움직이던데 ...\n\n\n할인 안하면 접근하기 어렵겠군요\n \n \n \n \n \nP09_Modular_Humanoid_Lite  유니티 애셋 리뷰 시작\n\n\n에셋 이름이 특이하군요 마치 ... 개발자 센스 인가 ..\n \n\n\n임포트전 화면입니다.\n폴더 이름을 알 고 있어야 지울때 한번에 지울 수 있겠죠\n \n모듈러를 강조하는걸로 봐선 장비를 갈아 끼울 수 있는거 같은데 ...\n \n망가진 머티리얼 (유니티 6.3 사용중)\n\n\n데모씬 첫화면 입니다. \n머티리얼이 옛날껀가 봅니다. 표시가 안되네요\n고쳐보고요\n \n\n\n \n머티리얼이 호환은 안되겠교\nULit/Texture\n로 바꿔 줬다.\n노멀 텍스쳐가 있긴한데 내가 셰이더가 없어서 못쓰겠다.\n유료로 셰이서 하나 살 예정이라 일단 간단하게 보는걸로\n \nSample 씬\n\n\n기능은 없는 씬이고 남/여 두개를 보여준다.\n \n \nDemo 씬 영상\n영상: http://www.youtube.com/watch?v=xM2k_5fPWMk&feature=youtu.be\n\n\n\n갈아낄 수 있는 부품이 많지 않고 있는거 가지고 알아서 제작하라는뜻 같습니다.\n요즘은 사진으로 3D 만드는 서비스가 있어서 쉽게 활용 할 수 있겠습니다. \n저는 셰이더를 하나 구매해야겠군요",
    "reviews": [],
    "syllabus": [],
    "link": "https://serverdown.tistory.com/1551",
    "pubDate": "Mon, 29 Dec 2025 13:46:53 +0900",
    "creator": "SIDNFT",
    "categories": [
      "프로그래밍/유니티 에셋 리뷰",
      "유니티",
      "유니티애셋",
      "유니티애셋리뷰"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "일관성 있는 Agentic AI Workflow를 팀 프로젝트에 적용하는 법",
    "description": "AI 구독은 저절로 팀 생산성을 높여주지는 않는다.개인의 노하우가 휘발되지 않고 팀의 자산으로 축적되는 워크플로우를 설계하는 것이 AI 시대 리더의 핵심 역할이다.단계별 컨텍스트 분리 + 결정적 검증(CI) + 비결정적 판단(LLM) + 작은 변경 단위로 굴러가는 일관된 워크플로우를 팀단위로 적용할 것을 제안한다. 개요 코딩 에이전트가 개발의 필수 도구가 된 지금, AI를 쓰지 않는 개발자를 찾기가 오히려 어렵다. […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://01010011.blog/2025/12/28/how-to-build-a-consistent-agentic-ai-workflow-for-team-projects/",
    "pubDate": "Sun, 28 Dec 2025 03:12:48 +0000",
    "creator": "bahamoth",
    "categories": [
      "programming",
      "agent",
      "ai",
      "tidying",
      "workflow"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "무조건 첫 번째로 써야 할 '인생 GPT' 3개 공개 (우선순위,딥리서치,원페이지 보고서)",
    "description": "하루 종일 바쁘게 일했지만 정작 중요한 일은 하나도 끝내지 못했던 경험, 다들 있으실 겁니다. 복잡한 업무 속에서 길을 잃지 않고 핵심에 집중하게 돕는 '인생 GPT' 3가지를 소개합니다. 우선순위 정리부터 딥 리서치, 그리고 임원을 위한 원페이지 보고서 작성까지,  최신 AI 기술로 여러분의 업무 효율을 혁신적으로 높여줄 비법을 공개합니다.\n바쁜 일상 속, 김과장의 고민: \"뭐부터 해야 할까?\"  \n아침에 출근해서 밤새 쌓인 메일과 업무 목록을 보고 머리 아파 본 경험, 다들 있으실 겁니다. 제 주변 동료들도 \"뭐부터 해야 할지 모르겠어요!\"라며 한숨 쉬는 경우가 정말 많아요.\n김과장님도 오늘이 그런 날인데, 보통은 눈앞의 급한 일부터 처리하곤 하죠. 하지만 이러면 중요한 업무는 뒷전이 되고, 하루 종일 바쁘기만 한 채 성과는 없는 경우가 많습니다. 바로 여기서 우리의 첫 번째 '인생 GPT'가 빛을 발합니다!\n\n\n첫 번째 인생 GPT: '지금뭐부터?' - 업무 우선순위 정복  \n쏟아지는 업무 속에서 \"지금 뭐부터 해야 가장 효율적일까?\"라는 질문에 명확한 답을 주는 GPT가 바로 '지금뭐부터?'입니다. 이 GPT는 단순히 중요도나 긴급도만으로 업무를 판단하는 것을 넘어섭니다.\n  '지금뭐부터?' GPT, 어떻게 활용할까?\n김과장님이 오늘 처리해야 할 업무 목록을 그대로 '지금뭐부터?' GPT에 입력하면 됩니다. 그러면 GPT는 각 업무를 다음 네 가지 기준으로 분석해줍니다. 제 경험상, 이 4가지 기준이 정말 핵심이더라고요.\n중요도: 업무의 전략적 가치와 결과의 파급력.\n긴급도: 마감 기한과 즉각적인 처리 필요성.\n에너지 소모: 해당 업무를 수행하는 데 필요한 정신적, 육체적 에너지.\n기대 효과: 업무 완료 시 예상되는 긍정적인 결과.\n  팁: 특히 '에너지 소모' 항목은 정말 중요해요. 저도 예전에 중요하지만 에너지를 많이 쓰는 일을 오후에 붙잡고 있다가 효율이 급격히 떨어지는 경험을 많이 했거든요. 오전에 집중력이 최고일 때 핵심 과업을 처리하고, 오후에는 비교적 에너지가 덜 드는 업무를 배치하는 것이 현명하죠.\n'지금뭐부터?' GPT는 이렇게 분석된 데이터를 바탕으로 업무를 세 가지 그룹으로 최적화하여 제시합니다.\n즉시 실행 그룹: 고객사 방문, 협의 결과 정리 등 오늘 하루의 성패를 좌우할 핵심 과업. 최우선적으로 처리해야 합니다.\n계획 실행 그룹: 미팅 후 인지 피로를 고려하여 분할 실행이 필요한 업무들. 위임이나 축소가 가능한 부분은 최소한의 메모로 대체하여 에너지를 효율적으로 배분합니다.\n보류 또는 위임 그룹: 당장 급하지 않거나 타인에게 맡길 수 있는 업무.\n이렇게 명확하게 정리된 실행 순서를 보면, 복잡했던 머릿속이 싹 정리되는 느낌을 받을 수 있을 거예요. 김과장님도 이제 뭘 해야 할지 확실히 알게 되었죠!\n\n\n \nChatGPT - 지금 뭐부터?\n오늘의 할 일 목록을 입력하면 중요도·긴급도·에너지·효과 기준으로 우선순위를 정리하고 가장 효율적인 실행 순서와 선택 전략을 제안합니다. 생산성, 번아웃 방지, 집중력 관리까지 고려한\nchatgpt.com\n\n \n\n\n두 번째 인생 GPT: '리서치광' - 심층 시장 동향 보고서 완성  \n오후 5시, 김과장님은 고객사 방문을 무사히 마치고 월간 시장 동향 보고서를 작성해야 합니다. 그런데 이게 만만치 않죠. 국내외 친환경차 부품 기술 트렌드, 경쟁사 수주 현황, 심지어 원자재 가격 변동 추이까지... 솔직히 이 모든 것을 처음부터 직접 리서치하고 분석하려면 한 달은 족히 걸릴 겁니다. 특히 인테이크 매니폴드 같은 경우 알루미늄이나 플라스틱 복합재로 만들어지니, 원자재 가격이 곧 '원가'에 직결되잖아요. 이런 전문적인 내용을 빠르게 파악하고 정리하는 것이 정말 중요하죠.\n여기서 우리의 두 번째 '인생 GPT', 바로 '리서치광'이 등장합니다!\n  '리서치광' GPT, 활용의 정석\n'리서치광' GPT는 여러분의 짧은 요청 사항을 받아 마치 전문 리서치 애널리스트처럼 아주 상세하고 구조화된 프롬프트로 확장해줍니다. \"이런 관점도 보세요, 저런 데이터도 포함하세요\"라고 조언해주는 것과 같아요. 저는 이 기능에 처음 접했을 때 정말 감탄했어요. 단 세 줄의 요구사항이 체계적인 리서치 가이드로 변신하는 마법을 직접 경험해보세요!\n생성된 프롬프트를 활용하여 이제 본격적인 딥 리서치를 시작합니다. 챗GPT의 심층 리서치 기능을 활성화하고 웹 검색을 병행하며 데이터를 수집합니다. 여기서 그치지 않고, 좀 더 다양한 자료 확보를 위해 제미나이의 딥 리서치 기능도 함께 활용해보세요. 사람이 한 달 걸릴 리서치를 단 몇 분 만에 끝내는 놀라운 경험을 하게 될 거예요.\n\n\n \nChatGPT - 리서치 광 (The Research Maniac)\n모든 주제에 대해 심층리서치 전용 프롬프트로 확장합니다.\nchatgpt.com\n\n \n  리서치 결과를 프레젠테이션으로!\n리서치가 완료되면, 이 자료를 가지고 프레젠테이션을 만들어야겠죠? 제미나이에서 생성된 리서치는 자체 PDF 다운로드 기능이 없으므로, '내보내기' 기능을 통해 구글 Docs로 넘긴 후 PDF로 저장하는 것이 좋습니다. 이제 이 PDF를 구글 노트북LM에 업로드합니다.\n노트북LM에서 문서 분석이 완료되면, 우측의 '슬라이드 자료' 버튼을 활용해 \"월간 정기보고서 형식의 슬라이드 구조로 생성해줘 (프리미엄 딥 네이비 & 골드 테마)\"와 같이 요청합니다. 잠시 기다리면 시장 동향부터 기술 로드맵, 원가 분석 및 구체적인 실행 계획까지 완벽한 논리 체계와 시각 자료를 갖춘 전문 비즈니스 전략 보고서가 뚝딱 완성됩니다. 정말 놀랍죠? 저는 이 기능을 통해 보고서 작성 시간을 획기적으로 줄일 수 있었어요.\n⚠️ 주의: 노트북LM 자체에도 딥 리서치 기능이 있지만, LLM에서 실행한 리서치는 보고서 형태로 제공되는 반면, 노트북LM은 리서치된 문서들을 개별적인 소스로 가져오니 사용 목적에 따라 적절히 선택해야 합니다.\n\n\n세 번째 인생 GPT: '한장으로 가져와' - 임원을 위한 원페이지 보고서  \n이제 저녁 7시, 김과장님은 오늘 다녀온 고객사 출장 보고서를 작성합니다. 내일 아침 임원 보고가 예정되어 있으니 빠르고 정확하게 작성해야 하죠. 김과장님이 작성한 보고서는 회의 내용, 기술 사양, 일정 협의 등이 빼곡하게 담겨 있어 매우 상세합니다. 하지만 여기서 간과하지 말아야 할 점이 있습니다. 바로 '실무자 관점의 보고서'와 '임원이 원하는 보고서'는 형식이 완전히 다르다는 것!\n많은 임원들은 세부 내용보다는 \"결론이 뭐야?\", \"우리가 뭘 결정해야 해?\", \"리스크는 뭐야?\"를 빠르게 파악하고 싶어 합니다. 이런 상황에서 장황한 보고서는 오히려 역효과를 내기 쉽죠. 이럴 때 필요한 것이 바로 세 번째 '인생 GPT', '한장으로 가져와'입니다.\n  '한장으로 가져와' GPT, 의사결정의 핵심!\n이 GPT는 여러분이 작성한 상세한 출장 보고서나 회의록을 받아 경영진의 최종 판단을 이끌어내기 위한 핵심 내용으로 압축 정리해줍니다. 고객 신뢰 확보와 리스크 관리 사이의 선택지를 명확히 비교하고, 전략적 통찰과 실무적 결단력을 동시에 확인할 수 있는 자료로 탈바꿈시켜주죠.\n특히 인상 깊었던 점은, 임원 결정 요청 부분이 체크박스 형태로 제공된다는 것이었어요. 예를 들어, '양산 일정 8주 단축 결정 (A안)', '현행 유지 및 리스크 관리 강화 (B안)', '추가 검토 지시'와 같이 명확한 선택지를 제시하는 거죠. 임원 입장에서는 길게 읽을 필요 없이 핵심만 파악하고 바로 체크만 하면 되니, 의사결정 시간을 획기적으로 단축할 수 있습니다. 정말 편하겠죠? 저도 이 기능을 사용하면서 임원분들의 만족도가 확 올라가는 것을 체감했습니다.\n\n \nChatGPT - 한 장으로 가져와 GPT\n실무자가 작성한 보고서·메모·회의록을 임원이 즉시 판단할 수 있는 의사결정 중심 보고서로 재구성합니다. 결론, 선택지, 리스크, 결정 요청만 남기고 불필요한 설명은 제거합니다.\nchatgpt.com\n\n \n\n\n\n  핵심 요약\n1. '지금뭐부터?' GPT: 중요도, 긴급도, 에너지 소모, 기대 효과를 고려한 최적의 업무 우선순위를 제시하여 하루의 생산성을 극대화합니다.\n2. '리서치광' GPT: 짧은 요청을 상세한 프롬프트로 확장, 다중 LLM을 활용한 딥 리서치로 전문 보고서 및 슬라이드 작성을 몇 분 만에 가능하게 합니다.\n3. '한장으로 가져와' GPT: 상세한 실무 보고서를 임원 의사결정에 최적화된 원페이지 요약본으로 재구성하여 빠르고 효율적인 결정을 돕습니다.\n4. 2025년 최신 AI: 이 모든 GPT는 2025년 최신 AI 기술을 활용하여 업무 효율을 혁신적으로 변화시킬 수 있는 강력한 도구입니다.\n이 세 가지 '인생 GPT'는 김과장님의 하루를 바꾸었듯, 여러분의 업무 방식에도 혁명적인 변화를 가져올 것입니다. 지금 바로 경험해보세요!\n❓ 자주 묻는 질문 (FAQ)\nQ1: '지금뭐부터?' GPT는 단순히 할 일 목록을 정리해주는 건가요?\nA: 아니요, '지금뭐부터?' GPT는 단순한 목록 정리를 넘어섭니다. 각 업무의 중요도, 긴급도, 에너지 소모, 그리고 기대 효과라는 네 가지 핵심 기준을 바탕으로 분석하여, 가장 효율적인 실행 순서와 함께 '즉시 실행', '계획 실행' 등의 그룹으로 분류해줍니다. 이는 업무의 전략적 배치와 에너지 관리에 큰 도움을 줍니다.\nQ2: '리서치광' GPT로 작성된 보고서는 얼마나 정확한가요?\nA: '리서치광' GPT는 사용자의 짧은 요청을 바탕으로 아주 상세하고 구조화된 프롬프트로 확장하여 여러 LLM(ChatGPT, Gemini 등)의 딥 리서치 기능을 활용합니다. 웹 검색을 포함한 광범위한 데이터 분석을 통해 정보를 취합하므로, 전문적인 수준의 정확성과 심층도를 기대할 수 있습니다. 단, 최종 보고서 활용 전에는 항상 핵심 내용에 대한 교차 검증을 권장합니다.\nQ3: '한장으로 가져와' GPT는 모든 보고서에 적용할 수 있나요?\nA: '한장으로 가져와' GPT는 특히 경영진이나 의사결정권자를 위한 보고서에 매우 효과적입니다. 상세한 실무 보고서나 회의록을 핵심 내용과 의사결정 포인트를 중심으로 압축하여 제공하므로, 빠르고 명확한 판단을 유도하는 데 최적화되어 있습니다. 물론, 내부 팀원 간 공유를 위한 보고서 등 목적에 따라 유연하게 활용할 수 있습니다.\n{\"@context\":\"https://schema.org\",\"@type\":\"FAQPage\",\"mainEntity\":[{\"@type\":\"Question\",\"name\":\"'지금뭐부터?' GPT는 단순히 할 일 목록을 정리해주는 건가요?\",\"acceptedAnswer\":{\"@type\":\"Answer\",\"text\":\"아니요, '지금뭐부터?' GPT는 단순한 목록 정리를 넘어섭니다. 각 업무의 중요도, 긴급도, 에너지 소모, 그리고 기대 효과라는 네 가지 핵심 기준을 바탕으로 분석하여, 가장 효율적인 실행 순서와 함께 '즉시 실행', '계획 실행' 등의 그룹으로 분류해줍니다. 이는 업무의 전략적 배치와 에너지 관리에 큰 도움을 줍니다.\"}},{\"@type\":\"Question\",\"name\":\"'리서치광' GPT로 작성된 보고서는 얼마나 정확한가요?\",\"acceptedAnswer\":{\"@type\":\"Answer\",\"text\":\"'리서치광' GPT는 사용자의 짧은 요청을 바탕으로 아주 상세하고 구조화된 프롬프트로 확장하여 여러 LLM(ChatGPT, Gemini 등)의 딥 리서치 기능을 활용합니다. 웹 검색을 포함한 광범위한 데이터 분석을 통해 정보를 취합하므로, 전문적인 수준의 정확성과 심층도를 기대할 수 있습니다. 단, 최종 보고서 활용 전에는 항상 핵심 내용에 대한 교차 검증을 권장합니다.\"}},{\"@type\":\"Question\",\"name\":\"'한장으로 가져와' GPT는 모든 보고서에 적용할 수 있나요?\",\"acceptedAnswer\":{\"@type\":\"Answer\",\"text\":\"'한장으로 가져와' GPT는 특히 경영진이나 의사결정권자를 위한 보고서에 매우 효과적입니다. 상세한 실무 보고서나 회의록을 핵심 내용과 의사결정 포인트를 중심으로 압축하여 제공하므로, 빠르고 명확한 판단을 유도하는 데 최적화되어 있습니다. 물론, 내부 팀원 간 공유를 위한 보고서 등 목적에 따라 유연하게 활용할 수 있습니다.\"}}]} \n자, 여기까지 김과장님의 하루를 통해 여러분의 업무 효율을 혁신적으로 바꿔줄 세 가지 '인생 GPT' 활용법을 모두 살펴보았습니다. 쏟아지는 업무 속에서 헤매기만 하는 것이 아니라, AI의 도움을 받아 핵심에 집중하고, 더 큰 성과를 만들어내는 스마트한 직장인이 될 수 있다는 것을 확인하셨을 겁니다. 제 개인적인 경험으로 볼 때, 이 GPT들을 여러분의 일상에 적용하면 업무의 질과 속도 모두에서 확연한 차이를 느끼게 되실 겁니다.\n더 이상 중요하지 않은 일에 에너지를 낭비하지 마세요. 오늘 소개한 GPT들을 적극 활용하여, 여러분도 김과장님처럼 업무의 달인이 되어보세요!",
    "reviews": [],
    "syllabus": [],
    "link": "https://muzbox.tistory.com/483695",
    "pubDate": "Sat, 27 Dec 2025 22:48:07 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 챗봇 및 지침 무료 배포",
      "2025 AI 활용법",
      "ai 업무 자동화",
      "ChatGPT 실무",
      "보고서 작성 GPT",
      "시장 동향 리서치",
      "업무 효율 GPT",
      "우선순위 정리 AI",
      "원페이지 보고서",
      "인생 GPT 추천",
      "직장인 생산성"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "[UnrealEngine] CoreMinimal.h",
    "description": "지금까지는 아무 생각없이 UnrealEngine의 헤더파일 맨 윗 줄에 #include \"CoreMinimal.h\"를 넣어주고 있었다.\n\n\n 그런데 Clangd에서 CoreMinimal.h가 직접적으로 인용되고 있지 않다고 워닝을 띄우길래, 갑자기 궁금증이 들었다.\n CoreMinimal.h에는 언리얼 엔진에서 기본적으로 제공하는 Type definition 같은 것들이 들어있지 않을까 그냥 막연하게만 생각하고 있었는데, 이 참에 간단하게나마 알아보자는 생각이 들었다.\n \nIWYU (Include What You Use)\n\n\n언리얼 엔진 4.15 출시!\n \n CoreMinimal.h는 UE4.15에 처음으로 만들어진 헤더(로 보인)다. C++의 고질적 약점인 컴파일 타임을 개선하기 위한 조치로 IWYU라는 기법을 도입하면서부터이다. IWYU는 거창해보이지만, C++에서 기본적으로 배우는 \"꼭 필요한 헤더만을 인클루드 해라\"라는 가르침이다.\n 이미지에서 볼 수 있듯이, CoreMinimal.h는 FString, FName, TArray, FVector 등의 기본적으로 Unreal Engine을 사용하기 위한 헤더만을 인클루드해서, UE4.15 이전 버전에서 컴파일 시간 증가의 원인이 되던 `Engine.h`나 `UnrealEd.h` 같은 거대한 헤더를 인클루드해야 했던 문제를 회피하게 만들어준다.\n 설명에 보면 PCH 또한 명시적으로 포함하지 않게 만들어, 컴파일 타임 감소에 대한 여러 해결책을 모색하는 것으로 보인다.\n \n\n\n언리얼 엔진 프로그래밍의 IWYU(Include What You Use) | 언리얼 엔진 5.7 문서 | Epic Developer Community\n \n 각 Plugin의 Build.cs에 PCHUsage를 위와 같이 설정해주면 IWYU툴이 코드를 확인하고 PCH를 만들때 엄격하게 해당 Plugin이 필요한 헤더만을 인클루드하게 만들어주는 모양이다. 이건 처음알았네.\n \n\n\n 결과적으로 저 Warning은 false alarm이고, CoreMinimal.h를 포함하는 것이 맞다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://highfence.tistory.com/67",
    "pubDate": "Tue, 30 Dec 2025 11:40:17 +0900",
    "creator": "Highfence_",
    "categories": [
      "프로그래밍/TIL"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "새해 계획으로는 ‘망하는 계획’을",
    "description": "얼마 전 한 스타트업 대표가 도박으로 회사 돈을 탕진한 사건이 크게 뉴스에 났습니다.\n이야기를 들어보니 너무 잔인하고 충격적이어서 머릿속에서 며칠 동안이나 떠나가질 않았습니다.\n세상 부러울 것 없이 잘 나가던 사람이 어떻게 갑자기 그렇게 되어버린 걸까?\n가끔씩은 거꾸로 생각해봅니다.\n어떻게 하면 내가 만드는 앱들을 가장 빨리 망하게 할 수 있을까?\n이런 질문들을 해보면서 미리 대비해 두고 싶습니다.\n독자님들께서도 스스로를 망하게 하는 질문을 해보시기 바랍니다.\n한 해 동안 방문해 주셔서 고맙습니다.\n\n\n함께 읽으면 좋은 글:\n가장 중요한 자산\n금주 1주년 셀프 축하",
    "reviews": [],
    "syllabus": [],
    "link": "https://jeho.page/essay/2025/12/30/must-never-do.html",
    "pubDate": "2025-12-30T08:15:00.000Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "&quot;The content for this response was already consumed&quot; 문제",
    "description": "One example of resolving the \"The content for this response was already consumed\" error message.\n다음은 Azure CLI를 사용해 ARM 템플릿을 배포하는 구문이다.\naz deployment group create -n $NAME -g $RG --template-file $TEMPLATEFILE --parameters $PARAMETERS\n \n이 구문으로 ARM 템플릿을 배포할 때 다음의 스크린샷과 같은 결과를 만날 때가 종종 있다.\n\n\n \n\"The content for this response was already consumed\"라는 에러 메시지는 정말 모호한 메시지다. 마이크로소프트는 이 메시지가 어떤 문제 상황에서 발생할 가능성이 있는지 좀 더 자세한 정보를 제공하도록 개선해야 한다.\nGoogle 또는 stack overflow 내에서 검색해보면 이 에러메시지에 당황해하며 올려놓은 질문과 댓글을 자주 접할 수 있다. 물론 해결책은 거의 없다시피하다. 요즘 많이 사용하는 생성형 AI 서비스를 이용해 질문을 해도 마찬가지다. \n \n다행히 이런 에러가 발생하는 상황을 타개해볼만한 한 가지 유의미한 시도는 존재한다.\n앞서 소개했던 ARM 템플릿을 배포하는 구문에 what-if를 추가해 지정한 ARM 템플릿이 배포될 경우의 변경 사항을 예측해보는 것이다. 물론  What-if 연산은 Azure PowerShell, Azure CLI, REST API서 모두 사용할 수 있다. \n다음 화면은 앞서 스크린샷에서 실행한 구문에 다음과 같이 what-if를 추가해 실행한 결과다. 아래 [참고]로 제공한 링크를 클릭해 Microsoft Learn 사이트의 해당 내용을 조금 더 자세히 살펴보기 바란다.\n \n[참고]\nMicrosoft 기술 문서: ARM 템플릿 배포 what-if 작업\n\n\n \n오렌지색의 사각형 박스 내용을 보면, 파라미터 파일에서 특정 파라미터를 제공했는데, 템플릿 파일에서는 해당 파라미터가 정의되지 않은 것임을 유추할 수 있다.\n이렇게 문제의 원인을 찾아서  해결했지만, 항상 이런 방식으로 쉽게 해결할 수 없는 경우가 많기 때문에 이 에러 메시지는 보다 근본적으로 해결이 필요하다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://www.dokyun.pe.kr/384",
    "pubDate": "Thu, 1 Jan 2026 22:42:38 +0900",
    "creator": "강철 벼룩",
    "categories": [
      "Azure &amp; Windows/Azure",
      "ARM Template",
      "Azure CLI",
      "azure powershell",
      "what-if"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "[codex] snapshot으로 인한 실행시간 증가 문제.",
    "description": "Repository snapshot is taking longer than expected. Large untracked or ignored files can slow snapshots; consider adding large files or  directories to .gitignore or disabling `undo` in your config.\n\n\n codex에는 현재 작업을 undo할 수 있도록 스냅샷을 찍는 기능이 있는데, 리포지토리가 너무 커지면 스냅샷을 찍는 비용이 점차 늘어나서 간단한 명령도 시간이 오래걸리게 되는 문제가 있다.\n \n 이 문제를 해결하는 가장 좋은 방법은 .gitignore를 적절히 잘 설정해서 codex가 인지하는 snapshot의 범위를 줄여주는 것이다.\n 그러나 실제로 리포지토리의 크기가 실제로 너무 커서 .gitignore로 제어할 수 없다면? 혹은 작업 범위만큼을 남겨놓고 ignore시키면 되지만, 그게 귀찮다면...\n \n 그냥 undo 기능을 꺼버리면 된다.\n \n\n\n `~/.codex` 디렉토리에 config.toml을 수정해주자.\n \n\n\n undo 기능을 끄는 대신, 다시 속도가 빨라진 것을 확인할 수 있다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://highfence.tistory.com/68",
    "pubDate": "Wed, 31 Dec 2025 11:49:36 +0900",
    "creator": "Highfence_",
    "categories": [
      "프로그래밍/TIL",
      "Codex"
    ]
  }
]