[
  {
    "id": 1,
    "imageUrl": "",
    "title": "CLion 2025.3 Is Here, and It’s Epic: Faster Language Engine, Unique Constexpr Debugger, DAP Support, and Much More",
    "description": "This is one of our largest updates ever, featuring advanced capabilities and refinements to deliver a smoother workflow. CLion 2025.3 represents one of our most ambitious releases yet. Beyond the extensive feature additions and workflow improvements, this version marks a fundamental shift in how we approach C and C++ language support – prioritizing speed and […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/clion/2025/12/2025-3-release/",
    "pubDate": "Mon, 08 Dec 2025 12:25:48 +0000",
    "creator": "Oleg Zinovyev",
    "categories": [
      "news",
      "releases",
      "clionnova",
      "constexpr",
      "cpp26",
      "dap",
      "stm32",
      "zephyr-west"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "The Unified IntelliJ IDEA: More Free Features, a Better Experience, Smoother Flow",
    "description": "IntelliJ IDEA is now a unified product! As we announced back in July, starting from this release (2025.3), there is one IntelliJ IDEA, replacing the separate IntelliJ IDEA Community Edition and IntelliJ IDEA Ultimate to keep things simple and convenient. All the functionality of the Community Edition remains free for non-commercial and commercial use. We’re […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/idea/2025/12/intellij-idea-unified-release/",
    "pubDate": "Mon, 08 Dec 2025 10:45:57 +0000",
    "creator": "Julia Shashkova",
    "categories": [
      "news"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "손과 손을 맞잡아 이어지는 태고의 봉인 전쟁, 젤다무쌍 봉인 전기",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2398",
    "pubDate": "Mon, 08 Dec 2025 15:21:42 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "게임툰"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "[MULTI] 비슷하면서도 한층 풍부해진 시리즈의 1.5, 옥토패스 트래블러 0",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2396",
    "pubDate": "Wed, 03 Dec 2025 20:00:10 +0900",
    "creator": "［RULIWEB］",
    "categories": [
      "리뷰"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "유튜브는 당장 내일 망할 것 처럼 만들어진다. / 당신은 흔들리지 마라",
    "description": "영상: https://www.youtube.com/watch?v=ZevUAcIlz6E\n\n\n\n2분에 나옵니다.\n진실은 이겁니다.\n \n유튜브는 원래 내일 세상이 망할 것 같이 말해야 사람들이 몰립니다.\n또 그렇게 방송하는게 맞습니다.\n안그러면 봐주지 않거든요\n \n하지만 만드는 사람의 진실은 이겁니다.\n영향 받지 마라\n세상은 그렇게 돌아가지 않습니다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://serverdown.tistory.com/1522",
    "pubDate": "Fri, 5 Dec 2025 10:37:59 +0900",
    "creator": "SIDNFT",
    "categories": [
      "유튜브",
      "유튜브"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "동적 사용자 분할을 활용한 새로운 A/B 테스트 시스템을 소개합니다 ",
    "description": "이 글은 Tech-Verse 2025에서 발표된 동적 유저 세분화를 활용한 새로운 A/B 테스트 시스템 세션을 글로 옮긴 것입니다.안녕하세요. LINE+ Contents Servi...",
    "reviews": [],
    "syllabus": [],
    "link": "https://techblog.lycorp.co.jp/ko/advanced-ab-test-system-with-dynamic-user-segmentation",
    "pubDate": "Fri, 05 Dec 2025 02:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "354일차 - 간단한게임만들기 9일차 / 개발일지",
    "description": "영상: https://www.youtube.com/watch?v=e396l7H9cI0&t=25s\n\n\n\n \n개발일지 입니다.\n이제 거의 막바지이며 이후로는\n컨텐츠를 붙이면 안좋아질 수도 있는 수준에 가까워졌습니다.\n \n\n\n한분이 게임이 안끝날 수도 있다는 점을 지적해주셨습니다.\n감사합니다.\n \n플레이하러가기\n웹에서 플라이 가능합니다.\n게임 링크: https://play.unity.com/en/games/fb8df491-0bdd-417e-88b8-af692eb40f42/122-easy-v11",
    "reviews": [],
    "syllabus": [],
    "link": "https://serverdown.tistory.com/1523",
    "pubDate": "Fri, 5 Dec 2025 13:49:21 +0900",
    "creator": "SIDNFT",
    "categories": [
      "프로그래밍/자작"
    ]
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "BUN 앤트로픽에 (클로드코드) 에 인수되었습니다. / 성공담",
    "description": "영상: https://www.youtube.com/watch?v=RMwRhRyZ0Jo\n\n\n\nBUN 은 빠른 typescript 처리기 입니다.\n앤트로픽은 클로트 코드 라는 AI 자동 코딩 툴 회사입니다.\n \n처음 써보고 너무 빨라서 놀랐는데\n돈을 4년간 제대로 못벌고 있다가\n이번에 앤트로픽에서 인수해갔군요\n \n그 성공 스토리에 대한 이야기 구요\n두회사는 간접적으로 연관이 있었고 결국엔 성공했습니다.\n이번에도 레딧과 깃허브의 역활이 컷군요\n이 두개에서 성공 사례가 많이 나오는거 같습니다.\n제품의 본질에 충실하면 좋은 제품이 되었을때\n성공한다는 것을 배웠습니다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://serverdown.tistory.com/1530",
    "pubDate": "Mon, 8 Dec 2025 13:52:27 +0900",
    "creator": "SIDNFT",
    "categories": [
      "유튜브",
      "Ai",
      "성공담"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "AI 시대 대학도 아니고 고등학교를 가야하는지 고민하는 시대",
    "description": "영상: https://www.youtube.com/watch?v=ZLJthFsjU5Q&t=190s\n\n\n\n \n대부분의 시험은 AI 가 더 잘하는 시대입니다.\n샘 알트만 (오픈AI 대표) 는 내 아이는 AI 보다 똑똑해질 수 없다. \n대악 안보내겠다. 발언\n공부를 하지말고 AI 를 적극 활용하는게 좋습니다. \n모를때 마다 물어봐야한다는 것이죠\n현 시대는 대학에 가서 고급 일자리에 취업하는 방식이 전혀 동작하지 않습니다.\n일부 대기업에 가는 사람들은 그저 확율로 들어가는 것일 뿐입니다.\n그리고 들어가봐야 40~50대에 대부분 정리해고 당합니다.\n현재 가장 중요한것은 내가 하고 싶은걸 하고 그것을 유튜브나 SNS 에 올리면서 영향력을 키우는 일입니다.\nAI 가 영향력을 높이는데 도움을 줄 수 있지만 영향력은 오직 사람만이 모을 수 있습니다.\nAI 채널이 구독자가 높을 수 있지만 그것은 AI 채널을 소유한 사람이 가지는 것이지 AI 가가지는게 아닌것 처럼요",
    "reviews": [],
    "syllabus": [],
    "link": "https://serverdown.tistory.com/1526",
    "pubDate": "Sat, 6 Dec 2025 15:13:25 +0900",
    "creator": "SIDNFT",
    "categories": [
      "Ai",
      "교육"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "종이, 펜, 그리고 손 필기",
    "description": "어느 날 사무실에서 새로운 창업가와 첫 미팅을 하는 도중, 미팅 룸을 둘러보면서 다른 팀 동료분들을 봤다. 모두 다 귀는 창업가의 발표를 들으면서, 눈은 대형 화면의 발표 자료, 창업가의 얼굴, 그리고 각자의 노트북 모니터를 왔다 갔다 하고 있었고, 손가락으로 열심히 미팅 노트를 적고 있었다. 어떤 분들은 AI 노트 테이킹 앱으로 대화 내용을 녹음하면서 요약하고 있었다. 그런데(...)",
    "reviews": [],
    "syllabus": [],
    "link": "https://www.thestartupbible.com/2025/12/paper-pen-and-handwriting.html",
    "pubDate": "Sun, 07 Dec 2025 21:35:00 +0000",
    "creator": "Kihong Bae",
    "categories": [
      "Uncategorized",
      "ai",
      "FoundersAtWork",
      "general",
      "Strong",
      "technology"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "일억은퇴의 필살기 - QLD 2억 몰빵 후 정기적으로 월 500씩 출금",
    "description": "영상: https://www.youtube.com/watch?v=vQtZ5f72KTk&lc=Ugzg6u_Mxakl8DS-U3h4AaABAg\n\n\n\n \nQLD 에 몰빵후 정기 출금 시나리오를 가져왔습니다.\n정말 기발한 아이디어입니다.\n \nJEPQ 같은건 수수료도 있고 배당도 만족할 수준이 아닙니다.\n차라리 나스닥 두배 짜리로 사고 정기적으로 팔면 JEPQ 와 비슷한 효과를 낼 수 있습니다.\n \n작은 돈으로 만족할만한 배당을 받을 수 있는 훌륭한 선택지 같습니다.\n충분히 고려해볼 옵션으로 생각됩니다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://serverdown.tistory.com/1524",
    "pubDate": "Fri, 5 Dec 2025 22:17:28 +0900",
    "creator": "SIDNFT",
    "categories": [
      "유튜브",
      "qld"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "즉시 실행하기",
    "description": "지난 금요일 박소령 대표님과 “실패를 통과하는 일”의 라이브 방송을 진행했다.\n라이브에서 얘기해주신 내용 중 부산의 유명 카페의 대표님 이야기가 생각난다.\nB2B로 원두를 납품하는 것이 회사의 중요 사업 중 하나였지만,\n그 카페의 대표님은 영어를 할 줄 모르셨다.\n그래서 영어를 잘 하는 영업사원들에게 커피 원두를 아프리카에서 공수해오는 일을 위임했다.\n근데 그 영업 사원들이 모두 이탈하는 경우가 생기니 회사의 큰 위기가 왔다.\n이 카페의 가장 코어는 ‘좋은 원두’ 인데, 그걸 대표가 직접 챙기지 않으니 이런 큰 위기가 올 수도 있다는 깨달음이 있으셨다.\n그래서 그 길로 한국의 모든 사업은 팀원들에게 맡기고,\n6개월간 어학연수를 바로 출발하셨다.\n영어를 배워야만 회사의 코어인 ‘커피 원두’ 를 대표가 직접 챙길 수 있으니깐.\n그리고 현재는 모든 커피 원두는 대표님이 직접 공수해오고 계신다.\n직접 아프리카로 가시면서 직접 원두 하나하나를 다 테스팅 하시고 협상도 하신다.\n이 이야기에는 여러가지 고민할거리를 많이 줬다.\n‘회사의 코어 인데 내가 직접 하지 않는 건은 무엇이 있을까?’\n‘지금 당장 실행에 옮기지 않고, 기다리고 있는것은 무엇일까?’\n‘그걸 실행하지 않는 이유는 무엇일까?’\n…\n12월은 항상 애매하게 붕 뜬다.\n1년의 마무리를 하는 시점이다보니,\n어영부영 정리하면서 내년 1월부터 무언갈 새롭게 시작하자로 정리가 된다.\n그러다보니 12월에는 항상 무언갈 해낸 경험은 잘 없다.\n1월을 위한 준비로만 사용하기 때문이다.\n근데 12월도 한달이다.\n12개월 중 1개인 1년의 8%를 차지하는 긴 일정이다.\n이 한달을 정리만 하는것으로 마무리하기엔 너무 아쉽다.\n카페 대표님처럼,\n생각난 즉시 실행에 옮기려면 1월까지 기다릴 필요 없이 12월에 바로 공부를 시작해야겠다.\n그런 의미에서, 12월에도 저와 함께 공부하실 분들을 모집합니다 :)\nhttps://inf.run/kNSjJ\n신청 기간 : 12/4(목)~12/12(금)\n챌린지 기간 : 12월 14일(일)\n1월까지 기다리지말고,\n12월에 바로 공부해보시죠.\n12월에 조금이라도 공부한 경험, 완주한 경험은 1월의 새로운 시작을 성공 경험과 함께 더 알차게 시작할 수 있을거라고 믿습니다 :)",
    "reviews": [],
    "syllabus": [],
    "link": "https://jojoldu.tistory.com/855",
    "pubDate": "Mon, 8 Dec 2025 08:59:32 +0900",
    "creator": "향로 (기억보단 기록을)",
    "categories": [
      "생각정리",
      "마라톤 챌린지",
      "박소령",
      "실패를 통과하는 일",
      "실패를 통과하는일",
      "향로 챌린지"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "토스, 무료 해외송금 국가 50개국으로 확대",
    "description": "외국인 금융생활 편의 강화",
    "reviews": [],
    "syllabus": [],
    "link": "https://toss.im/tossfeed/article/foreign-money-transfer",
    "pubDate": "Tue, 02 Dec 2025 07:18:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "PhpStorm 2025.3 Is Now Out",
    "description": "Welcome to PhpStorm 2025.3! This release brings native Claude Agent integration, out-of-the-box Laravel support, support for PHP 8.5, improvements in generics, a new Islands theme, and more. Download PhpStorm 2025.3 PHP PHP 8.5 support PhpStorm 2025.3 supports all of the changes introduced in the recently released PHP 8.5.  As usual, you can try new features by setting […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/phpstorm/2025/12/phpstorm-2025-3-is-now-out/",
    "pubDate": "Mon, 08 Dec 2025 13:35:43 +0000",
    "creator": "Hanna Yakush",
    "categories": [
      "releases",
      "2025-3",
      "release"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "데이터 시스템의 미래 - 데이터 통합",
    "description": "애플리케이션과 시스템을 신뢰할 수 있고 확장 가능하며 유지보수하기 쉽게 만드는 방법들을 모아 그것을 기반으로 미래를 고찰한다.\n데이터 통합\n데이터를 사용하는 모든 다른 상황에 적합한 소프트웨어가 있을 가능성은 낮다. 그래서 원하는 애플리케이션 기능을 제공하기 위해서는 반드시 여러 다른 소프트웨어를 함께 엮어 사용해야 한다.\n데이터 통합의 필요성은 나무가 아닌 숲을 보기 위해 줌아웃해서 조직 전체 데이터플로를 고려할 때야 비로소 명확해진다.\n데이터플로에 대한 추론\n다른 데이터 접근 양식을 만족하기 위해 같은 데이터의 사본을 여러 저장소 시스템에 유지해야할 때 입력과 출력을 분명히 할 필요가 있다. 어디서 데이터를 처음으로 기록하는지, 어떤 표현형이 어떤 원본에서 파생되는지, 데이터를 모두 올바른 장소로 올바른 형식으로 어떻게 넣는지 등에 대해 충분히 고려해야 한다.\n파생 데이터 대 분산 트랜잭션\n추상적인 수준에서 보면 파생 데이터와 분산 트랜잭션은 다른 방식으로 유사한 목표를 달성한다. 쓰기 순서를 결정한다는 목표는 모두 달성한다. 다만 트랜잭셔 ㄴ시스템은 일반적으로 선형성을 지원해서 자신이 쓴 내용 읽기 같은 유용한 기능을 보장해준다. 반면 파생 데이터 시스템은 대개 비동기로 갱신되기 때문에 기본적으로 동시간 갱신 보장을 하지 않는다.\n선형성은 유용하지만 최종적 일관성을 달성하는데 이종 데이터 시스템을 통합하는 가장 장래성 있는 접근법은 로그 기반 파생 데이터라고 마틴 크레프만은 생각한다.\n일괄 처리와 스트림 처리\n마틴은 데이터 통합의 목표는 데이터를 올바른 장소에 올바른 형태로 두는 것이라 생각한다. 그렇게 하기 위해서는 입력을 소비해 형태를 바꾸고 필터링하고 집계해 모델을 학습하고 평가한 뒤 마지가에는 적절한 출력으로 기록해야 한다. 일괄 처리와 스트림 처리는 이 목표를 달성하기 위한 도구다.\n애플리케이션 발전을 위한 데이터 재처리\n기존 데이터를 재처리하는 것은 시스템을 유지보수하기 위한 좋은 메커니즘으로 새로운 기능 추가와 변경된 요구사항에 대응할 수 있다. 재처리 없이 스키마를 변경하는 작업은 레코드에 새 선택적 필드를 추가하거나 새로운 타입의 레코드를 추가하는 것과 같은 간단한 것으로 제한된다. 반면 재처리를 이용하면 새로운 요구사항을 더 잘 만족하기 위해 완전히 다른 모델로 데이터셋을 재구축할 수 있다.\n파생 뷰를 사용하면 점진적 발전이 가능하다. 이전 스키마와 새 스키마를 함께 유지해 같은 데이터를 기반으로 두 개의 독립적인 파생 뷰를 만들 수 있다. 점진적 이전의 장점은 처리의 모든 단계에서 뭔가 잘못됐을 때 쉽게 이전으로 되돌릴 수 있다는 점이다.\n데이터베이스 언번들링\n추상화 수준에서 보면 데이터베이스, 하둡, 운영체제는 모두 같은 기능을 수행한다. 이 시스템은 모두 데이터를 저장하고 처리하며 질의도 한다.\nOS와 DBMS의 공통점과 차이점 (데이터 관리 관점)\n관점\n공통점\n운영체제(OS)\nDBMS\n\n\n\n데이터 관리(무엇을 “관리”하나)\n“상태(state)”를 저장·유지하고, 일관성 있게 접근하게 함\n자원/시스템 상태(프로세스, 스레드, 메모리, 파일, 디바이스, 네트워크 소켓 등) 관리\n도메인 데이터/업무 상태(테이블/문서/인덱스, 메타데이터, 스키마, 통계 등) 관리\n\n\n데이터 관리(저장 단위/구조)\n디스크에 영속화하고, 계층 구조/참조 구조를 만든다\n파일/디렉터리, 페이지 캐시, inode 등 파일시스템 중심 구조\n레코드/페이지/세그먼트, 인덱스(B+tree 등), MVCC 버전 등 데이터 모델 중심 구조\n\n\n데이터 관리(무결성/일관성)\n손상 방지·복구·동시 접근 제어가 필요\n크래시 시 파일시스템 저널링/메타데이터 복구 등 시스템 레벨 일관성\n제약조건(키/참조/체크), 트랜잭션(ACID), 로그(WAL/redo) 등 데이터 무결성 중심\n\n\n데이터 관리(보안/권한)\n접근 통제/감사를 제공\n사용자/그룹, 파일 권한, 캡/SELinux, 프로세스 권한 등 자원 접근 제어\n사용자/롤, 스키마 권한, Row-level security, 감사 로그 등 데이터 접근 제어\n\n\n처리(실행 주체)\n요청을 받아 실행하고 자원을 배분\n프로세스/스레드 스케줄링, 컨텍스트 스위칭 등 CPU·메모리·I/O 배분\n쿼리 실행 엔진(연산자 파이프라인/벡터화), 버퍼 매니저 등 데이터 처리 연산\n\n\n처리(동시성/경합 처리)\n여러 작업을 동시에 돌리며 경합을 해결\n락/세마포어/뮤텍스, 스케줄러, I/O 큐 등 커널 동기화·스케줄링\n락/래치 + MVCC, 격리수준, 데드락 탐지 등 트랜잭션 동시성\n\n\n처리(성능 최적화 포인트)\n캐시·배치·스케줄링으로 효율을 올림\n페이지 캐시, I/O 스케줄러, NUMA/메모리 정책 등 시스템 전반 효율\n인덱스, 통계 기반 옵티마이저, 조인 전략, 실행 계획 캐시 등 질의 효율\n\n\n질의(요청 인터페이스)\n“무언가를 해줘”라는 요청 언어/API가 있다\n시스템 콜, 파일 API, 프로세스/네트워크 API 등 명령형(How) 호출 중심\nSQL/Query API 등 선언형(What) 질의 중심\n\n\n질의(해석/계획/실행)\n요청을 해석해 내부 작업으로 분해\n커널이 시스템 콜을 처리해 드라이버/FS/스케줄러로 고정된 처리 경로\n옵티마이저가 비용 기반으로 실행 계획 선택(인덱스/조인/스캔) 가변적 계획\n\n\n질의 결과의 의미\n결과를 반환(상태 조회 포함)\n파일 읽기/프로세스 상태/네트워크 송수신 등 자원 상태/바이트 스트림 반환\n행/집계/정렬/필터링된 논리적 결과 집합 반환\n\n\n질의의 추상화 수준\n내부 복잡성을 감추고 단순 인터페이스 제공\n“파일을 읽어라/소켓에 써라” 같은 저수준 자원 추상화\n“이 조건의 데이터를 가져와라” 같은 고수준 데이터 의미(스키마/관계)\n\n\n실패/복구 관점\n장애 시 복구 메커니즘이 핵심\n커널 패닉/전원 장애 후 FS 복구, 서비스 재기동 등 시스템 복원\n크래시 리커버리(WAL redo/undo), 체크포인트, 복제/백업 등 데이터 복원\n\n\n마틴은 NoSQL을 유닉스의 저수준 추상화 접근법을 분산 OLTP 데이터 저장소 분야로 적용하려는 움직임으로 해석한다. NoSQL처럼 OS와 DBMS의 장점을 결합하기를 바란다.\n모든 것의 메타데이터베이스\nDBMS가 생성하는 인덱스는 사실 파생 데이터의 일종으로 추상화해서 생각할 수 있다. 이렇게 생각하면 지금까지 파생 데이터로 구성한 전체 조직의 데이터플로 자체가 하나의 DBMS처럼 추상화해서 볼 수 있다. 예를 들어, 일괄 처리와 스트림 처리는 DBMS의 트리거와 스토어드 프로시저로 매핑해서 생각하는 것이다.\n파생 데이터 시스템 아키텍처가 등장하면서 이런 도구를 하나로 통합된 데이터베이스 제품의 기능으로 구현하지 않고, 여러 장비에서 실행되고 여러 팀에서 관리하는 다양한 소프트웨어를 사용해 제공한다. 서로 다른 저장소와 처리 도구를 사용하지만 하나의 응집된 시스템으로 구성할 수 있는 두 가지 길이 존재한다.\n연합 데이터베이스: 읽기 통합\n엄청나게 많은 하단 저장소 엔진과 처리 메서드를 통합해 질의하는 인터페이스.\n언번들링 데이터베이스: 쓰기 통합\n단일 데이터베이스 내에서 일관된 색인을 생성하는 것은 내장된 기능이다. 여러 시스템으로 구성됐을 때도 마찬가지로 변경된 모든 데이터가 올바른 장소에 반영되도록 보장해야 한다. 저장소 시스템들을 신뢰성 있게 결합하기 쉽게 만드는 것은 데이터베이스의 색인 유지 기능을 다른 기술에 걸친 쓰기를 동기화할 수 있는 방식으로 언번들링 하는 방식과 유사하다.\n언번들링 접근법은 하나만 잘하는 작은 도구를 사용하는 유닉스 전통을 따른다. 이 도구들은 통일된 저수준 API를 통해 통신한다.\n언번들링이 동작하게 만들기\n읽기 통합은 어렵지 않으니 쓰기 통합에 집중해보자. 쓰기를 동기화하는 전통적인 접근법은 이종 저장소 시스템 간 분산 트랜잭션이 필요하다. 마틴은 이 방법이 잘못된 해결책이라 생각한다. 단일 저장소나 스트림 처리 시스템에서 트랜잭션은 쓸 만하다. 하지만 데이터가 다른 기술 사이의 경계를 오간다면 멱등성을 기반으로 쓰기를 수행하는 비동기 이벤트 로그를 사용하는 편이 훨씬 더 강력하고 현실적인 접근법이라 본다.\n로그 기반 통합의 큰 장점은 다양한 구성 요소 간 느슨한 결합이다.\n시스템 수준에서 비동기 이벤트 스트림을 사용하면 전체 시스템이 개별 구성 요소의 장애나 성능 저하가 생겨도 잘 견디게 만들 수 있다.\n인적 수준에서 데이터 시스템을 언번들링하면 소프트웨어 구성 요소와 서비스를 다른 팀에서 각자 개발하고 개선하고 독립적으로 유지보수할 수 있다.\n언번들링 vs 통합 시스템\n언번들링이 실제로 미래에 사용될 방법이라고 가정해도 현재 형태의 데이터베이스를 대체하지는 못할 것이다. 데이터베이스는 여전히 스트림 처리자의 상태를 유지하기 위해 필요하고, 전문화된 질의 엔진은 특정 작업부하에 쓰는 용도로 여전히 중요하다.\n여러 다른 인프라에서 수행하는 복잡성도 문제다. 각 소프트웨어마다 학습 곡선과 설정 문제, 그리고 운영상에서만 나타나는 특성이 있다. 따라서 동적 부분을 가능하면 적게 배포해야 유리하다. 단일 통합 소프트웨어 제품은 설계된 용도에 맞춰 사용하면 애플리케이션 코드로 연결한 여러 도구로 구성된 시스템보다 뛰어나고 예측 가능한 성능을 낼 수 있다.\n필요하지도 않은 확장성을 고려해 시스템을 구축하는 노력은 전적으로 낭비일 뿐더러 유연하지 못한 설계에 갇힐 수 있다. 사실상 이것은 성급한 최적화의 한 형태다.\n필요한 모든 것을 만족하는 단일 기술이 있다면 저수준 구성 요소로부터 직접 재구현하려 하지말고 그냥 해당 제품을 사용하는 것이 좋다. 언번들링과 합성의 장점은 요구사항을 모두 만족하는 단일 소프트웨어가 없는 상황에서만 드러난다.\n미분 데이터플로(differential dataflow)란\n입력이 계속 바뀌는 상황에서(스트리밍 업데이트) + 반복(iteration)이 있는 계산(그래프/ML 등)을 전체 재계산 없이 변화분만 전파해서 결과를 유지하는(incremental maintenance) 계산 모델/실행 기법\n직관적으로는 각 연산자 f에 대해 입력이 A → A + a, B → B + b로 바뀌었을 때, 출력 변화는 δz = f(A+a, B+b) − f(A, B) 꼴로 계산/전파(실제로는 키별 인덱스/상태를 유지해 변화가 영향 주는 부분만 빠르게 처리). 이 때문에 큰 데이터 전체를 다시 돌리는 대신, 보통 변경된 키/레코드 주변만 영향.\n실행 관점에서 보면 처리됨 vs 미처리 δ 두 덩어리를 굴리는 것으로, Naiad 기반 differential 모델(초기 문서/리포트들)에서는 각 엣지가 이미 반영된 δ와 아직 반영 안 된 δ를 나눠 들고 있다가, 연산자가 미처리 δ를 조금씩 가져와 처리하고, 그에 대응하는 출력 δ를 내보내는 식으로 전체가 수렴. 업데이트가 들어오면 다시 미처리 δ가 쌓이고, 그 부분만 연쇄적으로 갱신.\n데이터플로 주변 애플리케이션 설계\n현대 데이터 시스템은 내결함성과 확장성이 있어야 하고 지속성 있게 데이터를 저장해야 한다. 또 데이터 시스템은 시간이 흐름에 따라 다른 그룹의 사람들이 개발한 이종 기술과도 통합이 가능해야할 뿐 아니라 이미 존재하는 라이브러리와 서비스를 재사용 가능해야한다.\n이런 아이디어를 확장해 언번들링 데이터베이스와 데이터플로의 아이디어 주변에서 애플리케이션을 구축하는 몇 가지 방법을 탐구한다.\n애플리케이션 코드와 상태의 분리\n마틴은 시스템의 일부는 지속성 있는 데이터 저장을 전문으로 하고 다른 일부는 애플리케이션 코드 실행을 전문으로 하는 게 합리적이라 생각한다. 두 부분이 독립적이라도 여전히 상호작용할 수 있다.\n오늘날 대부분의 웹 어플리케이션이 상태 비저장 서비스로 배포된다. 상태 비저장 서비스 내에서 사용자 요청은 어떤 애플리케이션 서버로도 라우트될 수 있다. 그리고 응답 결과를 보내고 난 요처에 대해서는 완전히 잊어버린다. 이런 배포 양식은 원할 때마다 서버를 추가하고 제거하기에 매우 편리하다. 요즘 추세는 상태 관리와 상태 비저장 애플리케이션 로직을 분리하는 것이다.\n데이터플로: 상태 변경과 애플리케이션 코드 간 상호작용\n데이터플로 측면에서 애플리케이션을 생각한다는 것은 애플리케이션 코드와 상태 관리 간의 관계를 재조정한다는 의미다. 데이터베이스를 애플리케이션이 직접 조작하는 수동적 변수로 취급하는 대신 상태와 상태 변경, 그리고 상태를 처리하는 코드 간의 상호작용과 협동에 관해 좀 더 생각해 볼 수 있다.\n요약하자면 데이터베이스를 언번들링할 것이고 원본 데이터베이스 외부인 애플리케이션 레벨에서 파생 데이터를 다루겠다는 것이다.\n가장 명심해야 할 점은 파생 데이터를 유지하는 것이 전통적인 메시징 시스템의 설계 목적인 비동기 작업 실행과는 같지 않다는 것이다. 안정적인 메시지 순서화와 내결함성이 있는 메시지 처리를 해야한다. 이 요구 사항은 상당히 엄격하지만 분산 트랜잭션보다 훨씬 저렴하면서 탄탄한 운영을 가능하게 한다.\n이 애플리케이션 코드로 데이터베이스에 내장된 파생 함수가 지원하지 않는 임의 처리가 가능하다. 파이프로 연결한 유닉스 도구와 같이 스트림 처리자를 구성해서 데이터플로를 중심으로 대형 시스템을 구축할 수 있다. 각 연산자는 상태 변경 스트림을 입력으로 받아 다른 상태 변경 스트림을 출력으로 생산한다.\n스트림 처리자와 서비스\n스트림 연산자로 데이터플로 시스템을 구성하는 것은 마이크로서비스 접근법과 유사하다. 하지만 기반이 되는 통신 메커니즘은 매우 다르다. 마이크로서비스 접근법은 동기식 상호작용을 사용하지만 스트림 연산자로 구성한 시스템은 단방향 비동기식 메시지 스트림을 사용한다.\n예를 들면, 한 소비자가 특정 통화로 가격이 매겨진 상품을 구매했지만 지불은 다른 통화로 했다고 가정하자.\n마이크로서비스 접근법에서 구매 처리 코드는 특정 통화의 현재 환율을 얻기 위해 환율 서비스나 데이터베이스에 질의한다.\n데이터플로 접근법에서 구매 처리코드는 미리 환율 갱신 스트림을 구독하고 환율이 바뀔 때마다 로컬 데이터베이스에 환율을 기록한다. 구매 처리가 들어올 때 단지 로컬 데이터베이스에 질의하면 된다.\n상태 변경을 클라이언트에 푸시하기\n웹 브라우저에 일반적인 웹 페이지 하나가 로드된 후 서버에서 데이터가 변경된다면 페이지가 새로 로드될 때까지 브라우저는 해당 변경 사항을 알 수 없다. 따라서 명시적으로 변경 사항을 폴링하지 않으면 장치의 상태는 갱신되지 않는 신선도가 떨어지는 캐시다.\n많은 최신 프로토콜이 HTTP의 기본적인 요청/응답 패턴을 벗어나고 있다. 웹브라우저가 서버와 TCP 접속을 유지하면서 연결이 유지되는 동안 서버가 주도적으로 메시지를 브라우저에 보내는 방식의 통신 채널을 제공한다. (예를 들면 서버 알림)\n장치가 얼마 동안 오프라인이라서 그 시간 동안 서버에서 상태 변경 알림을 받지 못할 수 있다. 그러나 이 문제는 '소비자 오프셋'을 통해 이미 해결할 수 있다. 각 장치는 작은 이벤트 스트림을 구독하는 작은 구독자다.\n그럼 왜 모든 애플리케이션을 이런 방식으로 구축하지 않을까? 문제는 상태 비저장 클라이언트와 요청/응답 방식의 상호작용이 데이터베이스, 라이브러리, 프레임워크, 프로토콜에 뿌리 깊게 배어 있기 때문이다. 쓰기 경로를 최종 사용자까지 확장하려면 근본적으로 시스템을 구축하는 방식을 재고할 필요가 있다. 즉 요청/응답 상호작용 방식에서 발행/구독 데이터플로 방식으로 변경해야한다는 의미다. 좀 더 반응성 있는 사용자 인터페이스를 지원하고 더 나은 오프라인 지원을 하기 위해 들이는 노력이 가치 있다고 생각한다. 데이터 시스템을 설계한다면 변경 사항을 구독하는 방식을 염두에 둬야 한다고 생각한다.\n참고\n데이터 중심 애플리케이션 설계 12장\n텀블링 윈도우란\nhttps://www.cidrdb.org/cidr2013/Papers/CIDR13_Paper111.pdf\n###",
    "reviews": [],
    "syllabus": [],
    "link": "https://velog.io/@ahngj96/%EB%8D%B0%EC%9D%B4%ED%84%B0-%EC%8B%9C%EC%8A%A4%ED%85%9C%EC%9D%98-%EB%AF%B8%EB%9E%98",
    "pubDate": "Sun, 07 Dec 2025 06:56:06 GMT",
    "creator": "Unknown",
    "categories": []
  }
]