[
  {
    "id": 1,
    "imageUrl": "",
    "title": "꾸준하게 하는 방법",
    "description": "무라카미 하루키 책 중에서 가장 좋아하는 책은 달리기를 말할 때 내가 하고 싶은 이야기입니다.\n이 책에서 배운 것은 어떻게 꾸준하게 할 수 있는가?\n저도 이걸 알고 나서부터 GitHub 그래프가 (완벽하진 않지만) 잔디가 빼곡히 채워지기 시작한 것 같습니다.\n\n여기서 한발 더 나아가려면 잔디의 색깔도 너무 들쑥날쑥하지 않게 해야 합니다.\n1년에 몇 번 정도는 힘을 다해 밤을 새워가며 코딩하곤 합니다.\n오늘도 그런 날입니다. 정오가 다 되어 일어났는데 머리가 어질어질합니다. 너무 피곤하고 다시 에디터를 켤 자신이 없습니다.\n함께 읽으면 좋은 글:\n매일 커밋에 실패했던 날\n매일매일 코딩하기",
    "reviews": [],
    "syllabus": [],
    "link": "https://jeho.page/essay/2025/10/16/routine.html",
    "pubDate": "2025-10-16T03:35:00.000Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "트럼프의 애브리띵랠리 를 설명합니다. / 금 원자재 스테이블 코인",
    "description": "영상: https://www.youtube.com/watch?v=j_E1xtJd_T0\n\n\n\n처음부터 나옵니다.\n \n왜 모든 자산이 가느냐\n적어도 유가는 가지 않습니다. 이게 중요한것입니다.\n트럼프는 미구의 부채를 해결하기 위한 방법으로 \n돈을 불어 부채를 희석하고 금리를 내리는 방식을 사용하려고 합니다.\n적어도 지금까지는 성공적입니다.\n금은 미국도 많습니다. \n금값이 올라가면 미국에게 좋습니다.\n예를 들어 \n금 100 부채 100 일때 금 가격을 올려\n금 400 부채 100 이라면\n부채비율은 50% 에서 20% 로 줄어든것으로 보인다는 것입니다.\n \n그리고 상하이 금거래소가 새로 생겼습니다.\n\n\n(사진이 상하이 금 거래소 사진인가 봅니다. 동네 주택 대문 처럼 보이는데 ...)\n이전엔 런던 금 거래소 정도가 큰 거래소 였는데 \n중국도 하나 차렸습니다.\n예전부터 런던 금 거래소가 금 값을 임의적으로 조정한다는 음모론이 있었는데\n이제 부터는 그 짓이 불가능해졌습니다.\n런던에서 금값이 싸게 거래되니까 사람들이 상하이 금 거래소에 가서 금을 비싸게 팔게 되었습니다.\n경쟁을 통해 시장을 뺏아오는 계획이 성공하였다는 것입니다.\n아편전쟁의 반격일 수도 있겠네요\n현재 영국의 국내 상황은 맛탱이가 간 상황입니다.\n무슬림 증가 문제와 EU 탈퇴로 인한 시장 축소가 계속 진행되고 있습니다.\n그리고 중국도 미국과 비슷한 상황으로 금값이 오르면 \n부채가 줄어드는 효과를 누릴 수 있습니다.\n그리고 현재 중국은 파격적으로 금을 사모으고 있습니다.\n베트남도 금 거래소를 하나 차린거 같고 인도도 사모은다고 하니 전세계가 금을 올려\n부채를 줄일려는 계획에 동참하고 있는거 같습니다.\n \n \n일본의 총리 교체\n이시바의 경우 학자 출신으로 정상적인 재정을 만드려고 금리를 올리고 하는등의 교과서 적인 정책을 사용하려고 했으나\n(서민들에겐 이 방법이 맞습니다.)\n일본은 미국의 채권을 사줘야하는 숙명이 있고\n트럼프도 이걸 이용해 미국의 금리를 내리려는 계획이 있습니다.\n그러니 이시바랑은 잘 맞지 않고 총리는 교체되었습니다.\n다음 총리로 여자 + 상속받지않은 세력 의 다카이 입니다.\n\n\n이시바와 반대고 아베와 같은 확장 재정을 추진할 것입니다.\n미국 채권을 계속 사주고 일본은 돈을 계속 찍습니다.\n(이러면 물가가 오르겠죠? 서민들에게 안좋습니다.)\n \n결론\n트럼프의 애브리띵 랠리는 성공적이고 국재 공조도 이뤄지고 있습니다.\n금은 무지막지하게 오를 것이고\n금리는 낮아질 것입니다.\n주식 이든 금이든 뭐든 사야하는 시대입니다.\n한간에는 이재명의 소비쿠폰이 돈풀어서 물가 올린다고 싫어하는데\n트럼프 계획에 따르면 이 정책은 맞는 정책입니다.\n걱정되는점은 한국은행은 금을 매입하고 있지 않다는 것입니다.\n금을 비싸게 사면 정치인들이 뭐라고 한적이 있어서 안사는거 같은데\n석박사 똑똑이 다 모아놔도 바보짓 하는건 국룰인가봅니다.\n아마도 한국이 금을 매입하면 1-2년 안에 이 랠리가 끝날것 같습니다.\n그때가되면 유가도 사고 기름값이 오르면 전기차 보급도 빨라질 것같습니다.\n \n \n추가로 희토류 분쟁\n중국이 희토류 규제로 미국과 싸우는 중인데요\n이것도 원자재 가격을 올려 부채를 줄이는 효과를 보려는거 같습니다.\n중국은 희토류 사업에서 손해보면서도 싸게 공급해왔는데\n국가 상태가 말이 아니라 이것도 가격을 올려서 해결하려는거 같습니다.\n중국이 원자재 가격을 인상하면 덤핑 수출 문제도 해결되고\n각 국가들은 경쟁력이 생깁니다.\n이러면 정상 시장으로 돌아가는 것이고 이것 역시 트럼프가 원하는 길입니다.\n결국 모든 것은 트럼프가 원하는 방향으로 가는 것입니다.\n \n마지막으로 코인\n더 많은 달러를 저 금리로 찍을 수 있다면 좋은 것입니다.\n이것을 위해 스테이블 코인을 활성화 할 것입니다.\n스테이블 코인이 커지면 국채를 싸게 발행 할 수 있고\n이것 역시 부채 희석 효과가 있습니다.\n또한 스테이블 코인은 각 국가의 화폐를 이용한 정책을 약화시키는 효과가 있습니다.\n사람들은 자국 화폐보다 달러 보유를 선호합니다.\n스테이블 코인으로 거래하다보면 소비세 같은 국가가 알 수 있는 소비보다 알 수 없는 소비를 증가시키게 됩니다.\n이러면 제도권의 영향력을 낮출 수 있습니다.\n이 일은 국가가 돈을 풀면 풀수록 더 심해질 것입니다.\n그렇다고 돈 푸는걸 줄이면 선거에서 지거나 트럼프한태 한마디 듣겠죠\n \n모든 것은 트럼프의 길로 가고 있다고 보입니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1430",
    "pubDate": "Wed, 15 Oct 2025 15:04:49 +0900",
    "creator": "SIDNFT",
    "categories": [
      "투자",
      "경제",
      "금",
      "코인",
      "트럼프"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "고블린과 함께 청소를! 고블린 클린업",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2372",
    "pubDate": "Mon, 13 Oct 2025 15:28:44 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "게임툰"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "아버지 쇼핑 - 독일 드르투 면도기",
    "description": "저는 참고로 인포벨 싫어합니다. \n싫다는 정도로 표현할 수 없고 증오에 가깝습니다.\n먹는거는 절대 비추구요 쿠팡에서 비슷한거 사면 절반가격에 살 수 있습니다.\n중국산도 찾아보면 비슷한거 반값에 팝니다. 괜히 2개 줘서 가격을 올리는 놈들입니다.\n여러번 쇼핑 호구 당하신 아버지는 이번에도 인포벨껄 사달라고 하십니다.\n\n이번엔 면도기군요 \n먹을꺼도 아니고\n중국산도 아니라 \n구입 진행합니다.\n \n장점으로 내세우는것\n안전 - 다른걸 써도 피본적이 없어서 전혀 공감은 안갑니다.\n충전된다. - 미친 인포벨 이걸 장점이라고\n물로 씻는다 - 이것도 장점인가\n다용도 \n코털도 깎는다.\n머리도 깎는다.\n이거는 좋습니다. 따로 사면 만원씩 드는거라\n \n \n \n제가 생각하는 자점\n싸다 - 39,900 원\n다용도다\n \n과장 광고는 계속 의심해야합니다.\n독일꺼 엄청 강조하는데 \n중국에서 제조했을 것으로 의심됩니다.\n이상할 정도로 많이 강조합니다.\n \n인포벨의 과장광고는 노인들을 잘 홀리니 주의 하시구요\n사달라고 하면 안된다고 말해봐야 소용없으니 본인 돈으로 사게 만드시면\n몇번 사보다 호구 털린걸 알게되서 안사는 쪽으로 유도해야합니다.\n \n우리들도 쇼핑의 즐거움은 알기 때문에 못사게 말리는건 역효과가 납니다.\n싼거 있으면 싼거 알려주고 사준다음 인터넷에 이런 저런 단점들을 알려주면서\n교육 시켜야합니다.\n \n \n \n \n중국산 보다 광고자체는 슴슴합니다.\n인포벨 영상: https://www.youtube.com/watch?v=IwBL7y1MS84\n\n\n\n \n \n쿠팡 스샷",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1432",
    "pubDate": "Thu, 16 Oct 2025 16:42:11 +0900",
    "creator": "SIDNFT",
    "categories": [
      "유튜브",
      "과장광고",
      "쇼핑",
      "인포벨"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "블로거 시간을 획기적으로 줄이는 올인원 앱, 무료 배포",
    "description": "2025년, 블로거의 시간을 획기적으로 줄여줄 올인원 AI 블로깅 앱 'GPT PARK 올인원 블로깅 프로'를 소개합니다. 아이디어 발굴부터 SEO, 콘텐츠 생성, SNS 홍보까지 모든 과정을 한 번에 해결하여 블로그 운영의 효율을 극대화해보세요.\n\n\n\n블로그 운영, 정말 쉽지 않죠? \"오늘 뭐 쓰지?\", \"이 키워드는 상위 노출될까?\", \"SEO는 어떻게 최적화하지?\", \"이미지는 어디서 구하지?\"… 아마 이런 고민들 때문에 지쳐본 경험, 다들 있으실 거예요. 매일 반복되는 콘텐츠 고민에 시달리다가 결국 포기하고 싶었던 순간도 적지 않을 거라 생각합니다.\n저도 20년차 블로거로서 비슷한 어려움을 수없이 겪어왔습니다. 기존에 제미나이(Gemini) 젬 지침을 활용한 블로그 글쓰기 방법도 소개했지만, 인용 코드, 글자 수 제한, 그리고 결정적으로 블로그 이미지는 따로 생성해야 하는 번거로움이 늘 아쉬웠죠. 이 문제를 해결하려면 더욱 구조화되고 자동화된 도구가 필요했고, 그 결과물이 바로 AI Studio 기반의 'GPT PARK 올인원 블로깅 프로' 앱입니다. 젬 지침이 손으로 쓴 레시피 메모라면, 이 앱은 모든 것이 자동화된 스마트 주방 시스템이라고 비유할 수 있겠네요.\n오늘 제가 개발한 블로그 글쓰기의 끝판왕, 'GPT PARK 올인원 블로깅 프로'를 자세히 소개해 드릴게요. 이 앱 하나면 아이디어 발굴부터 SEO 분석, 고품질 기사 작성, 그리고 소셜 미디어 홍보까지, 블로그 운영의 모든 것이 한 곳에서 가능해집니다. 그럼, 이 앱이 블로거의 시간을 어떻게 획기적으로 줄여주는지 함께 알아볼까요?\n  블로그 성장의 비밀 무기: 앱 핵심 기능 둘러보기\n'GPT PARK 올인원 블로깅 프로'는 블로그 운영의 모든 과정을 세 가지 핵심 탭으로 통합하여 제공합니다. 각 탭은 유기적으로 연결되어, 글감 고민부터 최종 포스팅 발행까지 정말 자연스럽고 빠르게 진행할 수 있도록 설계되었어요.\n1. 주제 아이디어 얻기: 글감 부족 문제를 해결하는 첫걸음! AI가 다양한 관점에서 블로그에 딱 맞는 신선하고 경쟁력 있는 주제를 추천해줍니다.\n2. 키워드 파이터: SEO 전문가처럼 키워드를 깊이 있게 분석하고, 경쟁 블로그를 뛰어넘을 전략을 수립하는 강력한 도구입니다. 분석 결과가 바로 포스팅 생성으로 연동되는 편리함이 돋보이죠.\n3. 포스트 생성하기: 앞서 정한 주제와 전략을 바탕으로 실제 블로그 글을 생성합니다. 고품질의 블로그 콘텐츠가 클릭 한 번으로 탄생하는 놀라운 경험을 선사합니다.\n  아이디어 고갈? 이젠 과거형! '주제 아이디어 얻기' 심층 분석\n'주제 아이디어 얻기' 탭은 블로거의 가장 큰 고민 중 하나인 글감 고갈을 효과적으로 해결해줍니다. 여기서는 5가지 AI 분석 모델이 마치 여러 전문가처럼 다양한 관점에서 주제를 제안해요.\n\n\n다양한 AI 기반 주제 발굴 모델\n카테고리별 추천: IT, 건강, 재테크 등 블로그 카테고리를 선택하면 AI가 최신 트렌드를 반영한 창의적인 주제를 제안합니다.\nE-E-A-T 기반 주제 추천: 구글 검색 상위 노출의 핵심인 E-E-A-T(경험, 전문성, 권위, 신뢰도)를 높일 수 있는 주제를 AI가 선별해줍니다. SEO를 중요시한다면 필수!\n에버그린 콘텐츠: 시간이 지나도 가치가 변하지 않아 꾸준한 트래픽을 유도할 수 있는 주제를 추천합니다. (예: \"2025년 최신 전기차의 역사\") 블로그 초기에 쌓아두면 장기적으로 큰 도움이 되죠.\n롱테일 키워드 주제: 실시간 구글 검색을 분석해 경쟁은 낮지만, 명확한 목적을 가진 사용자를 타겟팅하는 주제를 제안합니다. (예: \"초보 러너를 위한 무릎 통증 예방 5분 스트레칭\")\n메모/파일 기반: 여러분의 간단한 메모, 글 초안, 강의 노트 등을 입력/업로드하면 AI가 핵심 내용을 분석하여 최적의 블로그 주제로 변환해줍니다. 저는 퍼플렉시티 검색 결과를 자주 활용합니다.\n  SEO 최적화의 핵심: '키워드 파이터'와 앱 연동\n블로그 글이 아무리 좋아도 독자에게 노출되지 않으면 의미가 없죠. '키워드 파이터' 탭은 여러분의 글이 더 많은 사람에게 닿을 수 있도록 돕는 강력한 SEO 도구입니다. 이 탭은 네이버 검색 API와 연동되므로, 사용 전 네이버 개발자 센터에서 API 키를 발급받아 앱에 등록하는 과정이 필요합니다. 한 번만 설정해두면 계속해서 사용할 수 있으니, 블로그의 가시성을 높이는 데 필수적인 과정이라고 할 수 있어요.\n'키워드 파이터'의 가장 큰 장점은 분석된 키워드를 기반으로 제공되는 주제를 선택하면, 바로 '포스트 생성하기' 탭으로 연결된다는 점입니다. 키워드 연구부터 글쓰기까지, 정말 물 흐르듯 끊김 없이 효율적인 워크플로우를 제공합니다.\n✍️ 고품질 콘텐츠의 마법: '포스트 생성하기' 완전 정복\n'GPT PARK 올인원 블로깅 프로'의 하이라이트는 역시 '포스트 생성하기' 탭입니다. 이곳에서 앞선 탭들에서 얻은 영감과 전략을 바탕으로 실제 블로그 글이 만들어집니다.\n\n\n맞춤형 블로그 글 생성 옵션\n자동 제목 및 추가 요청: 선택한 주제가 자동으로 블로그 제목이 되며, 추가적으로 원하는 사항(예: \"전문 용어 최소화\")을 입력할 수 있습니다.\n7가지 컬러 테마: 블로그의 컨셉에 맞춰 7가지 테마 중 하나를 선택하면, 앱이 인라인 스타일을 적용하여 시각적으로 매력적인 글을 완성합니다.\n대표 및 서브 이미지 자동 생성: 글의 내용에 맞는 대표 이미지와 최대 3개의 서브 이미지를 자동으로 생성해줍니다. 이미지 검색에 시간을 낭비할 필요가 없어요.\n썸네일용 텍스트 추가: 대표 이미지 위에 블로그 제목이나 핵심 문구를 넣어 클릭을 유도하는 썸네일을 만들 수 있습니다. 글꼴, 색상, 크기, 외곽선까지 자유롭게 조절 가능합니다.\n인터랙티브 요소: 진단기나 계산기 같은 인터랙티브 요소를 글에 추가하여 독자의 참여를 유도하고 체류 시간을 늘릴 수 있습니다.\nAI의 한계를 넘어서는 '인간적인 글쓰기'\n가장 특별한 기능은 '인간적인 글쓰기' 옵션입니다. AI가 쓴 글이라는 느낌을 최소화하고, 마치 사람이 직접 쓴 듯 자연스럽고 개성 있는 글을 만들어줍니다.\n유형 A (친근한 대화체): \"솔직히 말하면\"처럼 감정이나 개인 경험을 넣어 독자와의 공감대를 형성합니다.\n유형 B (전문적인 신뢰감): 논리적이고 구조적인 글쓰기로 전문가의 설명을 듣는 듯한 신뢰감을 선사합니다.\n콘텐츠 성격에 맞춰 유형을 선택하면, 블로그의 개성을 더욱 살리고 독자들에게 더 깊이 다가갈 수 있을 거예요. 모든 설정 후 '포스트 생성' 버튼을 클릭하면, 약 1분 만에 고품질의 블로그 기사가 완성됩니다. 미리보기에서 이미지와 함께 완벽하게 어우러진 글을 확인할 수 있죠!\n ️ 효율적인 블로그 발행 팁: 이미지 처리의 중요성\n앱에서 생성된 HTML 코드를 블로그에 붙여넣을 때, \"왜 이미지는 빠져있지?\" 하고 궁금해하실 수 있습니다. 이 부분은 블로그 운영 효율과 SEO에 아주 중요한 팁입니다.\n⚠️ 필수 확인: HTML 코드에는 이미지 파일 자체가 아니라 이미지 경로(URL)만 저장됩니다. 앱 미리보기는 앱 서버 이미지를 보여주지만, 블로그 플랫폼은 그 경로를 찾을 수 없어요. 따라서 이미지는 반드시 각 블로그 플랫폼에 직접 업로드해야 합니다.\n이미지를 HTML에 직접 삽입하는 베이스64 인코딩 방식은 파일 크기를 엄청나게 늘려 블로그 편집기를 느리게 하고, 페이지 로딩 속도를 저하시킵니다. 이는 구글 검색 순위에도 부정적인 영향을 미치죠. 'GPT PARK 올인원 블로깅 프로'는 이런 점을 고려하여 이미지를 따로 관리하도록 설계되었습니다. 생성된 이미지를 다운로드하여 블로그에 직접 업로드하고 알트 태그를 추가하는 것이 가장 효율적인 방법입니다.\n\n\n  블로그 홍보, 이제 소셜 미디어까지 한 번에!\n열심히 작성한 블로그 글, 더 많은 사람에게 효과적으로 알려야겠죠? 'GPT PARK 올인원 블로깅 프로'는 블로그 글 생성 후에 각 소셜 미디어 플랫폼에 최적화된 홍보 문구를 자동으로 생성해주는 기능까지 포함하고 있습니다.\n스레드, 인스타그램, 페이스북, X(구 트위터) 등 주요 SNS 플랫폼의 특성을 완벽하게 이해하고 맞춤형 문구를 제안합니다. 인스타그램에는 시각적인 매력을 강조한 감성적인 표현을, X에는 짧고 임팩트 있는 핵심 문구를 제안하는 식이죠. 이 기능을 통해 여러 도구를 오가는 번거로움 없이 블로깅 작업부터 SNS 홍보까지 원스톱으로 효율적인 처리가 가능해집니다.\n  핵심 요약\n✨ 아이디어 고갈 해결: 5가지 AI 모델로 무궁무진한 블로그 주제를 발굴하고, 에버그린 및 롱테일 키워드 전략으로 지속적인 트래픽을 확보하세요.\n  강력한 SEO/AEO 최적화: '키워드 파이터'로 네이버 검색 API 기반의 심층 키워드 분석을 통해 상위 노출 전략을 수립하고, E-E-A-T 기반 주제로 구글 검색 가시성을 높이세요.\n✍️ 단 1분 만에 고품질 콘텐츠: AI가 자동으로 인라인 스타일 HTML, 대표/서브 이미지, 썸네일, 인터랙티브 요소까지 포함한 블로그 글을 생성하여 시간과 노력을 획기적으로 절감합니다.\n  통합 소셜 미디어 홍보: 생성된 블로그 글을 바탕으로 스레드, 인스타그램, 페이스북, X 등 각 플랫폼에 최적화된 홍보 문구를 자동으로 생성하여 효과적인 확산을 지원합니다.\n더 이상 블로그 운영에 시간을 낭비하지 마세요! 'GPT PARK 올인원 블로깅 프로'로 여러분의 블로그를 한 단계 업그레이드할 시간입니다.\n  GPT PARK 올인원 블로깅 BASIC 무료배포\n 아래 링크로 BASIC 버전 무료 배포합니다. 이 버전에는 키워드 파이터와 인간적인 글쓰기 기능이 포함되지 않았지만 일반적인 포스팅에는 이용에 문제가 없습니다. 모든 기능이 담긴 PRO 버전을 사용하시려면 제 유튜브 채널 멤버십에 가입하신 후 멤버십 전용 게시판에서 프로 버전 링크를 받으실 수 있습니다.\n\n\n\n \n로그인 - Google 계정\n이메일 또는 휴대전화\naccounts.google.com\n\n❓ 자주 묻는 질문 (FAQ)\nQ1: 'GPT PARK 올인원 블로깅 프로'는 어떤 블로그 플랫폼과 호환되나요?\nA1: 이 앱은 생성된 HTML 코드를 제공하므로, HTML 편집 기능을 지원하는 대부분의 블로그 플랫폼(예: 티스토리, 워드프레스 등)에서 활용할 수 있습니다. 이미지는 각 플랫폼에 직접 업로드해야 합니다.\nQ2: '인간적인 글쓰기' 유형 A와 B는 어떻게 다른가요?\nA2: 유형 A는 감정적 표현과 개인적인 경험을 담아 친근하고 대화하는 듯한 느낌을 줍니다. 반면 유형 B는 논리적인 구조와 다양한 어휘로 전문적이고 신뢰감 있는 톤으로 글을 작성합니다. 콘텐츠의 성격에 맞춰 선택하시면 됩니다.\nQ3: 네이버 검색 API 키 등록은 필수인가요?\nA3: '키워드 파이터' 탭의 모든 기능을 활용하려면 네이버 검색 API 키 등록이 필수입니다. 하지만 API 키 없이도 '주제 아이디어 얻기' 탭과 '포스트 생성하기' 탭의 기본적인 기능은 모두 사용할 수 있습니다.\nQ4: 'GPT PARK 올인원 블로깅 프로'의 베이직 버전과 프로 버전의 차이점은 무엇인가요?\nA4: 베이직 버전은 일반적인 포스팅에 필요한 핵심 기능을 제공하며, 프로 버전에는 '키워드 파이터'의 심층 분석 기능과 '인간적인 글쓰기' 옵션을 포함한 모든 고급 기능이 담겨 있습니다. 자세한 내용은 앱 공식 페이지를 참고해주세요.",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483670",
    "pubDate": "Sat, 18 Oct 2025 21:50:18 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 챗봇 및 지침 무료 배포",
      "AI Studio 앱 빌드",
      "ai 블로그 글쓰기",
      "E-E-A-T 주제 추천",
      "GPT PARK 올인원 블로깅 프로",
      "SEO 최적화 앱",
      "블로그 생산성 향상",
      "블로그 시간 단축",
      "블로그 콘텐츠 아이디어",
      "소셜 미디어 자동 홍보",
      "키워드 파이터"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "The State of Developer Ecosystem 2025: Coding in the Age of AI, New Productivity Metrics, and Changing Realities",
    "description": "Every year, the JetBrains Developer Ecosystem Survey takes a deep dive into the world of software development, looking at how developers work, what tools they use, and how the industry is changing.  The survey has been running since 2017 and has since grown into one of the most comprehensive studies of its kind. The 2025 […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/research/2025/10/state-of-developer-ecosystem-2025/",
    "pubDate": "Wed, 15 Oct 2025 13:01:04 +0000",
    "creator": "Olga Bedrina",
    "categories": [
      "deveco",
      "news",
      "research",
      "jetbrains-deveco",
      "jetbrains-research",
      "market-research"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "데이터 노가다 실수담 - 14th",
    "description": "URL 인코딩 패턴 디코딩.\n\n\n\n\n그런데 >를 의미하는 %3E 패턴을 추가해서 script 태그를 완성하면 데이터가 사라짐.\n\n\n\n\n\n혹시나 싶어 태그를 닫기 전에 \\를 추가해봤다.\n\n\n\n\n잘 됨. 공백을 추가해도 마찬가지. %3E 패턴 전에 아무 문자나 하나 추가해주면 데이터가 유지된다.\n\n\n\n\nscript 태그 방지 코드라도 적용돼 있는 거여 뭐여(..)\n\n\n관련 글\n\n데이터 노가다 실수담 - 13th\n데이터 노가다 실수담\n평균의 함정\n데이터 분석이 쉬워지는 비법\n데이터 분석에 필요한 자질은 뭘까?",
    "reviews": [],
    "syllabus": [],
    "link": "https://kangmyounghun.blogspot.com/2025/10/14th.html",
    "pubDate": "2025-10-19T03:17:00.006Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "Design for Sustainability: New Design Principles for Reducing IT Hardware Emissions",
    "description": "We’re presenting Design for Sustainability,  a set of technical design principles for new designs of IT hardware to reduce emissions and cost through reuse, extending useful life, and optimizing design. At Meta, we’ve been able to significantly reduce the carbon footprint of our data centers by integrating several design strategies such as modularity, reuse, retrofitting, [...]\nRead More...\nThe post Design for Sustainability: New Design Principles for Reducing IT Hardware Emissions appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/10/14/data-center-engineering/design-for-sustainability-new-design-principles-for-reducing-it-hardware-emissions/",
    "pubDate": "Tue, 14 Oct 2025 20:40:20 +0000",
    "creator": "Unknown",
    "categories": [
      "Data Center Engineering"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "10X Backbone: How Meta Is Scaling Backbone Connectivity for AI",
    "description": "We’re sharing details on our journey to scale Meta’s Backbone network to support the increasing demands of new and existing AI workloads. We’ve developed new technologies and designs to address our 10x scaling needs and applying some of these same principles to help extend our AI clusters between multiple data centers. Meta’s Backbone network is [...]\nRead More...\nThe post 10X Backbone: How Meta Is Scaling Backbone Connectivity for AI appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/10/16/data-center-engineering/10x-backbone-how-meta-is-scaling-backbone-connectivity-for-ai/",
    "pubDate": "Thu, 16 Oct 2025 16:30:02 +0000",
    "creator": "Unknown",
    "categories": [
      "Data Center Engineering"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "OCP Summit 2025: The Open Future of Networking Hardware for AI",
    "description": "At Open Compute Project Summit (OCP) 2025, we’re sharing details about the direction of next-generation network fabrics for our AI training clusters. We’ve expanded our network hardware portfolio and are contributing new disaggregated network platforms to OCP. We look forward to continued collaboration with OCP to open designs for racks, servers, storage boxes, and motherboards [...]\nRead More...\nThe post OCP Summit 2025: The Open Future of Networking Hardware for AI appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/10/13/data-infrastructure/ocp-summit-2025-the-open-future-of-networking-hardware-for-ai/",
    "pubDate": "Tue, 14 Oct 2025 00:00:20 +0000",
    "creator": "Unknown",
    "categories": [
      "Data Center Engineering",
      "Data Infrastructure",
      "DevInfra",
      "ML Applications",
      "Networking & Traffic",
      "Open Source"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "Branching in a Sapling Monorepo",
    "description": "Sapling is a scalable, user-friendly, and open-source source control system that powers Meta’s monorepo. As discussed at the GitMerge 2024 conference session on branching, designing and implementing branching workflows for large monorepos is a challenging problem with multiple tradeoffs between scalability and the developer experience. After the conference, we designed, implemented, and open sourced our [...]\nRead More...\nThe post Branching in a Sapling Monorepo appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/10/16/developer-tools/branching-in-a-sapling-monorepo/",
    "pubDate": "Thu, 16 Oct 2025 17:10:43 +0000",
    "creator": "Unknown",
    "categories": [
      "DevInfra",
      "Open Source"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "Splunk의 sourcetype 변경",
    "description": "다시 인덱싱을 하지 않는 한 저장된 인덱스의 소스타입은 바꿀 수 없다.\n\n\n\n\n이때 collect란 명령어를 사용해볼 수 있다. mysql의 create target_table select * from source_table과 유사. 인덱스는 당연히 미리 만들어 놔야 한다.\n\n\n\n\n\n검색 결과를 특정 경로에 임시 파일로 저장한 후, 새로운 인덱스에 저장해줌.  \n\n\n\n\n\n소스타입 변경도 가능.\n\n\n\n\n가공 결과를 별도 저장하고 싶을 때 유용할 듯.",
    "reviews": [],
    "syllabus": [],
    "link": "https://kangmyounghun.blogspot.com/2025/10/splunk-sourcetype.html",
    "pubDate": "2025-10-14T11:43:00.004Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "[MULTI] 부침 후 새로운 시작, 배틀필드 6",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2374",
    "pubDate": "Fri, 17 Oct 2025 16:39:28 +0900",
    "creator": "「RULIWEB」",
    "categories": [
      "리뷰"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "The State of PHP 2025",
    "description": "The State of PHP 2025 examines how developers use, prefer, and rely on PHP, showing how this long-standing web language continues to modernize through new frameworks, improved tooling, and AI-assisted workflows. In this report, we present findings from the Developer Ecosystem Survey 2025. Alongside the numbers, you’ll also hear commentary from Brent Roose, JetBrains Developer […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/phpstorm/2025/10/state-of-php-2025/",
    "pubDate": "Wed, 15 Oct 2025 14:00:04 +0000",
    "creator": "Tania Goral",
    "categories": [
      "news",
      "ai",
      "php"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "2025년, 구글을 넘어선 AI 지식 엔진: Perplexity가 당신의 검색을 혁신하는 5가지 방법",
    "description": "오늘날 우리는 정보의 홍수 속에 살고 있죠. 그런데 검색 엔진이 단순히 '정보의 문'만 열어준다면 어떨까요? 2025년, Perplexity는 구글을 넘어선 '지식 엔진'으로서 검색의 패러다임을 완전히 바꾸고 있습니다. 단순한 검색을 넘어, 심층 연구부터 프로젝트 생성, AI 비서 역할까지! 이 글에서 Perplexity가 우리의 디지털 생활을 어떻게 혁신하는지 5가지 핵심 방법을 알려드릴게요.\n\n\n1. Perplexity는 구글과는 다릅니다: 단순 검색을 넘어선 '지식 엔진'  \n 음, 많은 분들이 처음 Perplexity를 접할 때, 구글 검색의 좀 더 세련된 버전이라고 생각하는 경향이 있는 것 같아요. 저도 그랬으니까요. 물론 인터페이스가 깔끔하고 결과가 빠르게 나오니 그렇게 느낄 수 있죠. 하지만 사실 Perplexity는 구글과는 완전히 다른 방식으로 작동합니다. 단순히 검색 바를 넘어서는, 진정한 '지식 엔진'이라고 부르는 게 맞을 거예요.\n구글에 뭔가를 검색하면, 보통 수많은 웹 페이지 링크와 함께 간략한 AI 요약이 뜨죠. 그다음부터는 사용자가 직접 링크를 클릭해서 정보를 찾아야 합니다. 구글이 관련도 높은 페이지를 상위에 배치하는 데는 꽤나 능숙하지만, 원하는 정보를 찾기 위해선 결국 스크롤을 한참 내리거나 여러 페이지를 오가는 수고가 필요합니다.\n그런데 Perplexity는 접근 방식 자체가 달라요. 질문을 던지면, 단순히 정보가 있을 만한 곳을 '가리키는' 데 그치지 않습니다. 대신, 웹의 수많은 출처를 직접 탐색하고, 정보를 읽어 들인 다음, 명확하고 간결하며 종종 신뢰할 수 있는 출처가 명시된 답변을 제공하죠. 마치 전담 연구원이 필요한 정보를 찾아서 핵심만 정리해주는 느낌이랄까요? 구글이 정보를 찾을 '문'을 보여준다면, Perplexity는 그 문을 열고 들어가 당신을 위해 필요한 모든 것을 정리해서 가져다주는 겁니다. 이게 정말 큰 차이에요.\n\n\n2. 단순 검색을 넘어서는 무한한 가능성: 심층 연구부터 프로젝트 생성까지  \nPerplexity의 진가는 단순 답변 제공을 넘어서는 고급 기능들에서 빛을 발합니다. 저도 처음엔 그냥 궁금한 거 물어보는 용도로만 썼는데, 써보면 쓸수록 와, 이거 진짜 물건이다 싶더라고요. 몇 가지 핵심 기능을 소개해 드릴게요.\n  Pro Search (프로 검색): 일반 검색보다 훨씬 심층적인 답변을 제공합니다. 질의의 의도를 정확히 파악하고, 필요한 경우 추가 질문을 던져 사용자가 원하는 바를 명확히 이해한 뒤, 더욱 상세하고 포괄적인 답변을 내놓죠. 복잡한 학술 개념이나 특정 주제에 대한 깊은 이해가 필요할 때 정말 유용합니다.\n  Research 모드 (연구 모드): 특정 주제에 대해 가능한 모든 정보를 원한다면 이 모드를 꼭 활용해 보세요. 수많은 출처를 면밀히 검토하고 분석하여 상세한 보고서를 생성해줍니다. 때로는 100개가 넘는 출처를 읽어 들여 보고서를 만들어내는데, 이 과정을 사람이 직접 한다면 아마 수십 시간이 걸릴 거예요. 이 기능 덕분에 저도 자료 조사 시간을 정말 많이 줄였답니다.\n  Labs 모드 (랩스 모드): 여기서부터는 정말 '프로젝트' 수준의 작업이 가능해집니다. Perplexity가 찾아낸 정보를 바탕으로 전체 프로젝트를 구성할 수 있어요. 예를 들어, 차트가 포함된 보고서를 작성해야 할 때, 특정 데이터 포인트를 찾아주거나, 여러 출처에서 데이터를 수집하여 다양한 차트를 생성해주는 것을 넘어, 아예 차트를 직접 만들어주는 것도 가능합니다. 정말 놀랍지 않나요?\n또한, Perplexity는 쇼핑 경험도 혁신하고 있습니다. 사진 한 장으로 제품을 쉽게 찾아주는 것은 기본이고, 'Buy with Pro' 기능을 사용하면 Perplexity 내에서 원클릭으로 결제하고 무료 배송까지 받을 수 있죠. 제가 써보니 정말 편리하더라고요.\n그리고 2025년 현재, Perplexity는 무려 10개가 넘는 다양한 AI 모델을 선택하여 사용할 수 있게 지원합니다. Claude Sonnet, Gemini 2.5 Pro, GPT-5, 그리고 Grok 4와 같은 최신 모델들을 한자리에서 비교하며 최적의 답변을 얻을 수 있다는 건 정말 강력한 장점이라고 생각해요. 매번 다른 챗봇을 찾아 헤맬 필요 없이, Perplexity 하나로 충분합니다.\n\n\n3. Perplexity Assistant, 당신의 스마트한 비서  \nPerplexity는 모바일에서도 빛을 발합니다. 안드로이드나 아이폰의 기본 AI 비서를 대체할 수 있는 Perplexity Assistant는 단순한 질의응답을 넘어섭니다. 제가 직접 사용해보니, 알람 설정, 미리 알림 생성, 택시 호출, 음악 재생 등 일상적인 작업을 대신 처리해주는 능력이 꽤나 인상 깊었어요.\n특히 놀라운 점은 바로 멀티모달(multimodal) 기능입니다. 카메라를 이용한 이미지 입력이나 실시간 카메라 피드를 분석하여 객체를 식별하고 설명해줄 수 있어요. 예를 들어, 길을 가다 처음 보는 식물에 카메라를 가져다 대고 \"이게 뭐야?\"라고 물으면, Perplexity가 그 식물의 이름과 특징을 자세히 알려주는 식이죠. 자체적인 리서치 능력 덕분에 웬만한 질문에는 정확한 답변을 내놓더라고요. 물론 디바이스 통합 능력은 아직 기본 AI 비서에 비해 완벽하진 않지만, 정보 탐색과 분석에서는 독보적인 존재감을 드러냅니다.\n⚠️ 주의 사항: Perplexity Assistant의 디바이스 연동 기능은 기본 AI 비서만큼 매끄럽지 않을 수 있습니다. 모든 앱과 서비스에 완벽하게 통합되지는 않으니, 특정 앱 연동 작업 시에는 한계가 있음을 인지하고 사용하는 것이 좋습니다.\n4. Comet과 함께라면 검색 경험이 한 단계 업그레이드!  \n만약 Perplexity의 매력에 푹 빠지셨다면, Comet 브라우저를 한번 사용해보시길 정말 강력하게 추천해요. Comet은 Perplexity의 강력한 AI 기능이 핵심적으로 통합된 브라우저입니다. 솔직히 말씀드리자면, 저는 Comet을 써본 뒤로 크롬으로 돌아갈 수 없게 되었어요. 그만큼 빠르고 효율적이며, 검색 경험을 완전히 바꿔놓았거든요.\nComet의 가장 혁신적인 기능 중 하나는 바로 '에이전트 AI'입니다. 이 AI는 당신을 대신하여 작업을 수행할 수 있어요. 심지어 다른 탭에서 작업을 하거나 잠시 자리를 비워도 백그라운드에서 지시한 작업을 처리해줍니다. 예를 들어, 특정 정보를 지속적으로 모니터링하거나, 복잡한 양식을 자동으로 채우는 등, 번거로운 일들을 Comet에게 맡기고 당신은 더 중요한 일에 집중할 수 있게 되는 거죠. 일상적인 작업을 자동화하여 시간을 절약하는 데 엄청난 도움이 됩니다.\n또한 Comet은 '상황 인식 홈 페이지'를 제공합니다. 당신의 브라우징 패턴을 학습하고, 현재 진행 중인 작업에 따라 관련 콘텐츠를 제안하거나, 이전에 작업하던 내용을 상기시켜주고, 심지어 작업량에 기반한 정보를 띄워주기도 합니다. 요즘 많은 브라우저들이 홈 페이지의 이런 아이코닉한 기능을 포기하는 추세인데, Comet은 오히려 이를 진화시켜 사용자에게 훨씬 개인화되고 효율적인 경험을 제공합니다. 프라이버시 문제에 대한 우려도 있을 수 있지만, 제공하는 가치를 생각하면 충분히 고려해볼 만합니다.\n\n\n5. Perplexity, 단순한 검색을 넘어선 진정한 지식 허브로  \n여러분은 아직도 Perplexity를 구글의 대안 정도로만 생각하고 계신가요? 제 생각엔 Perplexity는 단순한 검색 도구를 넘어, 진정한 '지식 허브'이자 'AI 기반 작업 자동화 도구'에 가깝다고 봅니다. 물론 Perplexity의 가장 유용한 기능들은 대부분 구독을 통해 이용할 수 있지만, Perplexity Pro 구독은 그 비용을 충분히 상회하는 가치를 제공한다고 확신해요.\nAI 검색 도구가 기존의 구글 검색을 완전히 대체할 수 없는 몇 가지 이유가 있을 수 있지만, Perplexity Pro 구독을 최대한 활용한다면 구글 검색으로는 얻을 수 없는 훨씬 더 많은 것을 해낼 수 있습니다. 구글이 정보를 단순히 '제공'한다면, Perplexity는 그 정보를 '실행 가능한 형태로' 제시하거나, 심지어 당신을 대신해 특정 작업을 '수행'하는 수준까지 나아가니까요.\n한번 Perplexity의 놀라운 경험을 해보고 나면, 아마 다시 과거의 단순 검색 방식으로 돌아가기는 정말 어려울 거예요. 2025년, Perplexity는 우리에게 검색의 새로운 기준을 제시하고 있습니다.\n  핵심 요약\n1. 구글이 정보를 '안내'한다면, Perplexity는 수많은 출처를 분석하여 정리된 답변을 직접 제공합니다.\n2. Pro Search, Research 모드로 심층적인 정보 탐색이, Labs 모드로는 데이터 시각화 및 프로젝트 생성이 가능합니다.\n3. Perplexity Assistant는 모바일에서 AI 비서 역할을 수행하며, 이미지 분석을 통한 객체 식별까지 지원합니다.\n4. Comet 브라우저는 Perplexity AI를 내장하여 에이전트 AI 기반의 자동화된 웹 경험과 개인화된 홈 페이지를 제공합니다.\n이처럼 Perplexity는 단순 검색을 넘어 당신의 생산성과 지식 탐색 방식을 완전히 변화시킬 준비가 되어 있습니다.\n❓ 자주 묻는 질문 (FAQ)\nQ1: Perplexity와 Google 검색의 가장 큰 차이점은 무엇인가요?\nA: Google은 주로 웹 페이지 링크를 보여주는 반면, Perplexity는 여러 출처를 분석하여 요약되고 인용된 답변을 직접 제공합니다. 즉, 정보를 찾는 수고를 대신 해줍니다.\nQ2: Perplexity Pro 구독은 어떤 이점이 있나요?\nA: Pro 구독 시 Pro Search, Research, Labs 모드와 같은 고급 기능, 다양한 AI 모델 선택, 그리고 Comet 브라우저와의 연동 등 훨씬 강력한 기능을 활용하여 생산성을 극대화할 수 있습니다.\nQ3: Perplexity Assistant는 어떤 작업을 할 수 있나요?\nA: 알람 설정, 미리 알림, 택시 호출, 음악 재생 등 기본적인 비서 기능과 더불어 이미지 및 카메라 입력 분석을 통한 객체 식별 및 설명이 가능하여 일상과 지식 탐색을 돕습니다.\nQ4: Comet 브라우저는 왜 특별한가요?\nA: Comet은 Perplexity AI가 내장된 브라우저로, 에이전트 AI가 백그라운드에서 작업을 자동화하고, 사용자의 브라우징 패턴을 학습하여 개인화된 경험을 제공하는 혁신적인 웹 브라우저입니다.\n\n\n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Perplexity와 Google 검색의 가장 큰 차이점은 무엇인가요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Google은 주로 웹 페이지 링크를 보여주는 반면, Perplexity는 여러 출처를 분석하여 요약되고 인용된 답변을 직접 제공합니다. 즉, 정보를 찾는 수고를 대신 해줍니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Perplexity Pro 구독은 어떤 이점이 있나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Pro 구독 시 Pro Search, Research, Labs 모드와 같은 고급 기능, 다양한 AI 모델 선택, 그리고 Comet 브라우저와의 연동 등 훨씬 강력한 기능을 활용하여 생산성을 극대화할 수 있습니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Perplexity Assistant는 어떤 작업을 할 수 있나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"알람 설정, 미리 알림, 택시 호출, 음악 재생 등 기본적인 비서 기능과 더불어 이미지 및 카메라 입력 분석을 통한 객체 식별 및 설명이 가능하여 일상과 지식 탐색을 돕습니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"Comet 브라우저는 왜 특별한가요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"Comet은 Perplexity AI가 내장된 브라우저로, 에이전트 AI가 백그라운드에서 작업을 자동화하고, 사용자의 브라우징 패턴을 학습하여 개인화된 경험을 제공하는 혁신적인 웹 브라우저입니다.\"\n      }\n    }\n  ]\n}",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483668",
    "pubDate": "Fri, 17 Oct 2025 15:39:42 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "ai 검색 혁신",
      "AI 기술 2025",
      "AI 비서",
      "AI 지식 엔진",
      "AI 프로젝트 생성",
      "Comet 브라우저",
      "perplexity",
      "구글 대안",
      "생산성 향상",
      "심층 연구 AI"
    ]
  }
]