[
  {
    "name": "C++ Team Blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Facebook Engineering",
    "category": "기업",
    "posts": [
      {
        "creator": "",
        "title": "Python Typing Survey 2025: Code Quality and Flexibility As Top Reasons for Typing Adoption",
        "link": "https://engineering.fb.com/2025/12/22/developer-tools/python-typing-survey-2025-code-quality-flexibility-typing-adoption/",
        "pubDate": "Mon, 22 Dec 2025 14:00:16 +0000",
        "content:encodedSnippet": "The 2025 Typed Python Survey, conducted by contributors from JetBrains, Meta, and the broader Python typing community, offers a comprehensive look at the current state of Python’s type system and developer tooling. With 1,241 responses (a 15% increase from last year), the survey captures the evolving sentiment, challenges, and opportunities around Python typing in the open-source ecosystem. In this blog we’ll cover a summary of the key findings and trends from this year’s results.\nWho Responded?\nThe survey was initially distributed on official social media accounts by the survey creators, and subsequently shared organically across further platforms including Reddit, email newsletters, Mastodon, LinkedIn, Discord, and Twitter. When respondents were asked which platform they heard about the survey from, Reddit emerged as the most effective channel, but significant engagement also came from email newsletters and Mastodon, reflecting the diverse spaces where Python developers connect and share knowledge.\nThe respondent pool was predominantly composed of developers experienced with Python and typing. Nearly half reported over a decade of Python experience, and another third had between five and 10 years. While there was representation from newcomers, the majority of participants brought substantial expertise to their responses. Experience with type hints was similarly robust, with most respondents having used them for several years and only a small minority indicating no experience with typing.\nTyping Adoption and Attitudes\nThe survey results reveal that Python’s type hinting system has become a core part of development for most engineers. An impressive 86% of respondents report that they “always” or “often” use type hints in their Python code, a figure that remains consistent with last year’s Typed Python survey. \nFor the first time this year the survey also asked participants to indicate how many years of experience they have with Python and with Python typing. We found that adoption of typing is similar across all experience levels, but there are some interesting nuances:\nDevelopers with 5–10 years of Python experience are the most enthusiastic adopters, with 93% reporting regularly using type hints.\nAmong the most junior developers (0–2 years of experience), adoption is slightly lower at 83%. Possible reasons for this could be the learning curve for newcomers (repeatedly mentioned in later survey questions).\nFor senior developers (10+ years of experience), adoption was the lowest of all cohorts, with  only 80% reporting using them always or often. Reasons for this drop are unclear, it could reflect more experienced python developers having gotten used to writing Python without type hints before they were supported, or possibly they are more likely to work on larger or legacy codebases that are difficult to migrate.\nPercent of respondents who use types “often” or “always,” segmented by years of Python experience.\nOverall, the data shows that type hints are widely embraced by the Python community, with strong support from engineers at all experience levels. However, we should note there may be some selection bias at play here, as it’s possible developers who are more familiar with types and use them more often are also more likely to be interested in taking a survey about it.\nWhy Developers Love Python Typing\nWhen asked what developers loved about the Python type system there were some mixed reactions, with a number of responses just stating, “nothing” (note this was an optional question). This indicates the presence of some strong negative opinions towards the type system among a minority of Python users. The majority of responses were positive, with the following themes emerging prominently:\nOptionality and Gradual Adoption: The optional nature of the type system and the ability to adopt it incrementally into existing projects are highly valued, allowing flexibility in development.\nImproved Readability and Documentation: Type hints serve as in-code documentation, making code clearer and easier to read, understand, and reason about for both the author and other developers, especially in larger codebases.\nEnhanced Tooling and IDE Support: The type system significantly improves IDE features like autocomplete/IntelliSense, jump-to-definition, and inline type hints, leading to a better developer experience.\nBug Prevention and Code Correctness: It helps catch errors and subtle bugs earlier during development or refactoring, increasing confidence and leading to more robust and reliable code.\nFlexibility and Features: Respondents appreciate the flexibility, expressiveness, and powerful features of the system, including protocols, generics (especially the new syntax), and the ability to inspect annotations at runtime for use with libraries like Pydantic/FastAPI.\nSample of responses to the question, “What do you love about Python Typing?”\nChallenges and Pain Points\nIn addition to assessing positive sentiment towards Python typing, we also asked respondents what challenges and pain points they face. With over 800 responses to the question, “What is the hardest part about using the Python type system?” the following themes were identified:\nThird-Party Library/Framework Support: Many respondents cited the difficulty of integrating types with untyped, incomplete, or incorrect type annotations in third-party libraries (e.g., NumPy, Pandas, Django).\nComplexity of Advanced Features: Advanced concepts such as generics, TypeVar (including co/contravariance), callables/decorators, and complex/nested types were frequently mentioned as difficult to understand or express.\nTooling and Ecosystem Fragmentation: The ecosystem is seen as chaotic, with inconsistencies between different type checkers (like Mypy and Pyright), slow performance of tools like Mypy, and a desire for an official, built-in type checker.\nLack of Enforcement and Runtime Guarantees: The fact that typing is optional and is not enforced at runtime or by the Python interpreter makes it harder to convince others to use it, enforce its consistent use, and fully trust the type hints.\nVerbosity and Code Readability: The necessary type hints, especially for complex structures, can be verbose, make the code less readable, and feel non-Pythonic.\nDealing with Legacy/Dynamic Code: It is hard to integrate typing into old, untyped codebases, particularly when they use dynamic Python features that do not play well with static typing.\nType System Limitations and Evolution: The type system is perceived as incomplete or less expressive than languages like TypeScript, and its rapid evolution means syntax and best practices are constantly changing.\nMost Requested Features\nA little less than half of respondents had suggestions for what they thought was missing from the Python type system, the most commonly requested features being:\nMissing Features From TypeScript and Other Languages: Many respondents requested features inspired by TypeScript, such as Intersection types (like the & operator), Mapped and Conditional types, Utility types (like Pick, Omit, keyof, and typeof), and better Structural typing for dictionaries/dicts (e.g., more flexible TypedDict or anonymous types).\nRuntime Type Enforcement and Performance: A significant number of developers desire optional runtime type enforcement or guarantees, as well as performance optimizations (JIT/AOT compilation) based on the type hints provided.\nBetter Generics and Algebraic Data Types (ADTs): Requests include features like higher-kinded types (HKT), improved support for TypeVarTuple (e.g., bounds and unpacking), better generics implementation, and official support for algebraic data types (e.g., Result, Option, or Rust-like enums/sum types).\nImproved Tooling, Consistency, and Syntax: Developers asked for an official/built-in type checker that is fast and consistent, a less verbose syntax for common patterns like nullable types (? instead of | None) and callables, and better support/documentation for complex types (like nested dicts, NumPy/Pandas arrays).\nHandling of Complex/Dynamic Patterns: Specific missing capabilities include better support for typing function wrappers/decorators (e.g., using ParamSpec effectively), being able to type dynamic attributes (like those added by Django/ORMs), and improved type narrowing and control flow analysis.\nTooling Trends\nThe developer tooling landscape for Python typing continues to evolve, with both established and emerging tools shaping how engineers work.\nMypy remains the most widely used type checker, with 58% of respondents reporting using it. While this represents a slight dip from 61% in last year’s survey, Mypy still holds a dominant position in the ecosystem. At the same time, new Rust-based type checkers like Pyrefly, Ty, and Zuban are quickly gaining traction, now used by over 20% of survey participants collectively.\nThe top six most popular answers to the question, “What type checking tools do your projects use (select all that apply)?”\nWhen it comes to development environments, VS Code leads the pack as the most popular IDE among Python developers, followed by PyCharm and (Neo)vim/vim. The use of type checking tools within IDEs also mimics the popularity of the IDE themselves, with VS Code’s default (Pylance/Pyright) and PyCharm’s built-in support being the first and third most popular options respectively.\nHow Developers Learn and Get Help\nWhen it comes to learning about Python typing and getting help, developers rely on a mix of official resources, community-driven content, and AI-powered tools, a similar learning landscape to what we saw in last year’s survey.\nTop six responses to the question, “How do you learn Python typing (select all that apply)?”\nOfficial documentation remains the go-to resource for most developers. The majority of respondents reported learning about Python typing through the official docs, with 865 citing it as their primary source for learning and 891 turning to it for help. Python’s dedicated typing documentation and type checker-specific docs are also heavily used, showing that well-maintained, authoritative resources are still highly valued.\nBlog posts have climbed in popularity, now ranking as the second most common way developers learn about typing, up from third place last year. Online tutorials, code reviews, and YouTube videos also play a significant role.\nCommunity platforms are gaining traction as sources for updates and new features. Reddit, in particular, has become a key channel for discovering new developments in the type system, jumping from fifth to third place as a source for news. Email newsletters, podcasts, and Mastodon are also on the rise.\nLarge language models (LLMs) are now a notable part of the help-seeking landscape. Over 400 respondents reported using LLM chat tools, and nearly 300 use in-editor LLM suggestions when working with Python typing. \nOpportunities and Next Steps\nThe 2025 Python Typing Survey highlights the Python community’s sustained adoption of typing features and tools to support their usage. It also points to clear opportunities for continued growth and improvement, including:\nIncreasing library coverage: One of the most consistent requests from the community is for broader and deeper type annotation coverage in popular libraries. Expanding type hints across widely used packages will make static typing more practical and valuable for everyone.\nImproving documentation: While official documentation remains the top resource, there’s a strong appetite for more discoverable and accessible learning materials. Leveraging channels like newsletters, blog posts, and Reddit can help surface new features, best practices, and real-world examples to a wider audience.\nClarify tooling differences: The growing variety of type checkers and tools is a sign of a healthy ecosystem, but can also reflect a lack of consensus/standardisation and can be confusing for users. There’s an opportunity to drive more consistency between tools or provide clearer guidance on their differences and best-fit use cases.\nTo learn more about Meta Open Source, visit our website, subscribe to our YouTube channel, or follow us on Facebook, Threads, X, Bluesky and LinkedIn.\nAcknowledgements\nThis survey ran from 29th Aug to 16th Sept 2025 and received 1,241 responses in total.\nThanks to everyone who participated! The Python typing ecosystem continues to evolve, and your feedback helps shape its future.\nAlso, special thanks to the Jetbrains PyCharm team for providing the graphics used in this piece.\nThe post Python Typing Survey 2025: Code Quality and Flexibility As Top Reasons for Typing Adoption appeared first on Engineering at Meta.",
        "dc:creator": "",
        "content": "<p>The 2025 Typed Python Survey, conducted by contributors from JetBrains, Meta, and the broader Python typing community, offers a comprehensive look at the current state of Python’s type system and developer tooling. With 1,241 responses (a 15% increase from last year), the survey captures the evolving sentiment, challenges, and opportunities around Python typing in the [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/12/22/developer-tools/python-typing-survey-2025-code-quality-flexibility-typing-adoption/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2025/12/22/developer-tools/python-typing-survey-2025-code-quality-flexibility-typing-adoption/\">Python Typing Survey 2025: Code Quality and Flexibility As Top Reasons for Typing Adoption</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
        "contentSnippet": "The 2025 Typed Python Survey, conducted by contributors from JetBrains, Meta, and the broader Python typing community, offers a comprehensive look at the current state of Python’s type system and developer tooling. With 1,241 responses (a 15% increase from last year), the survey captures the evolving sentiment, challenges, and opportunities around Python typing in the [...]\nRead More...\nThe post Python Typing Survey 2025: Code Quality and Flexibility As Top Reasons for Typing Adoption appeared first on Engineering at Meta.",
        "guid": "https://engineering.fb.com/?p=23483",
        "categories": [
          "Culture",
          "DevInfra"
        ],
        "isoDate": "2025-12-22T14:00:16.000Z"
      }
    ]
  },
  {
    "name": "eBay Tech Blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Twitter Blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Netflix TechBlog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "JetBrains: Developer Tools for Professionals and Teams – Company Blog | JetBrains",
    "category": "기업",
    "posts": [
      {
        "creator": "Dmitrii Korovin",
        "title": "TeamCity Pipelines Is Now Part of TeamCity Enterprise",
        "link": "https://blog.jetbrains.com/teamcity/2025/12/pipelines-sunset/",
        "pubDate": "Fri, 26 Dec 2025 16:19:46 +0000",
        "content:encodedSnippet": "We introduced TeamCity Pipelines in March 2024 to make CI/CD setup simpler and more intuitive, without limiting what teams can build and automate. Pipelines brought a new workflow focused on a more guided configuration experience, including a visual editor with drag-and-drop dependencies, YAML for defining building routines from scratch, and a set of practical configuration flows that reduce friction in day-to-day work.\nAfter the launch, we received a lot of positive feedback about the Pipelines UX and approach. At the same time, TeamCity Enterprise users repeatedly asked when this experience would become available in the main TeamCity product.\nBringing Pipelines to TeamCity Enterprise (EAP)\nIn July 2025, we introduced Pipelines to TeamCity Enterprise in version 2025.07 as part of an Early Access Program (EAP). The goal was to test how the Pipelines experience works on regular TeamCity servers, gauge real usage and interest, and give early adopters a way to start using Pipelines on their TeamCity Enterprise instances.\nAt that stage, the Pipelines support inside TeamCity Enterprise was intentionally not enabled by default and hidden from the main UI. We did this to avoid confusing users who expect the full breadth of TeamCity capabilities everywhere in the product.\nOne TeamCity product going forward\nIn December 2025, we made a product decision to unify TeamCity Pipelines and TeamCity Enterprise into a single TeamCity offering. A single product lets us focus our engineering and design efforts in one place, deliver improvements faster, and keep the experience consistent across TeamCity Cloud and TeamCity On-Premises.\nWhat to expect next:\nThe new Pipelines experience will be available alongside classic build configurations and build chains, so teams can use them both at the same time.\nWe’ll continue expanding Pipelines to support more of TeamCity’s advanced capabilities.\nWe’ll keep improving the TeamCity user experience. \nAs a result of this change, TeamCity Pipelines is no longer offered as a separate, standalone product. Going forward, the Pipelines experience will be delivered through TeamCity Enterprise, in both the Cloud and On-Premises versions.\nWhat about TeamCity Pipelines users?\nFor existing TeamCity Pipelines users, this change was handled as an upgrade to TeamCity Cloud Enterprise. Pipelines environments were kept intact and migrated to fall under the main TeamCity Cloud Enterprise experience. Existing subscriptions and pricing remained unchanged for those users as part of the transition. This migration was communicated separately and has already been completed.\nSo what does TeamCity look like now?\nThere is now one TeamCity platform. Sign up for TeamCity Cloud Enterprise to test the integrated Pipelines experience, alongside the rest of TeamCity’s CI/CD capabilities.\nIf you’re ready to give the Pipelines EAP a try in TeamCity On-Premises, you can head over to the sign-up page or click the Join Early Access Program link in the TeamCity UI. You’ll then be shown a transparent overview of current features, limitations, and our roadmap.",
        "dc:creator": "Dmitrii Korovin",
        "content": "We introduced TeamCity Pipelines in March 2024 to make CI/CD setup simpler and more intuitive, without limiting what teams can build and automate. Pipelines brought a new workflow focused on a more guided configuration experience, including a visual editor with drag-and-drop dependencies, YAML for defining building routines from scratch, and a set of practical configuration [&#8230;]",
        "contentSnippet": "We introduced TeamCity Pipelines in March 2024 to make CI/CD setup simpler and more intuitive, without limiting what teams can build and automate. Pipelines brought a new workflow focused on a more guided configuration experience, including a visual editor with drag-and-drop dependencies, YAML for defining building routines from scratch, and a set of practical configuration […]",
        "guid": "https://blog.jetbrains.com/?post_type=teamcity&p=671362",
        "categories": [
          "news",
          "teamcity-2",
          "update",
          "teamcity-pipelines-pulse"
        ],
        "isoDate": "2025-12-26T16:19:46.000Z"
      },
      {
        "creator": "Alexey Varfolomeev",
        "title": "Ruby Turns 30: A Celebration of Code, Community, and Creativity",
        "link": "https://blog.jetbrains.com/ruby/2025/12/ruby-turns-30-a-celebration-of-code-community-and-creativity/",
        "pubDate": "Thu, 25 Dec 2025 09:11:01 +0000",
        "content:encodedSnippet": "Created by Yukihiro “Matz” Matsumoto and first released in 1995, Ruby arrived with a purpose that was simple but profound: to make coding more human, more intuitive, and more enjoyable. Its object-oriented model, dynamic typing, and elegant syntax offered a fresh alternative to the heavier and more complex languages of that era.\nAs Ruby marks its 30th anniversary alongside the release of Ruby 4.0, we on the RubyMine team want to reflect on the path that led the language to where it is today and honor this remarkable milestone.\nThis year, with Ruby turning 30, we’re making RubyMine free for non-commercial use, helping nurture the next generation of Ruby developers and supporting a thriving community.\nClick here to try Ruby 4.0 in RubyMine for free.\nFrom revolutionary philosophy to thriving community\nSince its inception, Ruby has been more than a set of language constructs. Matz built it around the Principle of Least Surprise, so code would read naturally and behave as developers expect. Ruby’s “Everything is an object” model and its expressive method syntax made everyday tasks clearer, while metaprogramming enabled elegant, domain-specific abstractions. The vision for the language highlights readability and flexibility, showing that the way we write code is as important as the result.\nThis philosophy spread throughout the community, emphasizing practical, elegant solutions over hype and leading to the creation of valuable tools like:\nBundler, by Yehuda Katz and Carl Lerche, which enabled reliable team collaboration through dependency management. \nRSpec, initiated by Steven Baker and refined by David Chelimsky and others, which made behavior-driven testing natural to read and write. \nRuboCop, maintained by Bozhidar Batsov, which brought a shared foundation for code style and automated linting.\nTogether, these tools extended Ruby, which today is more than a language: It is a community, a set of conventions, and a mindset that values craftsmanship and expressive, maintainable code.\nThe path to modern excellence\nOver the years, Ruby has advanced to meet constantly increasing demands and evolving development paradigms. Here’s a closer look at the milestones that shaped the language.\nRuby 1.x (2003–2007)\nRuby 1.8 stabilized the language with mature libraries and solid object-oriented foundations, paving the way for early web frameworks like Rails. Ruby 1.9 introduced the YARV VM, improving speed, regex handling, and syntax. Upgrading to v1.9 cut web request times nearly in half, making Ruby practical for real applications.\nRuby 2.x (2013–2018)\nRuby 2.x boosted reliability and added features to help developers be more productive. Keyword arguments clarified method calls, refinements allowed safer class changes, and incremental GC improved performance. Enhanced libraries simplified tasks like JSON parsing and date handling, helping developers scale complex projects.\nRuby 3.x (2020–2023)\nRuby 3.x delivered on the long-promised vision of Ruby 3×3. Ractors enabled parallelism, JIT improved real-world performance, and RBS with TypeProf added static analysis and safer refactoring. The update reinforced Ruby’s readable, flexible, and productive coding philosophy.\nRuby 4.0 (2025)\nThe latest version comes with ZJIT, a method-based JIT compiler that redefines Ruby’s performance potential. It also introduces Ruby::Box, an experimental namespace-on-read mode, and notable Ractor improvements, such as Ractor::Port and safer shareable Proc objects.\nRuby’s global impact\nThe early 2000s brought a transformative moment with the release of Ruby on Rails. Created by David Heinemeier Hansson and released in 2004, Rails paired Ruby’s transparency and natural flow with a framework that emphasized convention over configuration, streamlined workflows, and rapid development. \nSuddenly, Ruby became the engine behind a new generation of web startups, proving that elegant design could coexist with productivity and scale.\nRuby’s influence quickly spread to platforms that reshaped the digital world. Here are some of the standout projects:\nGitHub, launched in 2008, relied on Rails and Ruby’s syntax to build a collaborative environment capable of handling millions of developers and repositories. \nShopify, which was created in 2006 and now boasts the title of the world’s biggest app powered by Ruby and Rails, scaled from a platform supporting small online shops to a global e-commerce powerhouse.\nAirbnb, founded in 2008, used Ruby to power dynamic booking systems, host management, and pricing algorithms, enabling the platform to expand worldwide. \nHomebrew, created by Max Howell in 2009 to simplify software installation and dependency management on macOS, was built using Ruby and serves millions of developers.\nToday, Ruby continues to be a popular choice for young startups, including Whop, a Gen‑Z marketplace, and Chime, a rapidly growing fintech company. Both of these projects leverage Ruby on Rails to build scalable and modern platforms, highlighting the framework’s enduring relevance.\nRefining the Ruby experience with RubyMine\nIntroduced by JetBrains in 2009, RubyMine was built as a dedicated IDE designed to bring the full expressive power of Ruby and Rails to developers. With deep code understanding for metaprogramming, smart navigation aligned with Rails conventions, robust testing framework support, and debugging tools, RubyMine enables developers to work efficiently while staying true to the spirit of the language.\nMore than just supporting the ecosystem, RubyMine actively helps shape it. As Ruby continues to evolve, introducing new syntax, technologies, libraries, and development approaches, RubyMine quickly adopts and supports these changes, providing developers with up-to-date, practical tooling from day one. \nBy delivering advanced static analysis, powerful refactoring tools, and a continuously updated understanding of the language, RubyMine contributes directly to Ruby’s ongoing popularity and relevance. Its design reflects Ruby itself; it’s powerful, ever-evolving, and built to make coding enjoyable. \nFinal words\nAs Ruby enters its fourth decade, we celebrate not only the language but also the people whose passion, creativity, and dedication have made it thrive. From mentors and contributors to conference organizers and Rails developers worldwide, this community embodies the spirit that keeps Ruby vibrant and evolving.\nThe RubyMine team is proud to pay tribute to both this inspiring language and the people who bring it to life.\nThe RubyMine team",
        "dc:creator": "Alexey Varfolomeev",
        "content": "Created by Yukihiro “Matz” Matsumoto and first released in 1995, Ruby arrived with a purpose that was simple but profound: to make coding more human, more intuitive, and more enjoyable. Its object-oriented model, dynamic typing, and elegant syntax offered a fresh alternative to the heavier and more complex languages of that era. As Ruby marks [&#8230;]",
        "contentSnippet": "Created by Yukihiro “Matz” Matsumoto and first released in 1995, Ruby arrived with a purpose that was simple but profound: to make coding more human, more intuitive, and more enjoyable. Its object-oriented model, dynamic typing, and elegant syntax offered a fresh alternative to the heavier and more complex languages of that era. As Ruby marks […]",
        "guid": "https://blog.jetbrains.com/?post_type=ruby&p=670121",
        "categories": [
          "rubymine",
          "ruby",
          "ruby-on-rails"
        ],
        "isoDate": "2025-12-25T09:11:01.000Z"
      },
      {
        "creator": "Tatiana Parshutkina",
        "title": "Everything You Wanted to Ask About Rust – Answered by Herbert Wolverson",
        "link": "https://blog.jetbrains.com/rust/2025/12/23/everything-you-wanted-to-ask-about-rust-answered-by-herbert-wolverson/",
        "pubDate": "Tue, 23 Dec 2025 18:36:37 +0000",
        "content:encodedSnippet": "Disclaimer: This article was created using AI-based writing and communication companions. With its help, the core topics of this rich and nuanced livestream were conveniently distilled into a compact blog post format.\nIn our recent JetBrains livestream, Vitaly Bragilevsky sat down with Rust expert and educator Herbert Wolverson (Ardan Labs) to talk about everything Rust developers – beginners and pros alike – are curious about. From ownership and lifetimes to salaries and async programming, here’s a recap of the best questions and insights. Watch the full livestream replay on JetBrains TV and check out the GitHub repo with Herbert’s prepared answers and code samples. Below is a short summary of the 23 questions that were covered during the livestream.\n\n\n\n\n\n\nQ1. What’s your new book about?\nMy latest book is Advanced Hands-On Rust, a follow-up to Hands-On Rust. The first book guided readers from beginner to early intermediate level, while the new one takes you further into advanced topics like generics, macros, and library design. You can find it on Amazon, Barnes & Noble, or directly from the publisher’s website for an eBook version.\n“I felt like the first book got you to the end of beginner level and then stopped a little too early. This one takes you through intermediate and early advanced topics.”\n\n            \nQ2. What’s the biggest mindset shift when moving to Rust from C++, Java, or C#?\nThe biggest difference is thinking about memory. In Java or C#, the runtime handles garbage collection for you. In Rust, you explicitly manage memory – but safely. It’s closer to C++ in that sense, yet Rust prevents entire classes of bugs like data races or use-after-free.\nRust’s ownership model and smart pointers (like Box, similar to C++’s unique_ptr) give you precise control without a garbage collector. It’s a language built to make it impossible to shoot yourself in the foot in the usual ways.\n“If you’re coming from Java or C#, memory sounds terrifying. You expect something horrific. But you can go days in Rust without explicitly managing memory.”\n\n            \nQ3. Is Rust really that hard to learn?\nIt used to be! Early Rust looked terrifying, full of strange symbols and lifetimes everywhere. Today, the syntax and ecosystem are much friendlier. You can build practical apps — like a small web server — without worrying about memory management at all. The learning curve still exists, but it’s much smoother thanks to improved libraries and tooling.\n“I like to teach people so that by the end of day one, they’ve already built something useful.”\n\n            \nQ4. Should I learn C first or go straight to Rust?\nYou can start with Rust directly. C is lower-level, but Rust can be used at various abstraction levels. Long term, it’s best to learn multiple languages — not for competition, but for perspective.\n“The most important thing isn’t the language — it’s that you actually learn something and build something.”\n\n            \nQ5. Will Rust gain widespread adoption soon?\nIt already is. The Linux kernel now officially includes Rust, which is a major milestone. I’m training more teams in defense, aerospace, finance, and automotive. Rust’s adoption is expanding rapidly.\n“Linux ended their Rust experiment by saying: Rust is in the kernel now. Rust is going to be around forever. I fully expect to retire and still be called back to fix Rust code.”\n\n            \nQ6. How should beginners approach learning Rust?\nA: Choose a learning style that fits you:\nBooks: Hands-On Rust, Rust in Action, Programming Rust.\nOnline Resources: The official Rust Book and Rust by Example (free on the Rust website).\nProjects: Build something small and fun — games, scripts, or web services.\nRust gives you multiple paths, so experiment and learn by doing.\n“Some people learn from books, some from videos, some by just banging their head against the wall until it works.”\n\n            \n\nQ7. What are ownership and borrowing in Rust?\nThink of it like lending your car:\nIf I move my car to you, it’s now yours — you can destroy it.\nIf I borrow it, you use it but must return it.\nThis system prevents two parts of the program from destroying the same data or accessing it unsafely. It eliminates entire classes of memory errors common in C and C++.\n“Rust makes it impossible for some other part of the program to destroy the car without either of us knowing.”\n\n            \nQ8. What does “zero-cost abstractions” mean?\nIt means you don’t pay a runtime cost for nice language features. Rust’s abstractions (like iterators, traits, and lifetimes) are compiled away — they help you write safer, clearer code without adding runtime overhead. What you write is as efficient as hand-optimized C code.\nQ9. Should I use iterators or loops?\nUse whichever you find clearer. Iterators are powerful and expressive, especially with libraries like rayon for parallelism. But if a simple for loop is more readable for you, that’s fine too. Performance is usually identical.\n“Sometimes I write iterators. Sometimes I write loops. Either is fine.”\n\n            \nQ10. Can Rust be part of polyglot systems?\nAbsolutely. Rust integrates well with other languages using FFI (Foreign Function Interface). You can, for example, link Rust with C#, Python, or even databases like LanceDB. Use Rust where performance and memory safety matter most.\n“You don’t have to throw the baby out with the bathwater. You can mix Rust with C#, Java, or whatever you already have.”\n\n            \nQ11. Which book should beginners start with — Hands-On Rust or Advanced Hands-On Rust?\nStart with Hands-On Rust. It introduces concepts through game development examples. Once you’re comfortable, move on to Advanced Hands-On Rust for deeper topics like generics and macros.\nQ12. How quickly should I learn async code?\nLearn synchronous Rust first. Async Rust adds complexity under the hood — every async fn becomes a state machine. Once you’re comfortable with ownership and borrowing, move to async with frameworks like Tokio.\nQ13. Why are there no exceptions in Rust?\nRust uses Result and Option types instead of try/catch. This forces you to handle potential errors explicitly rather than ignoring them. It’s a safer and clearer model. There’s talk about adding a throw keyword, but it’s unlikely to change this core philosophy.\n“Rust wanted to make it harder to not check errors. With [Result], you at least have to acknowledge that something might have gone wrong.”\n\n            \nQ14. Why both Result and Option?\nBecause they express different ideas:\nOption = something might be missing (e.g. user not found).\nResult = something went wrong (e.g. database error). Sometimes you even see Result<Option<T>, E> — perfectly fine.\n“They’re signaling intent. That’s why they’re different.”\n\n            \nQ15. Which external crates should I learn first?\nserde – for serialization/deserialization (JSON, YAML, etc.)\ncolored – for simple CLI output formatting\nThese crates are practical and teach how macros and traits work in real use.\n“Serde is one of the crates that really got me into Rust. You add one derive and suddenly everything just works.”\n\n            \nQ16. Structs, enums, traits — when to use which?\nStructs: group related data, like classes or records.\nEnums: define a fixed set of possibilities, each possibly carrying data.\nTraits: define shared behavior (like interfaces in other languages).\nTogether, they form Rust’s type and abstraction system.\n“Enums in Rust are much more powerful than in most languages — they can carry data and work beautifully with pattern matching.”\n\n            \nQ17. What’s pattern matching and why is it important?\nRust is strongly type-driven and pattern matching is central to Rust. It’s how you unpack Result, Option, or enum types safely. The match keyword ensures you handle all cases — the compiler even warns if you miss one. It’s similar to functional languages like Haskell or OCaml.\nQ18. How to understand lifetimes easily?\nLifetimes track how long data lives to prevent dangling references. The compiler does most of the work now. If you need to write lifetime annotations manually, it’s often a sign your code is too complex. Tools like RustRover’s lifetime visualizer can help you understand them better.\n“If I have to write a lifetime annotation, I start wondering if I made something too complicated.”\n\n            \nTry RustRover\n                                                    \nQ19. When to use references vs. smart pointers (Box, Rc, Arc)?\nReferences (&): temporary, non-owning access.\nBox: store large data on the heap.\nRc / Arc: reference-counted pointers for shared ownership (single- or multi-threaded).\nThey’re ways to balance ownership, safety, and performance.\n“Ownership is about who owns the data. References are about who’s allowed to look at it.”\n\n            \nQ20. Why is immutability the default in Rust?\nRust defaults to immutable variables to prevent accidental mutation — a common source of bugs. You can make variables mutable with mut when needed. It’s about safety and clarity, not restriction.\n“It stops me from shooting myself in the foot by changing a variable somewhere deep in a function.”\n\n            \nQ21. How should I organize Rust projects?\nGroup related code into modules. Use mod.rs or mod files to define structure and expose only what’s needed with pub. Larger projects can be organized into workspaces. Think of modules as logical boundaries, not just files.\nQ22. What are macros and when should beginners use them?\nMacros generate code at compile time — for example, println! is a macro.\nThey come in two kinds: declarative (macro_rules!) and procedural (derive, proc_macro). Use them when you need repetitive boilerplate or metaprogramming, but sparingly – they can make code harder to read and harder for IDEs to analyze.\n“You can do amazing things with macros. You can also do terrible things. But don’t.”\n\n            \nQ23. Will Rust ever “rust”?\nHopefully not! But like all languages, it will evolve. The team is good at deprecating old features gracefully, so the language should age well.\n“Every language ages. Rust just makes it easier to get rid of old ideas than most.”\n\n            \nRust’s learning curve is real, but its ecosystem, documentation, and community make the journey smoother than ever.",
        "dc:creator": "Tatiana Parshutkina",
        "content": "Disclaimer: This article was created using AI-based writing and communication companions. With its help, the core topics of this rich and nuanced livestream were conveniently distilled into a compact blog post format. In our recent JetBrains livestream, Vitaly Bragilevsky sat down with Rust expert and educator Herbert Wolverson (Ardan Labs) to talk about everything Rust [&#8230;]",
        "contentSnippet": "Disclaimer: This article was created using AI-based writing and communication companions. With its help, the core topics of this rich and nuanced livestream were conveniently distilled into a compact blog post format. In our recent JetBrains livestream, Vitaly Bragilevsky sat down with Rust expert and educator Herbert Wolverson (Ardan Labs) to talk about everything Rust […]",
        "guid": "https://blog.jetbrains.com/?post_type=rust&p=670723",
        "categories": [
          "rustrover",
          "livestream"
        ],
        "isoDate": "2025-12-23T18:36:37.000Z"
      },
      {
        "creator": "Igor Kulakov",
        "title": "Thread Dumps and Project Loom (Virtual Threads)",
        "link": "https://blog.jetbrains.com/idea/2025/12/thread-dumps-and-project-loom-virtual-threads/",
        "pubDate": "Tue, 23 Dec 2025 14:14:55 +0000",
        "content:encodedSnippet": "If you’ve been \tkeeping up with Java virtual threads, you already know that this hot new feature significantly improves hardware utilization for parallel I/O-bound operations. Virtual threads map multiple concurrent I/O operations to a single OS thread without blocking. The novel aspect of this approach is that it requires minimal changes to the codebase, as it provides a lightweight concurrency primitive that is compatible with the existing APIs.\nThis is, of course, great news for Java developers. Previously, achieving similar results meant writing complex callback-based pipelines or relying on reactive Java frameworks that were far from simple.\nAside from a few minor details, Java virtual threads really are as great as they sound. The API is simple and familiar, with throughput increasing by up to a few orders of magnitude. Where servers once managed only a few hundred threads, they can now handle millions.\nSo what does this mean for the rest of the ecosystem?\n\nThe state of tooling\nVirtual threads pose quite the challenge to existing Java tooling. Your UI-based thread dump viewer or debugger may now present you with millions of rows, and simply displaying them can be a struggle. And even if it succeeds, there is still a UX issue. How is the user supposed to navigate all that information?\nOr take, for example, a classic async debugging problem: Scheduler and worker code are typically called in different threads, rendering the worker’s stack trace logically incomplete. Since a task starts in one thread and fails in another, the error’s stack trace misses the path that schedules the task. And that path might be important for understanding the cause of the problem.\nAlthough the Java ecosystem has been doing a good job adapting to  change, some gaps remain. Each challenge is multifaceted and could warrant a post of its own. In the rest of this article, we’ll dive deeper into one of these challenges: thread dumps and how to use them effectively.\nThread dumps\nSpeaking of tooling and concurrency, the first thing that comes to mind is thread dumps!\nA deadlock? An unresponsive UI? Thread explosion or leak? When investigating any of these issues, a thread dump is usually the starting point. Simple yet powerful, thread dumps are one of the best tools for diagnosing multithreading problems. In the best-case scenario, thread dumps will pinpoint exactly where the problem lies. At the very least, they’ll give you an idea of where to start your investigation.\nA thread dump tool captures the state of the application at a given moment and produces a structured text report on every thread in the application. You can view the report as text or use a specialized thread dump viewer, like the one in IntelliJ IDEA:\n\nThere are several tools that can capture and view thread dumps. Despite some variance in format and scope, thread dumps produced by different tools generally appear similar.\nHere’s an example of how a thread is described in a thread dump:\n\"main\" prio=5 tid=0x000001f3c9d13000 nid=NA runnable\n  java.lang.Thread.State: RUNNABLE\n    at java.net.SocketInputStream.socketRead0(Native Method)\n    at java.net.SocketInputStream.socketRead(SocketInputStream.java:116)\n    at java.net.SocketInputStream.read(SocketInputStream.java:171)\n    at java.net.SocketInputStream.read(SocketInputStream.java:141)\n    at sun.nio.cs.StreamDecoder.readBytes(StreamDecoder.java:284)\n      - locked  (a java.io.InputStreamReader)\n    at sun.nio.cs.StreamDecoder.implRead(StreamDecoder.java:326)\n    at sun.nio.cs.StreamDecoder.read(StreamDecoder.java:178)\nA thread dump includes the threads’ stack traces, metadata, status, and the related locks.\nVirtual thread dumps\nSince virtual threads work differently under the hood, they require dedicated support. In addition to IntelliJ IDEA, common tools for capturing virtual threads include jcmd and jstack. As mentioned above, regular thread dump tools vary in terms of format and the level of information they provide. Your preference for one tool over another may be based on your specific use case.\nThe Netflix story\nTo make this more concrete, let’s look at an example from Netflix. For those who missed this post, we highly recommend reading it. It’s a captivating technical deep dive from engineers doing impressive things in Java, and it’s also relevant for our discussion here.\nIn short, after upgrading to virtual threads, Netflix engineers discovered an issue where some endpoints stopped serving traffic even though the JVM was still running. To get a better idea of what was going on, the team analyzed locks using a heap dump (!) and reverse-engineered Java concurrency classes. This investigation revealed a deadlock related to a limitation in virtual threads. This bug was later fixed in Java 25.\nClever though their methods may have been, it’s hard to deny that a thread dump with more comprehensive information would have made the investigation much easier.\nGetting lock information for virtual threads\nIf you use IntelliJ IDEA, you’re in luck! The IntelliJ IDEA team prioritizes new Java releases, so whenever Java adds a shiny new feature, you can rest assured that the IDE will support it from the get-go. Later in this post, we’ll discuss the capabilities of IntelliJ IDEA’s thread dump tool, but for now, let’s stick to the problem.\nUsing the gist provided in the original article, we can set a breakpoint at the line that catches the deadlock and run the reproducer while debugging:\n\nWe use a breakpoint here because the gist would otherwise finish too quickly for us to capture a thread dump in time. In real-world applications, you can capture a thread dump at any moment without suspending the program. To do this, go to More | Get thread dump on the Debug tab for the target app.\nIntelliJ IDEA opens the thread dump, indicates thread statuses, groups similar threads, folds stack traces, and provides navigation back to the source code. Selecting a waiting virtual thread shows the same information as for a platform thread, including details about the acquired locks:\n\nIn this simplified example, the virtual threads synchronize on a new Object(), so finding this specific lock isn’t particularly useful. Still, the information is there – and invaluable when diagnosing real-world problems.\nSupported targets\nIntelliJ IDEA can attach to any Java or Kotlin process, whether local or remote.\nThread dumps don’t have to come from IntelliJ IDEA at all. If someone provides a dump generated with another tool, such as jcmd, IntelliJ IDEA can open and analyze it just as easily as its own native dumps. We constantly monitor the planned changes throughout the ecosystem, so you can count on support for both the earlier and recent versions.\nAnd as a bonus for Kotlin users: IntelliJ IDEA supports not only virtual threads, but Kotlin coroutines as well!\nSummary\nJava is ramping things up and bringing modern features into the domain of concurrent computations – and this is just the beginning. Structured concurrency, a paradigm shift in how Java developers reason about concurrency, is just around the corner. We’re in this together, vendors and users alike.\nWe encourage you to give thread dumps a try in IntelliJ IDEA – you’ll find that this post was only the tip of the iceberg. And our documentation is always worth a look. For feedback and feature requests, we invite you to check out the comments section or our issue tracker.\nLet us know what you think!",
        "dc:creator": "Igor Kulakov",
        "content": "If you’ve been keeping up with Java virtual threads, you already know that this hot new feature significantly improves hardware utilization for parallel I/O-bound operations. Virtual threads map multiple concurrent I/O operations to a single OS thread without blocking. The novel aspect of this approach is that it requires minimal changes to the codebase, as [&#8230;]",
        "contentSnippet": "If you’ve been keeping up with Java virtual threads, you already know that this hot new feature significantly improves hardware utilization for parallel I/O-bound operations. Virtual threads map multiple concurrent I/O operations to a single OS thread without blocking. The novel aspect of this approach is that it requires minimal changes to the codebase, as […]",
        "guid": "https://blog.jetbrains.com/?post_type=idea&p=670275",
        "categories": [
          "features",
          "idea",
          "debug",
          "thread-dumps",
          "virtual-threads"
        ],
        "isoDate": "2025-12-23T14:14:55.000Z"
      },
      {
        "creator": "Tatiana Parshutkina",
        "title": "Advent of Code in Rust: Winners and Highlights",
        "link": "https://blog.jetbrains.com/rust/2025/12/22/advent-of-code-in-rust-winners-and-highlights/",
        "pubDate": "Mon, 22 Dec 2025 19:29:11 +0000",
        "content:encodedSnippet": "Thank you to everyone who joined Advent of Code 2025 in Rust! It was inspiring to see many Rustaceans solving algorithmic puzzles, and celebrating the holiday coding season with the community.\nBefore the Advent began, Vitaly Bragilevsky published a blog post on how to use AI in Advent of Code challenge responsibly and effectively. This year’s AoC featured 12 puzzles, and from December 1–12, we celebrated by posting daily RustRover features in our RustRover Advent Calendar – a small gift for the community and a way to highlight tools that make your Rust experience even better.\nAnd the winners are… \nWe invited you to take on the AoC puzzles using Rust, join our leaderboards, and compete for top scores and random prizes. Now, it’s time to congratulate our 10 winners who stood out among all participants.\nLet’s give a big round of applause to the top five Rust developers who dominated the combined leaderboards with impressive results out of 71 participants:\nDuro – 2017 (for the second year in a row, as in 2024!)\nJohnX4321 – 1996\nMaRcR11 – 1961\nGiacomo Stevanato – 1910\nAgnibha Chakraborty – 1885\nAdditionally, here are five participants were randomly selected as prize winners:\nbragrseg – 576\nViincentLim – 1585\nN. Adhikary – 813\nGunter Schmidt – 435\nSaurav Kumar – 676\n\n\n\n\nWe reached out to the winners who had social media contact information listed on their GitHub profiles. If you didn’t include contact details, please reach out to rustrover-support@jetbrains.com, and we’ll be happy to send you your prize. Congratulations to all our winners and to everyone who took part! \nKeep learning and building in Rust\nThe Advent of Code puzzles are available year-round, so get ready for the next AoC by exploring resources to strengthen your Rust skills:\nSolving Advent of Code in Rust, With Just Enough AI\nRustRover Advent Calendar\nRust AoC Template on GitHub\n\nA huge thank-you to Eric Wastl and the Advent of Code team for creating such an inspiring tradition. Let’s keep learning, building, and having fun with Rust and see you next year for another round of AoC!",
        "dc:creator": "Tatiana Parshutkina",
        "content": "Thank you to everyone who joined Advent of Code 2025 in Rust! It was inspiring to see many Rustaceans solving algorithmic puzzles, and celebrating the holiday coding season with the community. Before the Advent began, Vitaly Bragilevsky published a blog post on how to use AI in Advent of Code challenge responsibly and effectively. This [&#8230;]",
        "contentSnippet": "Thank you to everyone who joined Advent of Code 2025 in Rust! It was inspiring to see many Rustaceans solving algorithmic puzzles, and celebrating the holiday coding season with the community. Before the Advent began, Vitaly Bragilevsky published a blog post on how to use AI in Advent of Code challenge responsibly and effectively. This […]",
        "guid": "https://blog.jetbrains.com/?post_type=rust&p=670568",
        "categories": [
          "rustrover",
          "advent-of-code",
          "rust"
        ],
        "isoDate": "2025-12-22T19:29:11.000Z"
      }
    ]
  },
  {
    "name": "Airbnb Engineering & Data Science",
    "category": "기업",
    "posts": []
  },
  {
    "name": "PayPal Engineering",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Visual Studio Blog",
    "category": "기업",
    "posts": [
      {
        "creator": "Mads Kristensen",
        "title": "How AI fixed my procrastination",
        "link": "https://devblogs.microsoft.com/visualstudio/how-ai-fixed-my-procrastination/",
        "pubDate": "Mon, 22 Dec 2025 15:00:38 +0000",
        "content:encodedSnippet": "I struggled to get started. For ages, I kept putting off building this website, creating a new programming language for Visual Studio, and coming up with fresh color themes. Each project looked overwhelming, and I couldn’t find the time or motivation to jump in. It all just felt like too much at once.\nBut when a national holiday gave me a long weekend, I grabbed the chance to try out Copilot in Visual Studio and see how far I could get. To my surprise, I knocked out all three projects way faster and more easily than I expected. I’m sharing what I learned because I hope it inspires you to finally tackle those projects you’ve been putting off.\nIf you have some free time at the end of 2025, it might be the perfect opportunity to finally kickstart those ideas you’ve been meaning to work on.\nLet’s jump into how I kicked off the web development project.\nProject 1 – a static website\nA few years ago, I wrote a book called The Automated Home with little success. I wrote it mostly for myself and to help other smart home geeks come up with ideas and recipes for their own automations. A book isn’t a good format for that, so I’ve been wanting to turn it into a website for a long time.\nI exported the book from .docx to .txt so that I could feed it to Copilot in Visual Studio. Then I created an empty folder to hold the static website and opened it using File -> Open Folder.\nAnd then I went to the chat window and wrote a prompt to Copilot that went like this: “Turn this book into a website that should function like a book of recipes for home automation”.\nIt chewed on that for a while and a static website was slowly taking shape in front of my eyes. One file at a time added to Solution Explorer and opened in the editor.\nThe first result was pretty good. It had most of the content right, but the design, menu system, and content organization was suboptimal. My background as a web developer came in handy, because I knew what I wanted and how I wanted it. So, I started to be a lot more specific in my prompting and telling it how I wanted the CSS to look like etc.\nThe Home Automation Cookbook website\nThe AI was able to create this website in much less time than I would have been able to manually. Probably around 5x faster. I didn’t write much myself but would prompt the AI whenever I wanted a change. Only for small things would I do the coding manually.\nThe workflow was amazing, but it did involve quite a bit of waiting for Copilot to finish its tasks. That turned out great, because I was able to spend time with the family and make progress on the website at the same time.\nCheck it out at https://www.homeautomationcookbook.com\nProject 2 – a TOON language service\nI write Visual Studio extensions a lot, and this one has made it to the top of my to-do list. Mainly because of the challenge of creating a language parser and tokenizer that would work as a Visual Studio language service. TOON is a simple language, but even so, a language service requires some unique features I couldn’t find in any of the current TOON implementations in C#.\nThe TOON language inside Visual Studio\nTo provide syntax highlighting, syntax validation (squiggles), and other features, a language parser must be very fault tolerant. If you make a syntax error on line 10, you don’t want the rest of the file to lose syntax highlighting or be riddled with syntax violation errors. Most language parsers will simply throw an error if they see a syntax error and stop parsing completely.\nMy plan was to point the GitHub cloud agent to the TOON language specification and have it create the parser and based on that. I also wanted it to create unit tests based on the specification to validate the implementation was correct.\nI created a new .NET 10 Class Library project in Visual Studio 2026 and opened the Copilot chat window. The prompt I gave Copilot was something like “Based on the TOON specification (<url to spec>), create a parser and tokenizer that is suitable for use in a Visual Studio language service”.\nThe Copilot prompt for creating a TOON language parser showing the new Cloud Agent button\nOnce I clicked the Cloud Agent button to feed it my prompt, Visual Studio starts gathering the information it needs to come up with a plan. Once it does, it creates an issue on the GitHub repository with the information and then assigns GitHub’s cloud agent to the task.\nIn about 20 minutes, I received a pull request with the initial implementation by the cloud agent. It was a good first try, but more work was needed to make it work the way I wanted. I used a mix of both regular agent mode and the cloud agent to make further improvements.\nOver 600 tests created to validate the parser against the official TOON language specification\nI found that the cloud agent was most helpful when it came to isolated tasks. I could simply prompt it to begin the work in the background, while I did other work in Visual Studio. That way I had two workstreams going on in parallel and I could make headway fast.\nOnce complete, I asked the agent to make the class library into a NuGet package and set up automated CI/CD using GitHub Actions. I published the Toon Tokenizer package shortly thereafter and could now start working on the Visual Studio extension.\nThis is my wheelhouse. And once I created a new extension project, I could simply add the NuGet package and go to town. I did this part manually because I really enjoy extension development, so I wanted to do all the driving.\nThis was a super fun project, and I got to play around with the Profiler Agent to fine tune the parser performance. I also asked the agent to help find any security issues and mitigate them. It was able to find and fix some potential risks. Overall, a fantastic experience that turned out so much better than I could imagine. This was another 5-10x time saver thanks to Copilot.\nCheck out the Toon extension and parser repository.\nProject 3 – new color themes\nI’ve wanted to make some new color themes for Visual Studio for a long time. But it’s a type of extension I don’t have much experience with, so I wasn’t sure about how much effort would be required. Often, the unknown amount of time and effort is what makes me procrastinate on projects.\nTo kick this one off, I decided to use my old Blue Steel theme extension as the base. I wanted to create two solarized themes. The real challenge with this one was to map the color tokens with the right color codes. All I had was screenshots of the themes from the Solarized web page.\nIt looks like this:\nSolarized color theme from the official web page\nWith the screenshots, I asked Copilot to extract the color tokens for both the shell/environment and the code syntax colors and map them to the right color tokens in the VS XML theme file.\nThose XML files contain a bunch of categories with color tokens in each.\n<Category Name=\"Shell\" GUID=\"{73708ded-2d56-4aad-b8eb-73b20d3f4bff}\">\r\n     <Color Name=\"AccentFillDefault\">\r\n             <Background Type=\"CT_RAW\" Source=\"FF6C71C4\" />\r\n     </Color>\r\n     <Color Name=\"AccentFillSecondary\">\r\n             <Background Type=\"CT_RAW\" Source=\"E56C71C4\" />\r\n     </Color>\r\n     <Color Name=\"AccentFillTertiary\">\r\n             <Background Type=\"CT_RAW\" Source=\"CC6C71C4\" />\r\n     </Color>\r\n     <Color Name=\"SolidBackgroundFillTertiary\">\r\n             <Background Type=\"CT_RAW\" Source=\"FFEEE8D5\" />\r\n     </Color>\r\n     <Color Name=\"SolidBackgroundFillQuaternary\">\r\n             <Background Type=\"CT_RAW\" Source=\"FFEEE8D5\" />\r\n     </Color>\r\n     <Color Name=\"SurfaceBackgroundFillDefault\">\r\n             <Background Type=\"CT_RAW\" Source=\"FFFDF6E3\" />\r\n     </Color>\r\n     <Color Name=\"TextFillSecondary\">\r\n             <Background Type=\"CT_RAW\" Source=\"FF000000\" />\r\n     </Color>\r\n</Category>\nCopilot did a fantastic job, but I had to play around with the colors a bit. There was still a bunch of manual finessing needed. But it gave me a jump start that saved me a lot of time.\nI ended up adding 6 new color themes to the Blue Steel extension.\nThe Solarized Dark color theme for Visual Studio 2026\nIf you’re interested in creating your own color theme(s) for Visual Studio, I suggest you clone the GitHub repo to get started. Make sure to change the GUID in both the .vstheme files and in the .vsixmanifest file to avoid conflicting with the original.\nIn conclusion\nIf Copilot hadn’t given me a running start, I probably wouldn’t have even started these projects. It would’ve been way more work. And honestly, it is not nearly as fun or satisfying. Seeing things come together quickly is super motivating and really helps keep you going until you finish.\nAgentic development was awesome for a lot of the work that went into these projects, but there were times I just wanted to do things the old-school way. Sometimes I just enjoy doing certain tasks myself, or it’s simply quicker to make some tweaks by hand.\nIn any event, these were fun to do. And I finally shipped what I’ve been wanting to do for so long.\nThe post How AI fixed my procrastination appeared first on Visual Studio Blog.",
        "dc:creator": "Mads Kristensen",
        "comments": "https://devblogs.microsoft.com/visualstudio/how-ai-fixed-my-procrastination/#comments",
        "content": "<p>I struggled to get started. For ages, I kept putting off building this website, creating a new programming language for Visual Studio, and coming up with fresh color themes. Each project looked overwhelming, and I couldn’t find the time or motivation to jump in. It all just felt like too much at once. But when [&#8230;]</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/visualstudio/how-ai-fixed-my-procrastination/\">How AI fixed my procrastination</a> appeared first on <a href=\"https://devblogs.microsoft.com/visualstudio\">Visual Studio Blog</a>.</p>\n",
        "contentSnippet": "I struggled to get started. For ages, I kept putting off building this website, creating a new programming language for Visual Studio, and coming up with fresh color themes. Each project looked overwhelming, and I couldn’t find the time or motivation to jump in. It all just felt like too much at once. But when […]\nThe post How AI fixed my procrastination appeared first on Visual Studio Blog.",
        "guid": "https://devblogs.microsoft.com/visualstudio/?p=255244",
        "categories": [
          "Artificial Intelligence",
          "Copilot",
          "Visual Studio",
          "Agent Mode",
          "AI Agents"
        ],
        "isoDate": "2025-12-22T15:00:38.000Z"
      }
    ]
  },
  {
    "name": "Joshua",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권재명",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김석기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김선영",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강대명",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권정혁",
    "category": "개인",
    "posts": []
  },
  {
    "name": "줌구",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김수보",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김시은",
    "category": "개인",
    "posts": []
  },
  {
    "name": "곽민수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김범진",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민서",
    "category": "개인",
    "posts": []
  },
  {
    "name": "I am not Okay",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권창현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권기호",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김수민",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강태욱",
    "category": "개인",
    "posts": [
      {
        "title": "kaggle 설치 및 사용방법",
        "link": "http://daddynkidsmakers.blogspot.com/2025/12/kaggle.html",
        "pubDate": "2025-12-25T10:54:00.000Z",
        "author": "Daddy Maker",
        "content": "<p>kaggle 은 윈도우버전과 호환성이 낮다. 우분투에서는 잘 실행된다.&nbsp;</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhYR1_IMN8THtaL8Cxzux0iRh7QLwlvMYHiuwrUkl7crC1mJKWEHbEQCYiRDRtHUHeBzCOTZ09CBtZf2kJ1X-lkTcc40NNZE7sDMdPpCeIVhqlEXUG99OtRq-H_NYvkubWgeGE6oJfl1E8VXfiEeXC5MaCDp7m7gTcoL59Oq6keu3ZGWR8bfRnn9A0tNd43\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"588\" data-original-width=\"482\" height=\"240\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhYR1_IMN8THtaL8Cxzux0iRh7QLwlvMYHiuwrUkl7crC1mJKWEHbEQCYiRDRtHUHeBzCOTZ09CBtZf2kJ1X-lkTcc40NNZE7sDMdPpCeIVhqlEXUG99OtRq-H_NYvkubWgeGE6oJfl1E8VXfiEeXC5MaCDp7m7gTcoL59Oq6keu3ZGWR8bfRnn9A0tNd43\" width=\"197\" /></a></div><br /><p></p><p>다음과 같은 순서로 설치하면 된다.&nbsp;</p><p style=\"text-align: left;\">1. kaggle 웹사이트 방문 후 가입한다.</p><p style=\"text-align: left;\">2. kaggle &gt; account &gt; setting &gt; new API key 로 키값을 얻는다. 여기서 브라우저 설정에 따라 kaggle.json이 다운안되는 경우가 많다. 이 경우 다음과 같이 이 파일을 직접 작성해야 한다.</p><p style=\"text-align: left;\"></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEhArrdYhs4Z1giXnpXrVPHMot0llwNkgYoeJaZHSFwuMPFFaCxcA3SxU6eq3oMqBR8JecQXuadVEgdh0WJ4whEsu3SG8I7vtzSjvlX0UyPCey57j85MWH9p4-bV78eGNecFvwuvfWHGfYnMZSk8r2lg8gu0h-YXcefZnPkH4PeCHFyC7uE2Y_a8hybdTo37\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"1406\" data-original-width=\"2510\" height=\"224\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEhArrdYhs4Z1giXnpXrVPHMot0llwNkgYoeJaZHSFwuMPFFaCxcA3SxU6eq3oMqBR8JecQXuadVEgdh0WJ4whEsu3SG8I7vtzSjvlX0UyPCey57j85MWH9p4-bV78eGNecFvwuvfWHGfYnMZSk8r2lg8gu0h-YXcefZnPkH4PeCHFyC7uE2Y_a8hybdTo37=w400-h224\" width=\"400\" /></a></div><p></p><p>이 파일은 다음 명령으로 생성할 수 있다. 터미널에 입력한다.&nbsp;</p><p>mkdir -p ~/.kaggle</p><p>echo '{\"username\":\"&lt;user name&gt;\",\"key\":\"&lt;your key&gt;\"}' &gt; ~/.kaggle/kaggle.json</p><p>chmod 600 ~/.kaggle/kaggle.json</p><p>그 결과 다음 형식의 파일이 생성될 것이다.</p><p>{\"username\":\"\",\"key\":\"\"}</p><p>3. 터미널에서 kaggle 을 설치한다. pip install kaggle</p><p>4. 다음과 같이 경진대회 리스트 실행해 본다.&nbsp;</p><p>실행 결과는 다음과 같다.</p><p>venv_lmm) ktw@tron:~$ kaggle competitions list</p><p>ref&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;deadline&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;category&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; reward&nbsp; teamCount&nbsp; userHasEntered&nbsp;&nbsp;</p><p>https://www.kaggle.com/competitions/ai-mathematical-olympiad-progress-prize-3&nbsp; &nbsp; &nbsp; &nbsp;2026-04-15 23:59:00&nbsp; Featured&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2,207,152 Usd&nbsp; &nbsp; &nbsp; &nbsp; 976&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;False&nbsp;&nbsp;</p><p>https://www.kaggle.com/competitions/vesuvius-challenge-surface-detection&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 2026-02-13 23:59:00&nbsp; Research&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;200,000 Usd&nbsp; &nbsp; &nbsp; &nbsp; 446&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;False&nbsp;&nbsp;</p><p>https://www.kaggle.com/competitions/google-tunix-hackathon&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 2026-01-12 23:59:00&nbsp; Featured&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;100,000 Usd&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;97&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;False&nbsp;&nbsp;</p><p>https://www.kaggle.com/competitions/csiro-biomass&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2026-01-28 23:59:00&nbsp; Research&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 75,000 Usd&nbsp; &nbsp; &nbsp; &nbsp;2494&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;False&nbsp;&nbsp;</p><p>https://www.kaggle.com/competitions/recodai-luc-scientific-image-forgery-detection&nbsp; 2026-01-15 23:59:00&nbsp; Research&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 55,000 Usd&nbsp; &nbsp; &nbsp; &nbsp;1029&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;False&nbsp;&nbsp;</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/a/AVvXsEh_7VDQFz9LUFGgU3sflLj0yW3MWQJwcSaPdGW1s36HZE4-AMtzSXMpIAU64Hd1GPLc0ZsnGIh--XntTi5CEGONDvpavnKdqs846IFpYl2lZJoRKMgqVoKZeGDeLOyLg17TgqWVKG9nwXUdqkDkdTCdGIxs_Ses8wuMwPxvJ1ZxIG7JhvPJODDOvdxsKPrl\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"722\" data-original-width=\"1111\" height=\"260\" src=\"https://blogger.googleusercontent.com/img/a/AVvXsEh_7VDQFz9LUFGgU3sflLj0yW3MWQJwcSaPdGW1s36HZE4-AMtzSXMpIAU64Hd1GPLc0ZsnGIh--XntTi5CEGONDvpavnKdqs846IFpYl2lZJoRKMgqVoKZeGDeLOyLg17TgqWVKG9nwXUdqkDkdTCdGIxs_Ses8wuMwPxvJ1ZxIG7JhvPJODDOvdxsKPrl=w400-h260\" width=\"400\" /></a></div><div id=\"gtx-trans\" style=\"left: 76px; position: absolute; top: 679.2px;\"><div class=\"gtx-trans-icon\"></div></div>",
        "contentSnippet": "kaggle 은 윈도우버전과 호환성이 낮다. 우분투에서는 잘 실행된다. \n\n\n\n\n다음과 같은 순서로 설치하면 된다. \n1. kaggle 웹사이트 방문 후 가입한다.\n2. kaggle > account > setting > new API key 로 키값을 얻는다. 여기서 브라우저 설정에 따라 kaggle.json이 다운안되는 경우가 많다. 이 경우 다음과 같이 이 파일을 직접 작성해야 한다.\n\n\n\n이 파일은 다음 명령으로 생성할 수 있다. 터미널에 입력한다. \nmkdir -p ~/.kaggle\necho '{\"username\":\"<user name>\",\"key\":\"<your key>\"}' > ~/.kaggle/kaggle.json\nchmod 600 ~/.kaggle/kaggle.json\n그 결과 다음 형식의 파일이 생성될 것이다.\n{\"username\":\"\",\"key\":\"\"}\n3. 터미널에서 kaggle 을 설치한다. pip install kaggle\n4. 다음과 같이 경진대회 리스트 실행해 본다. \n실행 결과는 다음과 같다.\nvenv_lmm) ktw@tron:~$ kaggle competitions list\nref                     deadline             category                reward  teamCount  userHasEntered  \nhttps://www.kaggle.com/competitions/ai-mathematical-olympiad-progress-prize-3       2026-04-15 23:59:00  Featured         2,207,152 Usd        976           False  \nhttps://www.kaggle.com/competitions/vesuvius-challenge-surface-detection            2026-02-13 23:59:00  Research           200,000 Usd        446           False  \nhttps://www.kaggle.com/competitions/google-tunix-hackathon                          2026-01-12 23:59:00  Featured           100,000 Usd         97           False  \nhttps://www.kaggle.com/competitions/csiro-biomass                                   2026-01-28 23:59:00  Research            75,000 Usd       2494           False  \nhttps://www.kaggle.com/competitions/recodai-luc-scientific-image-forgery-detection  2026-01-15 23:59:00  Research            55,000 Usd       1029           False",
        "id": "tag:blogger.com,1999:blog-5201956450461596914.post-849284476447348129",
        "isoDate": "2025-12-25T10:54:00.000Z"
      }
    ]
  },
  {
    "name": "권용진",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김승호",
    "category": "개인",
    "posts": []
  },
  {
    "name": "RSS feed for boyism Blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성준의 린스타트업과 디자인씽킹",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권혁우",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김준형",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강동혁",
    "category": "개인",
    "posts": []
  },
  {
    "name": "고종범",
    "category": "개인",
    "posts": []
  },
  {
    "name": "cheese10yun",
    "category": "개인",
    "posts": []
  },
  {
    "name": "구자철",
    "category": "개인",
    "posts": []
  },
  {
    "name": "FSS",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권동준",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김용일",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김도균",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민석",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김동우",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권윤학",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강성훈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김만수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "엘키",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김슬기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김광현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성빈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강명훈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민장",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성중",
    "category": "개인",
    "posts": []
  },
  {
    "name": "구교준",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김덕기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "고명환",
    "category": "개인",
    "posts": [
      {
        "creator": "고명환",
        "title": "강의안 | 로컬 트렌드 및 창업 로드맵 - 창업",
        "link": "https://brunch.co.kr/@@LOc/320",
        "pubDate": "Fri, 26 Dec 2025 02:17:42 GMT",
        "author": "고명환",
        "content": "1. 로컬 트렌드 및 창업 로드맵   2. 로컬 트렌드 및 창업 로드맵 전체 강의안  https://docs.google.com/presentation/d/e/2PACX-1vSVdPvFpR0opgn3S0D0GW_9CVPu5XPuOAWLYFBt2pU6vvuhKLcskK48bad9d9N2Jg/pub?start=true&amp;loop=false&amp;delayms=3000<img src= \"https://img1.daumcdn.net/thumb/R1280x0.fjpg/?fname=http%3A%2F%2Ft1.daumcdn.net%2Fbrunch%2Fservice%2Fuser%2FLOc%2Fimage%2Ffp-kBU66l3LSQW7xvwtYyEqRopc.JPG\" width=\"500\" />",
        "contentSnippet": "1. 로컬 트렌드 및 창업 로드맵   2. 로컬 트렌드 및 창업 로드맵 전체 강의안  https://docs.google.com/presentation/d/e/2PACX-1vSVdPvFpR0opgn3S0D0GW_9CVPu5XPuOAWLYFBt2pU6vvuhKLcskK48bad9d9N2Jg/pub?start=true&loop=false&delayms=3000",
        "guid": "https://brunch.co.kr/@@LOc/320",
        "isoDate": "2025-12-26T02:17:42.000Z"
      }
    ]
  },
  {
    "name": "강성희",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강병수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김봉현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강형석",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김수로",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강미경",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강진우",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권민재",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권태관",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김도곤",
    "category": "개인",
    "posts": []
  },
  {
    "name": "칡토스의 게임 개발",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김선철",
    "category": "개인",
    "posts": []
  },
  {
    "name": "프리웨어 이야기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "동우리의 블로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "하테나",
    "category": "개인",
    "posts": []
  },
  {
    "name": "늑돌이네 라지온",
    "category": "개인",
    "posts": []
  },
  {
    "name": "루리웹 - 루리웹 리뷰 게시판",
    "category": "게임",
    "posts": [
      {
        "creator": "(RULIWEB`Д')/",
        "title": "[MULTI] 어쩌면 궁극의 복각, 어스토니시아 스토리",
        "link": "https://bbs.ruliweb.com/news/board/11/read/2405",
        "pubDate": "Fri, 26 Dec 2025 18:36:32 +0900",
        "author": "(RULIWEB`Д')/",
        "content": "<img width=\"236\" height=\"177\" src=\"https://i3.ruliweb.com/thumb/25/12/26/19b59b6d4504c329e.jpg\">",
        "contentSnippet": "",
        "categories": [
          "리뷰"
        ],
        "isoDate": "2025-12-26T09:36:32.000Z"
      },
      {
        "creator": "｜RULIWEB｜",
        "title": "악역영애 4컷 만화 - 31화, 체육대회인데스와 ②",
        "link": "https://bbs.ruliweb.com/news/board/11/read/2404",
        "pubDate": "Wed, 24 Dec 2025 22:35:03 +0900",
        "author": "｜RULIWEB｜",
        "content": "<img width=\"236\" height=\"177\" src=\"https://i3.ruliweb.com/thumb/25/12/24/19b5091881f51ad6b.png\">",
        "contentSnippet": "",
        "categories": [
          "웹툰"
        ],
        "isoDate": "2025-12-24T13:35:03.000Z"
      }
    ]
  },
  {
    "name": "Reasontobe",
    "category": "개인",
    "posts": []
  },
  {
    "name": "에스티마의 인터넷이야기 EstimaStory.com",
    "category": "개인",
    "posts": []
  },
  {
    "name": "나긋한 개발 - 데비안 리눅스와 프로그램 언어",
    "category": "개인",
    "posts": []
  },
  {
    "name": "일상을 여행처럼...",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Just hack'em",
    "category": "개인",
    "posts": []
  },
  {
    "name": "C++ Truths",
    "category": "개인",
    "posts": []
  },
  {
    "name": "jacking75",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Joel on Software",
    "category": "개인",
    "posts": []
  },
  {
    "name": "벤자민로그",
    "category": "개인",
    "posts": [
      {
        "title": "루비는 공짜 점심",
        "link": "https://jeho.page/essay/2025/12/25/ruby4.html",
        "pubDate": "2025-12-25T06:52:00.000Z",
        "author": "김재호",
        "content": "<p>공짜 점심은 없다는 말을 좋아합니다.<br />\n세상의 많은 일들이 선의로 포장되어 있지만 공짜는 없다는 것.<br />\n이 말대로 세상을 보면 많은 비밀이 보이거든요.</p>\n\n<p>하지만 가끔은 공짜 점심이라는 게 있는 거 아닌가? 생각이 들때도 있습니다.<br />\n루비 업그레이드를 할 때.</p>\n\n<p>카톡 서버 개발을 하던 시절, 새로 나오는 루비를 수많은 서버 중 한 대에 설치해서 얼마나 성능이 좋아지나 측정해보곤 했습니다.<br />\n새로운 루비를 설치하는 것만으로도 초당 처리 요청 수가 3% 정도 좋아졌던 걸로 기억합니다.<br />\n3% 성능 올리기가 쉬운일인가? 코드 한 줄 안 바꿨는데.<br />\n그리고 편리한 문법 추가는 덤. 이건 정말 공짜 점심 아닌가?</p>\n\n<p>이런 공짜 점심은 루비팀의 노고 덕분일 겁니다.<br />\n루비 2.0 이후로는 업그레이드 할 때 힘이 든 적이 한 번도 없었는데, 이 또한 세심한 배려 덕분이겠지요.</p>\n\n<p>오늘은 크리스마스.<br />\n선물은 <a href=\"https://www.ruby-lang.org/en/news/2025/12/25/ruby-4-0-0-released/\">Ruby 4.0</a> 이네요. 메이저 버전 선물이라니 아이처럼 기쁩니다.<br />\n이런 생각을 할 때마다 루비팀에 감사한 마음을 갖게 됩니다.</p>\n\n<p><img src=\"/assets/img/ruby4.png\" alt=\"Ruby 4.0\" /><br />\n<em>2025년 크리스마스 선물은 Ruby 4.0</em>\n<br />\n<br />\n<em>함께 읽으면 좋은 글:</em></p>\n<ul>\n  <li><a href=\"/essay/2023/01/04/dont-say-ruby-is-slow.html\">루비가 느리다고?</a></li>\n  <li><a href=\"/essay/2022/02/18/ruby.html\">Ruby는 프로그래머를 위한 선물</a></li>\n  <li><a href=\"/essay/2024/08/28/ruby-unless.html\">Ruby의 unless 쉽게 읽기</a></li>\n</ul>",
        "contentSnippet": "공짜 점심은 없다는 말을 좋아합니다.\n하지만 가끔은 공짜 점심이라는 게 있는 거 아닌가? 생각이 들때도 있습니다.\n카톡 서버 개발을 하던 시절, 새로 나오는 루비를 수많은 서버 중 한 대에 설치해서 얼마나 성능이 좋아지나 측정해보곤 했습니다.\n이런 공짜 점심은 루비팀의 노고 덕분일 겁니다.\n오늘은 크리스마스.\nRuby 4.0 이네요. 메이저 버전 선물이라니 아이처럼 기쁩니다.\n\n2025년 크리스마스 선물은 Ruby 4.0\n\n\n함께 읽으면 좋은 글:\n루비가 느리다고?\nRuby는 프로그래머를 위한 선물\nRuby의 unless 쉽게 읽기",
        "summary": "공짜 점심은 없다는 말을 좋아합니다. 세상의 많은 일들이 선의로 포장되어 있지만 공짜는 없다는 것. 이 말대로 세상을 보면 많은 비밀이 보이거든요.",
        "id": "https://jeho.page/essay/2025/12/25/ruby4",
        "isoDate": "2025-12-25T06:52:00.000Z"
      },
      {
        "title": "코드 리뷰만큼은 내가 한다",
        "link": "https://jeho.page/essay/2025/12/24/code-review.html",
        "pubDate": "2025-12-24T05:27:00.000Z",
        "author": "김재호",
        "content": "<p><a href=\"/essay/2022/10/16/kakaotalk-server-development.html\">카카오톡 정도 규모의 서비스를 배포하려면 큰 스트레스를</a> 받습니다.<br />\n사고가 났을 때 영향이 너무 크니까. (네이버 실검에 올라갑니다)<br />\n변경 사항이 많은 날에는 마지막 엔터키를 누르기 전 긴장해서 손이 땀으로 축축해져 있곤 했습니다.</p>\n\n<p>이 무서운 배포를 원래는 다른 친구가 도맡아서 했습니다.<br />\n온갖 궂은 일을 도맡아 하던 이 친구는 어느 날 우리를 배신하고 다른 팀으로 떠나버렸습니다.<br />\n아직도 그 날의 충격이 기억나네요.(웃음)</p>\n\n<p><img src=\"/assets/img/talk-server-fuck-you.jpg\" alt=\"카톡 서버팀\" /><br />\n<em>배신자를 다른 팀으로 떠나보내던 날. (이제 다들 거물이 되어 사진은 모자이크 처리 했습니다)</em></p>\n\n<p>그후 배포는 주로 제가 하게 되었던 것 같습니다.<br />\n배포 전에는 변경 사항들을 한줄 한줄 꼼꼼하게 읽어봤습니다.<br />\n사고가 나면 아찔하고 피곤해지는 건 나니까. 미리 꼼꼼하게 잘 읽어보는 수밖에 없었습니다.<br />\n서버 배포 전의 마지막 문지기.<br />\n이런 제 역할을 즐겼던 것 같기도 합니다.</p>\n\n<p>오랜만에 지인들을 만나 요즘에 어떻게 코딩하는지 대화를 나눴습니다.<br />\nAI와 거의 하나가 되어가고 있더군요.<br />\n기획서도 AI가 쓰고 코딩도 AI가 하고, 자동으로 풀리퀘스트를 보내고 나면 또 자동으로 달려오는 코드 리뷰 봇들까지.</p>\n\n<p>이런 얘기를 들으면 정신이 혼미해집니다.<br />\nAI에게 리뷰를 맡겨도 되는지를 생각해 보기 전에, 이런 파이프라인 자체가 저에게는 복잡하고 어렵거든요.<br />\n점점 세상을 따라가기가 힘들어집니다.</p>\n\n<p>저는 오래 전부터 코드 diff를 읽을 때 소스트리를 사용하고 있습니다.<br />\n아직까지도 도구를 안 바꾸고 이걸 쓰는 걸 보면 이제 늙다리 다됐다는 생각도 듭니다.<br />\n(요즘에도 소스트리를 쓰시는 분 있나요?)</p>\n\n<p>소스트리에서 diff를 읽는 것은 예전이나 지금이나 저의 중요한 일과입니다.<br />\n코더는 이제 동료들이 아니라 클로드코드입니다.<br />\n코드량이 더 많아져서 힘들지만… 리뷰만큼은 할 수 있는데까지 제 힘으로 해보고 싶습니다.\n<br />\n<br />\n<em>함께 읽으면 좋은 글:</em></p>\n<ul>\n  <li><a href=\"/essay/2022/10/16/kakaotalk-server-development.html\">카톡 서버 개발의 추억</a></li>\n  <li><a href=\"/essay/2025/07/15/claude-code.html\">클로드코드 Max 사용기</a></li>\n</ul>",
        "contentSnippet": "카카오톡 정도 규모의 서비스를 배포하려면 큰 스트레스를 받습니다.\n이 무서운 배포를 원래는 다른 친구가 도맡아서 했습니다.\n\n배신자를 다른 팀으로 떠나보내던 날. (이제 다들 거물이 되어 사진은 모자이크 처리 했습니다)\n그후 배포는 주로 제가 하게 되었던 것 같습니다.\n오랜만에 지인들을 만나 요즘에 어떻게 코딩하는지 대화를 나눴습니다.\n이런 얘기를 들으면 정신이 혼미해집니다.\n저는 오래 전부터 코드 diff를 읽을 때 소스트리를 사용하고 있습니다.\n소스트리에서 diff를 읽는 것은 예전이나 지금이나 저의 중요한 일과입니다.\n함께 읽으면 좋은 글:\n카톡 서버 개발의 추억\n클로드코드 Max 사용기",
        "summary": "카카오톡 정도 규모의 서비스를 배포하려면 큰 스트레스를 받습니다. 사고가 났을 때 영향이 너무 크니까. (네이버 실검에 올라갑니다) 변경 사항이 많은 날에는 마지막 엔터키를 누르기 전 긴장해서 손이 땀으로 축축해져 있곤 했습니다.",
        "id": "https://jeho.page/essay/2025/12/24/code-review",
        "isoDate": "2025-12-24T05:27:00.000Z"
      }
    ]
  },
  {
    "name": "악보쓰는 프로그래머",
    "category": "개인",
    "posts": []
  },
  {
    "name": "쭌안아빠",
    "category": "개인",
    "posts": []
  },
  {
    "name": "A Gangster World",
    "category": "개인",
    "posts": []
  },
  {
    "name": "요우의 내맘대로 블로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "개발자스럽다",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "Against All Odds.",
    "category": "개인",
    "posts": []
  },
  {
    "name": "움직이는 게임서버",
    "category": "개인",
    "posts": []
  },
  {
    "name": "이상욱",
    "category": "개인",
    "posts": []
  },
  {
    "name": "임철재",
    "category": "개인",
    "posts": []
  },
  {
    "name": "어쩐지 오늘은",
    "category": "개인",
    "posts": []
  },
  {
    "name": "oddpoet’s étude",
    "category": "개인",
    "posts": []
  },
  {
    "name": "0x00 - NULL",
    "category": "개인",
    "posts": []
  },
  {
    "name": "퇴근 후 서버다운",
    "category": "개인",
    "posts": []
  },
  {
    "name": "coolspeed",
    "category": "개인",
    "posts": []
  },
  {
    "name": "오늘도 끄적끄적",
    "category": "개인",
    "posts": []
  },
  {
    "name": "dx11 Vanica's Lifelog - 夢が夢で終わらないように",
    "category": "개인",
    "posts": []
  },
  {
    "name": "초코사랑",
    "category": "개인",
    "posts": []
  },
  {
    "name": "ZeroCho Blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "imays게임엔진개발자",
    "category": "개인",
    "posts": []
  },
  {
    "name": "RSS feed for hurinmon Blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "기억보단 기록을",
    "category": "개인",
    "posts": []
  },
  {
    "name": "WestwoodForever's Dev Log",
    "category": "개인",
    "posts": []
  },
  {
    "name": "허니몬(Honeymon)의 자바guru",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Wolf Loves Fox :: 일상",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Game Programmer Life",
    "category": "개인",
    "posts": []
  },
  {
    "name": "yuchi's dev",
    "category": "개인",
    "posts": []
  },
  {
    "name": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "신현석(Hyeonseok Shin)",
    "category": "개인",
    "posts": [
      {
        "title": "자전거 펌프로 자동차 타이어 공기 주입하기",
        "link": "https://hyeonseok.com/blog/947",
        "pubDate": "Fri, 26 Dec 2025 10:18:25 GMT",
        "content": "<p>겨울이 되어서 날씨가 추워지니 자동차 타이어의 공기압이 낮다는 경고가 떴다. 과거에는 공기압 경고가 뜨면 긴급 출동을 불러서 공기를 보충하곤 했다. 그러다가 자동차 타이어나 자전거 타이어나 똑같다는 말을 들고 직접 공기를 채워봐야 겠다고 생각하고 있었는데 드디어 그 시간이 왔다.</p>\r\n\r\n<p>최근에는 자동차 타이어에 공기를 주입하는 키트가 자동차에 포함되어 있는 경우가 많고 따로 판매하기도 한다. 시거잭에 전원을 연결해서 공기압을 설정하고 타이어에 자동으로 공기를 주입하는 방식이다. 내차는 연식이 좀 되어서 없다.</p>\r\n\r\n<p>자전거는 자주 공기를 주입해야 해서 자전거용 펌프를 하나 구입해서 사용해왔다. 압력계도 달려 있고 공기 호스를 연결한 후에 위아래로 레버를 누르면 공기가 주입되는 방식이다. 공기 주입구의 종류가 여러가지여서 젠더도 포함이 되어 있고 주입구에 따라서 약간의 조작이 필요하다. 주입구 종류는 보통 던롭, 슈레더, 프레스타 등이 있는데 유투브를 좀 찾아보니 <a href=\"https://www.youtube.com/watch?v=DKx6ayx3sPQ\">[자전거 관리] 공기압 넣는 방법ㅣ던롭ㅣ프레스타ㅣ슈레더</a> 이 영상이 제일 이해하기 쉽게 설명해 주고 있다.</p>\r\n\r\n<p>오토바이나 자동차는 슈레더 방식을 많이 사용해서 자전거 펌프를 연결하고 자전거 공기 주입하듯이 하면 된다. 다만 자전거에 비해서 타이어가 훨씬 두껍고 공기도 많이 들어가서 좀 힘이 든다. 뒷바퀴는 20psi, 앞바퀴는 24psi 정도였는데 다 33psi로 주입하니 매우 힘들었다.</p>\r\n\r\n<p>주입을 하고 차를 주행하니 바퀴 네개가 다 36psi로 나온다. 아마 자전거 펌프의 압력계가 좀 낮게 나오거나 주행을 좀 해서 압력이 올라간 것인 듯싶다. 직접 정비를 하니 힘은 좀 들었지만 상당히 뿌듯하다. 힘들어서 사진은 없다.</p>\r\n\r\n<p>추가로 psi를 '프사이'라고 읽었었는데 같은 발음의 다른 의미와 헷갈리지 않게 압력의 단위는 '피에스아이'라고 읽는게 좋다고 한다. 또 파스칼과는 뭐가 다른가 살펴봤더니 이거는 'Pound per Square Inch'라고 한다. 인치나 피트 같은 놈이다. 미국에서 주로 쓴다고 한다. 되도록 표준인 바(bar)나 파스칼(Pa)을 쓰도록 하자.</p>",
        "contentSnippet": "겨울이 되어서 날씨가 추워지니 자동차 타이어의 공기압이 낮다는 경고가 떴다. 과거에는 공기압 경고가 뜨면 긴급 출동을 불러서 공기를 보충하곤 했다. 그러다가 자동차 타이어나 자전거 타이어나 똑같다는 말을 들고 직접 공기를 채워봐야 겠다고 생각하고 있었는데 드디어 그 시간이 왔다.\n\r\n\r\n최근에는 자동차 타이어에 공기를 주입하는 키트가 자동차에 포함되어 있는 경우가 많고 따로 판매하기도 한다. 시거잭에 전원을 연결해서 공기압을 설정하고 타이어에 자동으로 공기를 주입하는 방식이다. 내차는 연식이 좀 되어서 없다.\n\r\n\r\n자전거는 자주 공기를 주입해야 해서 자전거용 펌프를 하나 구입해서 사용해왔다. 압력계도 달려 있고 공기 호스를 연결한 후에 위아래로 레버를 누르면 공기가 주입되는 방식이다. 공기 주입구의 종류가 여러가지여서 젠더도 포함이 되어 있고 주입구에 따라서 약간의 조작이 필요하다. 주입구 종류는 보통 던롭, 슈레더, 프레스타 등이 있는데 유투브를 좀 찾아보니 [자전거 관리] 공기압 넣는 방법ㅣ던롭ㅣ프레스타ㅣ슈레더 이 영상이 제일 이해하기 쉽게 설명해 주고 있다.\n\r\n\r\n오토바이나 자동차는 슈레더 방식을 많이 사용해서 자전거 펌프를 연결하고 자전거 공기 주입하듯이 하면 된다. 다만 자전거에 비해서 타이어가 훨씬 두껍고 공기도 많이 들어가서 좀 힘이 든다. 뒷바퀴는 20psi, 앞바퀴는 24psi 정도였는데 다 33psi로 주입하니 매우 힘들었다.\n\r\n\r\n주입을 하고 차를 주행하니 바퀴 네개가 다 36psi로 나온다. 아마 자전거 펌프의 압력계가 좀 낮게 나오거나 주행을 좀 해서 압력이 올라간 것인 듯싶다. 직접 정비를 하니 힘은 좀 들었지만 상당히 뿌듯하다. 힘들어서 사진은 없다.\n\r\n\r\n추가로 psi를 '프사이'라고 읽었었는데 같은 발음의 다른 의미와 헷갈리지 않게 압력의 단위는 '피에스아이'라고 읽는게 좋다고 한다. 또 파스칼과는 뭐가 다른가 살펴봤더니 이거는 'Pound per Square Inch'라고 한다. 인치나 피트 같은 놈이다. 미국에서 주로 쓴다고 한다. 되도록 표준인 바(bar)나 파스칼(Pa)을 쓰도록 하자.",
        "guid": "https://hyeonseok.com/blog/947",
        "isoDate": "2025-12-26T10:18:25.000Z"
      }
    ]
  },
  {
    "name": "즐거운 개발자 :: 네이버  블로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "황제펭귄의 게임개발이야기 [여기는 한국]",
    "category": "개인",
    "posts": []
  },
  {
    "name": "LINE ENGINEERING",
    "category": "기업",
    "posts": [
      {
        "title": "코드 품질 개선 기법 27편: 티끌이 모여 태산이 되듯 의존성도 쌓이면",
        "link": "https://techblog.lycorp.co.jp/ko/techniques-for-improving-code-quality-27",
        "pubDate": "Tue, 23 Dec 2025 02:00:00 GMT",
        "content": "이 글은 2024년 5월 30일에 일본어로 먼저 발행된 기사를 번역한 글입니다.LY Corporation은 높은 개발 생산성을 유지하기 위해 코드 품질 및 개발 문화 개선에 힘쓰고...",
        "contentSnippet": "이 글은 2024년 5월 30일에 일본어로 먼저 발행된 기사를 번역한 글입니다.LY Corporation은 높은 개발 생산성을 유지하기 위해 코드 품질 및 개발 문화 개선에 힘쓰고...",
        "guid": "https://techblog.lycorp.co.jp/ko/techniques-for-improving-code-quality-27",
        "isoDate": "2025-12-23T02:00:00.000Z"
      }
    ]
  },
  {
    "name": "뱅크샐러드 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "우아한형제들 기술 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "TOAST Meetup",
    "category": "기업",
    "posts": []
  },
  {
    "name": "ZUM 기술 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "SK Planet",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Spoqa tech blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "팀 왈도 번역팀",
    "category": "게임",
    "posts": []
  },
  {
    "name": "근원님",
    "category": "개인",
    "posts": []
  },
  {
    "name": "황의윤",
    "category": "개인",
    "posts": []
  },
  {
    "name": "호돌맨",
    "category": "개인",
    "posts": []
  },
  {
    "name": "박우빈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "문다영",
    "category": "개인",
    "posts": []
  },
  {
    "name": "유수민",
    "category": "개인",
    "posts": []
  },
  {
    "name": "안건주",
    "category": "개인",
    "posts": []
  },
  {
    "name": "손현호",
    "category": "개인",
    "posts": []
  },
  {
    "name": "STARTUP BIBLE",
    "category": "개인",
    "posts": []
  },
  {
    "name": "매거진 입맛",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "요즘 IT",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "쿠팡 엔지니어링",
    "category": "기업",
    "posts": []
  },
  {
    "name": "지마켓 기술 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "리멤버 (드라마 앤 컴퍼니)",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Kimchi hill",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "Hudi.blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "토스",
    "category": "기업",
    "posts": []
  },
  {
    "name": "모나미",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김진홍",
    "category": "개인",
    "posts": []
  }
]