[
  {
    "id": 1,
    "imageUrl": "",
    "title": "[책 리뷰] 밑바닥부터 만들면서 배우는 LLM",
    "description": "해당 도서는 길벗 출판사의 리뷰이벤트로 증정받았습니다. OpenAI에서 GPT가 나온이후로, 수 많은 LLM(Large Language Model)이 나오게 되었습니다. llama나 deepseek, qwen과 같은 sLM 까지 포함하면 굉장히 빠르게 발전하고 있는 분야가 이 부분입니다. 현재 AI 프로젝트라고 하면 대부분 이런 LLM이나 sLM을 이용한 결과를 내는 것이 대부분입니다. 그렇다면 모두가 LLM을 정확히 이해해야 하는가라고 물어보면 사실 그런건 아닙니다. 그런데, LLM을 […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://charsyam.wordpress.com/2025/09/29/%ec%b1%85-%eb%a6%ac%eb%b7%b0-%eb%b0%91%eb%b0%94%eb%8b%a5%eb%b6%80%ed%84%b0-%eb%a7%8c%eb%93%a4%eb%a9%b4%ec%84%9c-%eb%b0%b0%ec%9a%b0%eb%8a%94-llm/",
    "pubDate": "Mon, 29 Sep 2025 16:01:11 +0000",
    "creator": "charsyam",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "“I tried out JetBrains’ code analysis tool Qodana”",
    "description": "This is the English version of the Japanese article first published by Jan Maki on Qiita. This post was not commissioned by Qodana and was written independently. For more information please reach out to them in the comments or via their link tree. Qodana is JetBrains’ code analysis platform for quality and aspects of code […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/qodana/2025/09/i-tried-out-jetbrains-code-analysis-tool-qodana/",
    "pubDate": "Mon, 29 Sep 2025 12:59:55 +0000",
    "creator": "Kerry Beetge",
    "categories": [
      "ai",
      "use-case",
      "qodana",
      "static-code-analysis"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "퇴직연금은 이걸로 (0111P0) 1Q 미국나스닥100 미국채혼합50액티브",
    "description": "영상: https://www.youtube.com/watch?v=ePqmiTTJcBY\n\n\n\n현재 채권도 바닥이라 좋고\nAI 때문에 나스닥도 좋습니다.\n그리고 한국은 확장 재정 지출 때문에 원화가치가 하락합니다.\n \n그래서 이 상품에 들어가기 좋습니다.\n채권 / 기술주 / 달러 \n다 들어가 있습니다.\n \n특히 퇴직연금은 채권도 30% 정도 사야되서 모든 현금을 다 투자하려면 이걸 많이사는 것이 좋습니다.\n \n퇴직연금아니고 일반계좌라면 채권혼합된거 굳이 사실 필요 없습니다.\n하락시기에 물타는 기술만 좋다면\n그냥 나스닥100 사는게 효율이 더 좋습니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1405",
    "pubDate": "Tue, 30 Sep 2025 10:37:52 +0900",
    "creator": "SIDNFT",
    "categories": [
      "투자",
      "ETF",
      "퇴직연금",
      "투자"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "유전자 단백질 분석을 위한 알파폴드 모델과 GNN 관계, 그리고 동작 메커니즘",
    "description": "이 글은 구글 딥마인드(DeepMind)가 개발하여 생명과학계에 혁신을 가져온 단백질 3차원 구조 예측 모델, 알파폴드2(AlphaFold2)의 핵심 딥러닝 아키텍처를 정리한다. \n\n\n\nHighly accurate protein structure prediction with AlphaFold | Nature\n\n알파폴드2의 성공은 트랜스포머(Transformer)의 어텐션 메커니즘을 그래프 신경망(GNN)의 관계형 추론 프레임워크에 통합하고, 3차원 공간적 제약을 직접 모델링한 결과물이다. 이 글은 알파폴드2의 주요 구성요소인 다중 서열 정렬(MSA), 이보포머(Evoformer), 구조 모듈(Structure Module)의 역할을 기술하고, 이러한 구조가 GNN 및 트랜스포머의 원리와 어떻게 결합되는지 심도 있게 고찰하고자 한다.\n\n머리말\n단백질의 기능은 고유한 3차원 입체 구조에 의해 결정되므로, 아미노산 서열로부터 3차원 구조를 예측하는 '단백질 접힘 문제'는 지난 50년간 생명과학 분야의 핵심적인 난제였다. 기존의 실험적 방법들은 막대한 시간과 비용이 소요되어 단백질 연구의 큰 장벽으로 작용해왔다.\n이러한 상황에서 2020년 구글 딥마인드가 발표한 알파폴드2는 딥러닝을 통해 이 문제를 전례 없는 정확도로 해결하며 해당 분야의 패러다임을 전환시켰다. 본 보고서는 알파폴드2의 기술적 근간을 이루는 딥러닝 아키텍처를 세부적으로 분석하여, 그 성공 요인을 규명하는 데 중점을 둔다.\n\n알파폴드2 아키텍처의 핵심 구성요소\n알파폴드2의 시스템은 입력된 아미노산 서열로부터 3차원 구조를 예측하기까지, 여러 독창적인 모듈이 유기적으로 연동되는 파이프라인으로 구성된다.\n\n다중 서열 정렬 (Multiple Sequence Alignment, MSA)\n알파폴드2는 단일 아미노산 서열이 아닌, 방대한 유전체 데이터베이스 검색을 통해 확보한 수천 개의 유사 서열 묶음, 즉 MSA를 주된 입력으로 활용한다. 이는 진화 과정에서 특정 위치의 아미노산이 변이될 때, 다른 위치의 아미노산도 함께 변이되는 '공진화(Co-evolution)' 정보를 포착하기 위함이다. 공진화 관계에 있는 아미노산 쌍은 3차원 구조상에서 물리적으로 근접할 확률이 높기 때문에, 이는 구조 예측의 결정적인 단서로 작용한다.\n\n이보포머 (Evoformer): 그래프 기반 추론 엔진\n이보포머는 MSA 정보로부터 구조적 단서를 추론하는 알파폴드2의 핵심 엔진이다. 이 모듈은 두 종류의 정보를 병렬적으로 처리하고 상호작용시키며 반복적으로 정교화한다.\nMSA 표현 (1D 정보): MSA 내 아미노산 서열 간의 관계를 나타낸다.\n\n쌍 표현 (Pair Representation, 2D 정보): 아미노산 쌍(i, j) 사이의 거리 및 방향과 같은 기하학적 관계를 행렬 형태로 나타낸다. 이는 사실상 그래프의 인접 행렬과 유사한 역할을 수행한다.\n\n\n\n이보포머 내부에서는 트랜스포머의 어텐션(Attention) 메커니즘이 MSA와 쌍 표현 사이의 정보 교환을 촉진한다. 즉, 서열의 공진화 정보가 두 아미노산이 가까울 것이라는 구조 정보를 강화하고, 역으로 특정 아미노산 쌍이 가깝다는 정보가 MSA 내의 관계를 재해석하는 데 도움을 준다. 이 과정이 수십 개의 이보포머 블록을 거치며 반복되어, 구조에 대한 예측은 점차 명확해진다.\n\n구조 모듈 (Structure Module): 3차원 좌표 생성\n\n이보포머를 통해 최종적으로 정제된 쌍 표현 행렬은 각 아미노산 쌍의 기하학적 관계에 대한 신뢰도 높은 지도로 볼 수 있다. 구조 모듈은 이 지도를 바탕으로 각 아미노산을 하나의 강체(rigid body)로 간주하고, 이들의 3차원 공간상 위치(회전 및 변환)를 직접적으로 예측한다. 이 과정에서는 '불변점 어텐션(IPA)'이라는 특수 메커니즘을 사용하여, 예측된 단백질 전체가 회전하거나 이동하더라도 내부의 상대적인 구조는 변하지 않는 물리적 일관성을 보장한다.\n\nGNN과 트랜스포머 관점에서의 아키텍처 융합\n알파폴드의 핵심적인 혁신은 GNN의 관계형 추론 프레임워크와 트랜스포머의 강력한 정보 교환 방식을 3차원 공간 문제에 맞게 융합한 데 있다.\n\n\nGNN 프레임워크: 알파폴드는 단백질을 아미노산(노드)과 이들 간의 상호작용(엣지)으로 구성된 완전 연결 그래프(Fully Connected Graph)로 간주한다. 쌍 표현(Pair Representation)은 이 그래프의 엣지 가중치를 동적으로 학습하는 역할을 수행한다.\n\n\n\n트랜스포머의 어텐션 메커니즘: 알파폴드는 GNN의 메시지 전달 과정을 트랜스포머의 어텐션으로 구현한다. 일반적인 GNN이 1홉(hop) 이웃의 정보만 취합하는 것과 달리, 어텐션은 모든 노드가 다른 모든 노드와 직접적으로 정보를 교환하도록 한다. 이를 통해 모델은 어떤 노드의 정보를 더 중요하게 참고할지(Attention Score)를 학습하여 전역적인 문맥을 효과적으로 파악한다. 이보포머 블록을 반복하는 것은 GNN 레이어를 여러 겹 쌓는 것과 동일한 효과를 낸다.\n\n\n\n3차원 공간 정보의 직접적 활용: 전통적인 GNN이 추상적인 연결성을 다루는 반면, 알파폴드의 구조 모듈은 3차원 공간에서의 회전과 변환이라는 기하학적 특징을 직접적으로 다룬다. '불변점 어텐션(IPA)'은 이러한 3차원 변환에도 예측의 일관성을 유지하게 하는 핵심 장치로, 이는 GNN이 실제 물리 공간의 제약을 학습하도록 진화한 형태로 볼 수 있다.\n\n\n구조(Structure)와 기능(Function)의 차이\n알파폴드의 역할을 정확히 이해하기 위해서는 예측 목표가 단백질의 '기능'이 아닌 '구조'라는 점을 명확히 해야 한다.\n알파폴드는 특정 단백질이 어떤 역할을 수행하는지(예: '신호 전달')를 직접 분류하는 기능 예측 모델이 아니다. 대신, 해당 단백질을 구성하는 모든 원자의 3차원 공간 좌표(x, y, z)를 예측하여 물리적인 형태(Shape)를 알아내는 구조 예측 모델이다.\n구조 예측이 생명과학에서 결정적으로 중요한 이유는 \"구조가 기능을 결정한다(Structure Dictates Function)\"는 근본 원리 때문이다. 특정 효소 단백질이 화학 반응을 촉진하는 기능은, 그 표면에 특정 분자만 결합할 수 있는 고유한 3차원 홈(활성 부위)이라는 구조를 가지고 있기 때문에 가능하다. 따라서 정확한 3차원 구조 정보는 단백질의 기능을 이해하고 제어하기 위한 가장 필수적인 전제 조건이다.\n결론적으로, 알파폴드는 기능이라는 최종 목적지를 향한 여정에서 가장 어렵고 중요한 첫 관문인 '3차원 구조 설계도'를 제공하는 역할을 수행한다.\n\n\n\n\n알파폴드의 3차원 공간 좌표 표현 및 정규화 방식\n이 장은 딥마인드(DeepMind)의 단백질 구조 예측 모델 알파폴드(AlphaFold)가 3차원 공간 좌표를 어떻게 표현하고 예측하는지에 대한 기술적 원리를 분석하는 것을 목적으로 한다. 단백질의 3차원 구조는 전체적인 회전(Rotation) 및 이동(Translation) 변환에 대해 불변(Invariant)하는 특성을 가지므로, 절대적인 전역 좌표(Global Coordinates)를 직접 예측하는 방식은 학습에 본질적인 한계를 가진다. 본 보고서는 알파폴드가 이 문제를 해결하기 위해 도입한 지역 좌표계(Local Frame)와 상대적 변환(Relative Transformation) 기반의 독창적인 접근법을 상세히 기술한다.\n문제 정의: 전역 좌표계 방식의 한계\n기존의 딥러닝 모델이 3차원 객체의 구조를 예측할 때, 각 구성 요소의 절대적인 (x, y, z) 좌표를 직접 출력하도록 설계하는 것은 일반적이다. 그러나 이 방식은 단백질 구조 예측에 다음과 같은 심각한 문제를 야기한다. \n\n\nSE(3) 등변성(Equivariance) 위배: 단백질의 기능과 구조적 본질은 분자 전체가 3차원 공간상에서 회전하거나 이동해도 변하지 않는다. 하지만 절대 좌표 값은 이러한 변환에 따라 완전히 달라진다.\n학습의 비효율성: 모델은 동일한 구조에 대해서도 무한히 많은 정답(좌표 값)을 학습해야 하므로, 데이터의 복잡성이 기하급수적으로 증가하여 안정적인 학습이 거의 불가능하다.\n\n결론적으로, 전역 좌표계는 단백질 구조의 내재적 특성을 표현하기에 부적합하며, 이를 직접 예측하는 것은 비효율적이고 불안정한 접근법이다.\n\n알파폴드의 해결책: 지역 좌표계와 상대적 변환 예측\n알파폴드는 전역 좌표 문제를 해결하기 위해, 예측 대상을 '절대 위치'에서 '상대적 관계'로 변환하였다. 이 접근법은 다음 세 단계로 구성된다.\n1단계: 각 아미노산 잔기에 지역 좌표계(Local Frame) 설정\n알파폴드는 단백질을 구성하는 모든 아미노산 잔기(residue)마다 고유한 지역 좌표계를 설정한다. 이 좌표계는 각 잔기의 뼈대(backbone)를 구성하는 3개의 원자(N, Cα, C')를 기준으로 정의된다.\n\n원점 (Origin): 알파탄소(Cα)\n축 (Axes): Cα, N, C' 원자들의 상대적 위치 벡터를 기반으로 직교 좌표계(x, y, z축)를 생성한다.\n\n이 방식을 통해 단백질 전체의 위치와 상관없이, 각 아미노산은 자신만의 독립적인 기준 좌표계를 갖게 된다.\n2단계: 좌표계 간의 상대적 변환(Transformation) 예측\n알파폴드 모델의 최종 단계인 '구조 모듈(Structure Module)'은 절대 좌표를 직접 예측하지 않는다. 대신, i번째 아미노산의 지역 좌표계에서 i+1번째 아미노산의 지역 좌표계로 변환하기 위해 필요한 회전(Rotation)과 이동(Translation) 값을 예측한다.\n\n회전: 3x3 회전 행렬 (Rotation Matrix)\n이동: 3차원 이동 벡터 (Translation Vector)\n\n이 상대적 변환 값은 단백질 전체의 위치나 방향과 무관하게 항상 일정하므로, 모델은 구조의 본질적인 기하학적 관계만을 학습하게 된다.\n3단계: 예측된 변환을 통한 전체 구조 조립\n모든 잔기 쌍에 대한 상대적 변환 값이 예측되면, 이를 순차적으로 적용하여 전체 3차원 구조를 조립한다.\n첫 번째 아미노산의 지역 좌표계를 공간의 원점에 배치한다.\n예측된 첫 번째 변환(회전/이동)을 적용하여 두 번째 아미노산의 위치와 방향을 계산한다.\n이 과정을 단백질 서열의 마지막 잔기까지 반복하여 모든 뼈대 원자의 3차원 좌표를 최종적으로 결정한다. \n\n\n알파폴드의 접근 방식은 다음과 같은 핵심적인 장점을 가진다.\n\n\n구분\n\n전역 좌표 예측 방식\n\n알파폴드의 지역 좌표계 방식\n\n\n예측 대상\n\n각 원자의 최종 (x, y, z) 절대 좌표\n\n아미노산 잔기 간의 상대적 회전/이동 값\n\n\n특징\n\nSE(3) 등변성을 위배하여 학습이 불안정하다.\n\nSE(3) 등변성(Equivariance)을 자연스럽게 만족하여 안정적이고 효율적인 학습이 가능하다.\n\n\n비유\n\n건물의 모든 벽돌의 GPS 좌표를 학습하는 것\n\n한 벽돌에서 다음 벽돌까지의 방향과 거리를 학습하는 것\n\n\n\n결론적으로, 알파폴드의 혁신은 3차원 공간 좌표라는 결과물을 직접 예측하는 대신, 문제를 지역 좌표계 간의 기하학적 관계로 재정의한 데에 있다. 이는 3D 구조 예측 문제에서 딥러닝 모델이 가져야 할 회전/이동 불변성(등변성)을 확보하는 표준적인 해법을 제시했으며, 알파폴드가 전례 없는 정확도를 달성할 수 있었던 가장 핵심적인 기술적 토대이다.\n\n\n\n마무리\n알파폴드2의 성공은 단일한 혁신이 아닌 여러 핵심 기술의 유기적인 결합에 기인한다. 그 핵심은 (1) 진화적 정보(MSA)를 초기 단서로 활용하고, (2) GNN의 프레임워크 위에서 트랜스포머의 어텐션 메커니즘을 통해 관계를 추론하며, (3) 최종적으로 3차원 공간의 물리적 제약을 만족하는 구조를 생성하는 정교한 파이프라인을 구축한 데 있다.\n특히, 아미노산을 노드로, 상호작용을 엣지로 간주하는 그래프적 접근 방식은 단백질 접힘 문제를 관계형 추론 문제로 재정의하였으며, 이는 GNN과 트랜스포머 모델이 융합될 때 복잡한 과학적 시스템을 얼마나 효과적으로 모델링할 수 있는지를 입증하는 대표적인 사례이다. 알파폴드2의 등장은 단백질 구조 생물학 연구를 가속화했을 뿐만 아니라, 향후 신약 개발 및 질병 연구에 있어 AI 기반의 과학적 발견이 핵심적인 역할을 수행할 것임을 시사한다.\n\n\n레퍼런스\n\n분자식, 소셜 관계, 다차원 모델 위상 관계 예측에 사용되는 PyGeometric 기반 그래프 데이터 학습 방법\n딥러닝 하드웨어 확장성 고려한 PyTorch Lightning 기반 그래프 딥러닝 지원 PyTorch Geometric 사용방법 및 단백질 기능 등 다양한 모델 학습 예시\n화학, 재료 분자, 다차원 형상 데이터 학습, 예측, 재구성에 사용되는 GCN(Graph Convolutional Networks. GNN)과 GDL (Geometric Deep Learning)에 대해",
    "reviews": [],
    "syllabus": [],
    "link": "http://daddynkidsmakers.blogspot.com/2025/09/gnn.html",
    "pubDate": "2025-09-30T11:26:00.000Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "투자하는 기본적인 방법 - 욕심 부리지 마라",
    "description": "영상: https://www.youtube.com/watch?v=5M_kImE_Juw\n\n\n\n25분 24초에 나옵니다.\n \n매수 방법\n어차피 투자 실력이 쌓이지 않은 상태라면 \n어마어마하게 분산해서 200종류를 사보는 것도 좋다고 합니다.\n살 때는 좋다는거 그냥 사서 도 됩니다.\n나쁜 종목만 아니라면 3년 정도 물려있기만해도 전고점 다시 가는 경우가 많습니다.\n하지만 욕심을 부려서 무리한 비중을 들어가면 안됩니다. \n예측은 맞지 도 않을 뿐더로\n견디면 되는 구간을 견딜 수 없을 수도 있습니다.\n이번이 성공하더라도 실패 할때까지 이런짓을 반복하게 되기 때문에\n반드시 실패하게 됩니다.\n \n \n매도 방법\n내계좌를 봐도 되고 시장 지표를 봐도 되는데\n50% 쯤 오른 후에는 비중을 줄입니다.\n이때도 욕심 부리면 안됩니다.\n하나도 안팔고 꼭대기 까지가면 정말 좋겠지만\n이것도 욕심이며 \n자랑하는 심리가 발동해서 내려갈때 못파는 경우가 발생합니다.\n\"이번에도 지난번 고점 갈꺼야\" 라고 생각하면서 기다리다\n역사적 고점을 맞는 수가 발생하면\n회복하는데 3~5년이 걸릴 수 있기 때문에\n(ETF 라면 회복이 돌 수도 있지만 개별주라면 회복이 안될 수 있습니다.)\n충분히 올랐다면 줄여서 현금을 만들어야합니다.\n영상에선 20% 정도를 이야기하는데 50% 도 괜찮을 것같습니다.\n역사적 고점에서는 서로가 성공담만 이야기 하기 때문에\n같이 취해있으면 안됩니다.\n \n \n \n초보라면\n팔아야할때 사야할때 욕심을 부리다보면 \n언젠가 예측 불가능한 현상이 나오면서 맛이 갈 수 있습니다.\n왜냐하면 욕심 때문에 예측 불가능한 현상이 나올때까지 극단적인 행동을 할 것이기 때문입니다.\n내일 당장 10배 간다고 해도 적당한 비중만 들고 가야하며\n내일 휴지가 된다고 확실이 들더라도 일정비중만 매도해야합니다.\n길게보면 내 실력이 형편 없기 때문에 예측은 1도 맞지 않기 때문입니다.\n호히려 반대로 가는 경우가 많았습니다.\n지나보면 \"그게 다 욕심이구나\" 라는 생각이 들것입니다.\n이 생각이 들었을때 현금을 들고 살아있어야하 다음번 기회를 잡을 수 있다는 것도 기억하시고\n절대 욕심부리지마시고 욕심을 부렸다면 기억하고 다음번엔 그렇게 하지 않으셔야합니다.\n투자는 어마어마하게 긴 시간을 해야하기 때문에 심리에 휘둘리면 투자를 이어나갈 수 없게됩니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1408",
    "pubDate": "Wed, 1 Oct 2025 13:21:56 +0900",
    "creator": "SIDNFT",
    "categories": [
      "투자"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "Fixing Overload Resolution For Parameter Arrays in C++/CLI",
    "description": "Fix a problem in C++/CLI parameter array overload resolution which affects newer .NET versions.\nThe post Fixing Overload Resolution For Parameter Arrays in C++/CLI appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/fixing-overload-resolution-for-parameter-arrays-in-c-cli/",
    "pubDate": "Mon, 29 Sep 2025 14:00:08 +0000",
    "creator": "Tanveer Gani",
    "categories": [
      "C++",
      "C++/CLI"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "DataGrip Is Now Free for Non-Commercial Use",
    "description": "We’re excited to announce a change in our licensing model that we believe will benefit the developer community – DataGrip is now free for non-commercial use! With this change, DataGrip joins JetBrains RustRover, CLion, Rider, WebStorm, and RubyMine, which are already free for non-commercial use. Read on to learn more about the change and why […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/datagrip/2025/10/01/datagrip-is-now-free-for-non-commercial-use/",
    "pubDate": "Wed, 01 Oct 2025 14:43:11 +0000",
    "creator": "Stanislav Garkusha",
    "categories": []
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "토스, 플랫폼 최초 증권사 주식담보대출 비교서비스 제공",
    "description": "KB증권·NH투자증권과 협업",
    "reviews": [],
    "syllabus": [],
    "link": "https://toss.im/tossfeed/article/kbnh",
    "pubDate": "Thu, 25 Sep 2025 14:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "Better AI Depends on Better Data: We Need Your Help",
    "description": "TL;DR Over the past few years, AI has made remarkable progress, but it doesn’t always deliver what professional developers need. One key reason is that most models are trained on public datasets that don’t reflect the complex, real-world scenarios faced by professional developers every day. Without such real-world data, our AI tools will fall short. […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/blog/2025/09/30/detailed-data-sharing-for-better-ai/",
    "pubDate": "Tue, 30 Sep 2025 11:52:06 +0000",
    "creator": "Kris Kang",
    "categories": [
      "news",
      "data-sharing"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "AI 만능설에 대한 우려와 짜증 – 수정(fix) 문제",
    "description": "국중고딩 시절부터 서브컬처에 빠져있던 자로서 nano-banana같은 ai가 나와서 나같은 똥손도 동인활동이 가능해졌다는 점에서 약간 반기는 면도 있다. 근데 이거 쓰면 쓸수록 대단하면서도 등신같고 헛점이 명확하다고 느낀다. 첫시도에 잘 생성해줘서 그게 맘에 들면 베스트다. 그러나 수정을 하고 싶다면 이제부터 지옥이 펼쳐진다. 미세 수정을 시작하면 어떤 마법의 주문을 외워도 내가 원하는 쪽으로 가기가 어렵다. 결과물에 대한 수정을 … More AI 만능설에 대한 우려와 짜증 – 수정(fix) 문제",
    "reviews": [],
    "syllabus": [],
    "link": "https://megayuchi.com/2025/09/26/ai-%eb%a7%8c%eb%8a%a5%ec%84%a4%ec%97%90-%eb%8c%80%ed%95%9c-%ec%9a%b0%eb%a0%a4%ec%99%80-%ec%a7%9c%ec%a6%9d-%ec%88%98%ec%a0%95fix-%eb%ac%b8%ec%a0%9c/",
    "pubDate": "Fri, 26 Sep 2025 06:56:18 +0000",
    "creator": "megayuchi",
    "categories": [
      "Development",
      "IT",
      "Pub",
      "ai",
      "nano-banana"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "스팀 - 멀웨어감염 게임된 2D 플렛포머 게임 삭제",
    "description": "영상: https://youtu.be/oKwBGpMz9hs?t=570\n\n\n\n9분 30초에 짤막하게 나옵니다.\n \n스팀에 올라오는 게임도 안전한건 아닌가 봅니다.\n암호화폐는 이미 도난 당한 후에 삭제 되었다고 합니다.\n \n아마도 멀웨어는 지갑주소를 복붙할때 본인 지갑주소로 슬적 바꿔넣는 기능이 있을것 같습니다.\n스팀도 안전한건 아닌가 봅니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1402",
    "pubDate": "Mon, 29 Sep 2025 15:40:51 +0900",
    "creator": "SIDNFT",
    "categories": [
      "게임",
      "멀웨어",
      "스팀"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "인디게임 - CLOVER PIT / 슬롯머신 게임",
    "description": "트레일러: https://www.youtube.com/watch?v=CtX2WIBqsds\n\n\n\n \n \n영상: https://www.youtube.com/watch?v=RKmRfxyZhcY\n\n\n\n14분20초에 콤보가 연속으로 터지는 장면이 있군요\n \n멋진 비주얼입니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1403",
    "pubDate": "Mon, 29 Sep 2025 16:05:26 +0900",
    "creator": "SIDNFT",
    "categories": [
      "게임",
      "인도게임"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "Accelerating our Android apps with Baseline Profiles",
    "description": "Key Takeways: With billions of Android app users, we’re always looking to improve the Meta app experience, and in this post, we explore the ways we’ve leveraged Android’s Baseline Profiles to significantly improve their performance. We discuss the performance challenges we’ve faced as Meta’s apps, how the needs of users have become more complex over [...]\nRead More...\nThe post Accelerating our Android apps with Baseline Profiles appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/10/01/android/accelerating-our-android-apps-with-baseline-profiles/",
    "pubDate": "Wed, 01 Oct 2025 16:00:17 +0000",
    "creator": "Unknown",
    "categories": [
      "Android"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "이춘운과 백태태",
    "description": "최근에 \"재능이 너무 없고, 지금 이정도 실력이면 개발을 포기하고 다른 직업을 찾아보라\" 는 멘토님의 피드백 때문에 개발자의 길을 포기했다는 글을 보았다.\n예전에 비슷한 피드백을 받아본 입장에서 한 두명의 의견으로 본인이 선택한 길을 포기하는 것이 너무 안타까워 이메일로 내 생각을 전달드렸다.\n개발자 되기 좋은 성향이 따로 있다고 생각하진 않는다.\n어떤 특성과 강점을 가진 개발자가 있을 뿐이지, 개발자에겐 어떤 재능이 무조건 있어야 한다고 생각하진 않는다.\n다만, 그런 내 생각과 달리 누군가는 직업별로 적합한 재능이 있을 수 있다고 생각할 수 있다.\n운명같은 재능과 직업이 만나는 드라마틱한 상황이 나에겐 없다고 생각한다면 좌절감이 든다.\n근데 그 운명이라는게, 재능이라는건 무엇일까?\n대학생 시절 아사다 지로 작가님의 \"창궁의 묘성\" 이라는 작품에 빠져 읽었다.\n창궁의 묘성은 전체적으로 1,2,3권까지만 주변에 추천 한다.\n이토 히로부미를 아시아를 지킨 영웅으로 표현하는 등 후반부 들어서서 동의하지 않는 부분이 너무 많다.\n4권의 경우 급하게 마무리한 티가 많이 난다.\n3권까지는 정말로 몰입감이 높다.\n이 작품에는 크게 2명의 주인공이 등장한다.\n양문수와 이춘운 이라는 인물로, 이 중 이춘운은 마을에서 똥을 주워 팔며 간신히 살아가는 인물이다.\n이 둘은 한 번도 틀린 적이 없다는 점성술사 백태태에게 자신들의 운명을 물어본다.\n양문수의 점괘는 천하의 재상이 되는 운명이였다.\n백태태는 양문수에게는 점괘 그대로 전달한다.\n하지만 며칠 내로 굶어 죽을 운명을 가진 이춘운에게는 너무나 가여워 차마 그대로 말하지 못하고 처음으로 거짓 점괘를 말한다.\n너는 세상의 모든 보물을 다 가질 운명이라고 말이다.\n가난한 이씨 집안의 넷째아들, 샤오리야. 너의 수호성은 오랑캐의 별, 묘성.\n그날 밤, 하늘과 땅을 가르는 북두칠성의 자루부분은 하늘 꼭대기에서 찬란히 빛나는 묘성으로 향하고 있었지.\n그것은 곧 천자가 사는 자미궁을 그 국자로 퍼내라는 명령이 아니겠느냐.\n너는 반드시 천하의 모든 재물과 금은보화를 한 손에 거머쥐게 될 게다.\n두려워마라.\n너에게는 항상 천궁을 다스리는 오랑캐의 별, 묘성이 함께할 테니까\n춘운은 백태태는 절대 틀리지 않는다는 말을 되뇌며 거세를 하고 환관이 된다.\n실제 운명과는 다른 가짜 점괘였지만,\n이춘운은 그걸 진짜라고 믿고 스스로 운명을 개척해나가 결국 보물이 가득한 궁으로 들어가 마침내 권력의 정점에 이른다.\n가짜 점괘를 진짜라고 믿고 개척해나가는 이춘운의 모습이 너무 인상 깊어서 설령 사실이 아니더라도 스스로가 확실하게 믿는다면 그게 곧 운명이 된다고 생각하게 되었다.\n\"진실이든 거짓이든, 믿어버리면 인생이 변해. 나는 내 생각대로 살고 싶어\"\n1권 p291\n어떤 선택이든 남이 아니라, 내가 선택해야 한다.\n남의 의견은 남일 뿐이다.\n나에겐 그걸 잘해낼 힘이 충분히 있다고 믿는 사람들이 해내는 놀라운 일들을 주변에서 많이 보았다.\n그러니 누가 뭐라하든 스스로를 믿어보자.\n\n\n\n\n\n이번 추석은 10일이나 되는 긴 기간입니다.\n저는 요번 기간 동안 부족하다고 생각했던 몇개 강의들을 진득하게 공부 할 예정입니다.\n이춘운처럼 저도 제가 더 훌륭한 리더가 될 수 있다고 믿어보려고요.\n추석에도 열정을 태우고 싶으신 분들이라면 이번 추석에 서로 응원해보는 알찬 시간을 함께 하면 좋겠습니다.\n'향로' 와 함께하는 추석 완강 챌린지\n함께 보면 좋은 글\n개발자 되기 좋은 성향\n소설에 몰입하기",
    "reviews": [],
    "syllabus": [],
    "link": "http://jojoldu.tistory.com/847",
    "pubDate": "Sun, 28 Sep 2025 15:30:31 +0900",
    "creator": "향로 (기억보단 기록을)",
    "categories": [
      "생각정리",
      "개발자",
      "백태태",
      "아사다 지로",
      "이춘운",
      "재능",
      "창궁의 묘성",
      "커리어"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "실패를 통과하는 일",
    "description": "퍼블리 창업자 박소령님의 책 실패를 통과하는 일을 재밌게 읽고 북토크도 다녀왔습니다.\n저는 커리어리에서 큐레이터로 활동을 한 적이 있습니다.\n이후에도 메일을 여러 번 주고받았습니다.\n\n다시 읽어봐도 따뜻하고 배려가 돋보이는 메일\n이런 회사들이 잘 되면 좋겠다 생각했던 것 같습니다.\n하지만 이 메일을 써주신 분은 1개월 뒤에 갑작스레 회사를 떠나게 됐다는 퇴사 메일을 보내주셨습니다.\n회사를 위해 이렇게 열심히 큐레이터들과 커뮤니케이션하다가 갑작스레 해고 통보를 받는다는 건 어떤 느낌일까요? 너무 끔찍해서 상상을 이어가기가 어렵습니다.\n리더라는 자리는 얼마나 고통스러운 자리인가.\n또 한 가지 인상적인 일도 떠오릅니다.\n어제 북토크 말미에서도 이와 비슷한 상황을 봤습니다.\n기왕 책을 썼으니 지금 할 수 있는 일에 최선을 다해보자는 마음이라는 얘기를 들었습니다.\n한 편으로 제 부족한 모습도 다시 한번 반성했습니다.\n책을 써놓고는 마무리는 편집자에게 다 떠넘기고 북토크든 유튜브든 출연하기 싫어했던 제 모습. 부끄러움을 느꼈습니다.\n아니!?\n정말 우연히도 뒷자리에 제 책의 편집자님이 와있는 것 아니겠습니까?\n조금 전에 했던 생각 그대로 미안한 마음을 전달하며 편집자님과 잠시 담소를 나눴습니다. 😁\n집에 걸어오면서 생각했습니다.\n함께 읽으면 좋은 글:\n맙소사, 내가 책을 쓸 줄이야\n회사를 그만두도록 뽐뿌를 준 책들",
    "reviews": [],
    "syllabus": [],
    "link": "https://jeho.page/essay/2025/09/30/passing-failure.html",
    "pubDate": "2025-09-30T07:42:00.000Z",
    "creator": "Unknown",
    "categories": []
  }
]