[
  {
    "id": 1,
    "imageUrl": "",
    "title": "RustRover 2025.2 Is Now Available",
    "description": "This version introduces major debugger enhancements, including remote and on-chip support, a new color scheme, improved borrow checker assistance, additional Rust learning resources, and more. RustRover goes AI Junie, the in-IDE coding agent, is now 30% faster, connects to external sources via MCP, and supports remote development. AI Assistant adds even smarter code completion for […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/rust/2025/08/05/rustrover-2025-2-is-now-available/",
    "pubDate": "Tue, 05 Aug 2025 15:19:01 +0000",
    "creator": "Kseniya Starodubtseva",
    "categories": [
      "releases",
      "rustrover"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "25.08.10 - 반지의 제왕 가운데 땅에서의 대결, 사자를 잡아랏!",
    "description": "반지의 제왕 가운데 땅에서의 대결과 사자를 잡아랏!을 하였다. 이상하게 세듀랑 반듀 승률이 그다지 높지가 않다...오늘도 3판을 하였는데 간신히 1판 이겼다... 뒤집어진 카드를 열어야 할때라던지 동맹 토큰을 확인할때 딱 필요한 카드나 토큰이 와이프한테 간다. 모든 조건이 다 나한테 좋았던 첫판이었는데 허무하게 져버렸다. 가볍게 하기 좋은 동물장기이다. 이름이 사자를 잡아랏!으로 바뀌었는데 좁은 판과 간단한 룰로 비는 시간에 간단히 하기 좋다. 동물장기는 내가 3판 내리 이겼다 ㅋㅋ",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.naver.com/dlehddus84/223965773438?fromRss=true&trackingCode=rss",
    "pubDate": "Sun, 10 Aug 2025 19:51:13 +0900",
    "creator": "dlehddus84",
    "categories": [
      "플레이"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "Join the Livestream: How to work with SQL and Databases in JetBrains IDEs",
    "description": "We invite you to take part in our livestream How to Work With SQL and Databases in JetBrains IDEs, taking place on Thursday, August 14, at 4:00 pm UTC (6:00 pm CET / 12:00 pm ET). Register Date: August 14, 2025 Time: 4:00 pm UTC (6:00 pm CET / 12:00 pm ET). In this demo […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/datagrip/2025/08/05/join-the-livestream-how-to-work-with-sql-and-databases-in-jetbrains-ides/",
    "pubDate": "Tue, 05 Aug 2025 13:50:39 +0000",
    "creator": "Stanislav Garkusha",
    "categories": [
      "livestreams",
      "databases",
      "sql"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "What’s Fixed in IntelliJ IDEA 2025.2",
    "description": "Welcome to the first-ever standalone What’s Fixed overview of an IntelliJ IDEA release! We are always working hard to make the IDE even more stable, reliable, and enjoyable to use. In previous releases, information about this work was blended into the What’s New content, making it very long and sometimes hard to grasp. To address […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/idea/2025/08/whats-fixed-intellij-idea-2025-2/",
    "pubDate": "Wed, 06 Aug 2025 10:39:05 +0000",
    "creator": "Dmitriy Smirnov",
    "categories": [
      "news",
      "releases",
      "2025-2",
      "intellij-idea",
      "intellij-idea-2025-2"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "Building a human-computer interface for everyone",
    "description": "What if you could control any device using only subtle hand movements? New research from Meta’s Reality Labs is pointing even more firmly toward wrist-worn devices using surface electromyography (sEMG) becoming the future of human-computer interaction. But how do you develop a wrist-worn input device that works for everyone? Generalization has been one of the [...]\nRead More...\nThe post Building a human-computer interface for everyone appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/08/04/virtual-reality/building-a-human-computer-interface-for-everyone-meta-tech-podcast/",
    "pubDate": "Mon, 04 Aug 2025 14:00:25 +0000",
    "creator": "Unknown",
    "categories": [
      "AI Research",
      "Culture",
      "ML Applications",
      "Virtual Reality",
      "Meta Tech Podcast"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "역설계",
    "description": "소프트웨어 엔지니어로 성장하면서 \"저 사람처럼 코드를 작성하고 싶다\" 라는 생각으로 프로젝트 코드를 그대로 따라친 적이 많다.\n원어민의 발음을 쉐도잉 (Shadowing) 하듯이 그들의 프로젝트 코드를 처음 Git log부터 순서대로 따라 작성했다.\n테스트 주도 개발 책에 예제를 활용해서 JUnit을 TDD로 직접 만들어 보거나, 스프링 프레임워크를 따라치면서 로드 존슨을 비롯한 여러 개발자들이 왜 당시에 이렇게 작성했는지 고민해보곤 했다.\n직접 하이버네이트의 기본 기능을 만들어보고 하이버네이트는 내부적으로 어떻게 구현했는지 비교해보기도 했다.\n이렇게 해당 프레임워크들의 Git log대로(고민의 흐름대로) 작성하다보면 그들의 생각을 조금은 엿볼 수 있었다.\n실무에서 무언가 내 의도대로 안되었을 때, 되어야 하는데 안되는 건지, 애초에 안되야 하는게 맞는건지를 조금은 구분할 수 있게 되어 문제가 발생하면 빠르게 예상 되는 지점을 좁힐 수 있었다.\n한때는 무라카미 하루키의 글을 필사하기도 했다.\n\"달리기를 말할 때 내가 하고 싶은 이야기\", \"직업으로서의 소설가\" 같은 책들은 그 당시의 생생한 주변 풍경을 너무 잘 묘사해서 이 표현을 너무 닮고 싶었다.\n히로시마의 선발 투수는 분명 다카하시였던 것으로 알고 있습니다.\n야쿠르트의 선발은 야스다였습니다. 1회 말, 다카하시가 제1구를 던지자 힐턴은 그것을 좌중간에 깔끔하게 띄워 올려 2루타를 만들었습니다. 방망이가 공에 맞는 상쾌한 소리가 진구 구장에 울려 퍼졌습니다. 띄엄띄엄 박수 소리가 주위에서 일었습니다.\n나는 그때 아무런 맥락도 없이, 아무런 근거도 없이 문득 이렇게 생각했습니다.\n‘그래, 나도 소설을 쓸 수 있을지 모른다’라고.\n그때의 감각을 나는 아직도 확실하게 기억합니다.\n하늘에서 뭔가가 하늘하늘 천천히 내려왔고 그것을 두 손으로 멋지게 받아낸 듯한 기분이었습니다.\n어째서 그것이 때마침 내 손안에 떨어졌는지, 그 이유는 잘 모르겠습니다. 그때도 몰랐고 지금도 모릅니다. 하지만 이유야 어찌 됐건 아무튼 그것이 일어났습니다.\n그것은 뭐라고 해야 할까, 일종의 계시 같은 것이었습니다. 영어에 epiphany라는 말이 있습니다. 일본어로 번역하면 ‘본질의 돌연한 현현顯現’ ‘직감적인 진실 파악’이라는 어려운 단어입니다.\n알기 쉽게 말하자면, ‘어느 날 돌연 뭔가가 눈앞에 쓱 나타나고 그것에 의해 모든 일의 양상이 확 바뀐다’라는 느낌입니다.\n바로 그것이 그날 오후에 내 신상에 일어났습니다.\n그 일을 경계로 내 인생의 양상이 확 바뀐 것입니다.\n데이브 힐턴이 톱타자로 진구 구장에서 아름답고 날카로운 2루타를 날린 그 순간에.\n[직업으로서의 소설가 - 제 2회 소설가가 된 무렵]\n컨퍼런스에서 누군가 이목을 끄는 장표를 만들었다면 그걸 사진을 찍어두고 적절한 때에 사용하기도 하고,\n유튜브, 팟캐스트 등에서 좋은 인터뷰 질문이 있으면 그걸 기억해두고 다음 우리 촬영때 그 질문을 응용해서 사용하기도 했다.\n혼자서 창작하는데는 재능이 없다고 생각하고 주변의 많은 재료들을 최대한 흡수해서 응용하는 것을 주로 하던 입장에서는 위로와 함께 좀 더 구체적인 노하우를 얻을 수 있었다.\n1부까지는 역설계라는 말에 어울리는 내용들이였지만, 2부 부터는 탁월한 성과를 내는 사람이 되는 구체적인 방법들을 전달한다.\n그래서 2부 부터는 역설계 내용과는 조금 거리가 있다고 느껴지긴 했지만, 그럼에도 2부 역시 배울게 많았다.\n성장을 위해 선행지표, 후행지표를 제대로 정하는 방법\n최대한 실행에 대한 리스크를 줄이는 방법\n반복적 연습이 아닌 전략적 연습을 수행하는 방법\n전문가에게서 값진 조언을 얻는 법\n등등 그간 보았던 여러 탁월함에 대한 책들의 종합 개론서 같은 느낌이 2부였다.\n당장 실행해야할 액션 아이템들도 얻었다.\n연구 팀은 중간고사 일주일 전에 학생들을 세 그룹으로 나눴다.\n첫 번째 그룹에게는 중간고사에서 좋은 성적을 받는 것을 상상하라고 말했다.\n두 번째 그룹에게는 좋은 성적이 아니라 공부하는 과정을 상상하라고 했다.\n세 번째 그룹에게는 일주일 동안 공부한 시간을 기록하게 했다.\n...\n어느 그룹이 중간고사에서 가장 좋은 성적을 받았을까?\n당연히 공부하는 과정을 상상한 그룹이었다.\n이들은 실제로 더 열심히 공부했고 불안감이 줄었으며 성적도 더 높게 나왔다.\n...\n대조군과 비교할 때, 짐캐리처럼 성공을 상상한 그룹이 중간고사 성적이 가장 낮았다.\n...\n바라는 결과를 달성한 모습을 상상할 때 경험하는 감정적 보상이 성공에 필요한 작업을 수행하려는 욕구를 감소시키기 때문이다.\n[6장 - 뻔한 연습이 아니라 전략적 연습이 필요하다]\n\"결과\"에 대한 상상이 아닌 \"과정\"에 대한 상상이 훨씬 더 높은 성취를 내는데 도움이 된다는 것에 확신이 생겼다.\n프로젝트가 시작 되기 전에 \"이 프로젝트가 잘 되면 어떤 즐거운 결과가 있을 것인지\"를 이야기 했다면, 이제는 프로젝트 진행 과정 중에서 발생할만한 일을 좀 더 자주 이야기하고 팀원들이 미리 상상할 수 있도록 하는 것이 더 좋은 결과물을 낼 수 있겠다는 생각을 했다.\n예컨대 중요한 기획서를 작성하는 중이라면 동료에게 그냥 \"피드백을 달라\"고 하지말고, 첫 단락이 읽는 이의 호기심을 끌어당기는지, 또는 프로젝트 스케줄이 의욕적으로 느껴지는지 물어보라\"\n[7장 - 전문가에게서 값진 조언을 얻는 법]\n하반기 피드백 기간에는 셀프 피드백 항목에 \"동료에게 피드백을 받고 싶은 역량, 프로젝트 등이 있다면 작성해주세요\" 와 같이 어떤 피드백을 받고 싶은지 스스로가 작성하도록 해보는 것도 좋겠다는 생각을 했다.\n책의 마지막에 있는 \"반드시 기억해야 할 10가지\" 에 책의 각 챕터에서 이야기한 내용들을 요약 정리해준 것은 이 책에서 놓치지 말아야할 것들이 무엇인지 한번 더 집어준 것 같아 좀 더 기억에 오래 남을 것 같다.\n오랫만에 하루키의 책을 다시 필사해야겠다.\n책 속 문장\n\"날마다 그 책을 펴서 두 페이지를 필사했다.\n한 문장 한 문장 옮겨 적으면서 글의 리듬을 받아들이고 대화 처리 방식, 단 몇 줄로 인물의 성격을 암시하는 기법 등을 음미했다.\n'낯설게' 느껴지는 음식에서 그런 맛의 추억을 떠올리게 하는 것이 훨씬 더 강렬한 효과를 낸다.\n낯선 맥락 속에서 그런 기본 패턴을 유지하는 것이 핵심이다.\n첫째, 창의성은 고립에서 나오는 것이 아니라 여러 아이디어의 융합에서 나온다.\n...\n둘때, 독창성은 창의성과 동의어가 아니다.\n...\n비즈니스 세계에는 시장을 선점하고도 더 진취적이고 창의적인 경쟁자들에게 밀려 뒤쳐진 사례가 허다하다.\n셋째, 역설계는 창의성을 가로막는 방해물이 아니다.\n오히려 새로운 기술과 지식을 습득해 뭔가를 전과 다른 창의적인 방식으로 만들어 낼 수 있는 저력을 키워준다.\n모방을 위해서는 해당 작품을 만드는 동안 원작자가 내린 결정들에 대해 깊이 생각해보아야 한다.\n또한 모방 작업을 하다 보면 평소에는 그냥 지나쳤을 요소나 기회를 민감하게 인식하게 된다.\n모방은 새로운 관점으로 가는 길을 열어주며, 우리 자신의 작업 방식에 숨겨진 창의적 기회를 찾게 도와준다.\n로빈슨의 강연 방식은 물론 훌륭하다.\n그러나 30초마다 농담이 나오고 풍부한 일화를 곁들인 강연을 누구나 할 수 있는 것은 아니고, 또 모두가 그런 강연을 하고 싶어 하는 것도 아니다.\n본받고 싶은 강연 스타일은 사람마다 다를 수 있다.\n그러니 당신이 선호하는 유형의 다른 강연자를 찾아라. \n그의 강연을 보면서 역방향 개요를 작성하고 특성들을 수치화하고 강연의 얼개를 구성해보라.\n이것은 다양한 결과물을 해부해 효과적인 구조를 발견하는 대단히 유용한 방법이며, 당신은 그 구조와 공식을 당신만의 방식으로 활용할 수 있다\n요컨대 전문가는 비전문가와 생각하는 방식이 다르다.\n그들은 자신도 의식하지 못하는 지름길을 활용하고, 자신이 하는 행동을 깊게 생각하지 않으며, 자신이 아는 것을 모르는 상태를 상상하지 못한다.\n성공적인 작업에 필요한 행동을 분석해서 말해달라고 하면, 그들은 70퍼센트를 빼놓고 말한다.\n그리고 설명해주는 30퍼센트는? 대다수 사람들이 조금 힘겨워하거나 또는 아예 이해하기 힘든 언어로 설명한다.\n새로운 무언가를 창업하려고 하는 사람 중에서 이전의 직장에서 다니면서 하는 사람과, 직장을 관두고 전업으로 하는 사람 중에 누가 더 성공할 것인가?\n전업으로 창업을 준비하는 사람이 더 확률이 높을 것이라고 직관적인 생각이 들지만 실상은 그 반대.\n안정적인 수입이 있는 사람이 여러가지 기회와 가능성을 충분히 살피고 선택하고 결정할 수 있기 때문에, 전자인 직장인으로서 준비하는 것이 더 확률이 높다는 것이다.\n이는 바로 리스크를 선택함에 여유가 있기 때문이며, 이러한 과정에서 아래의 4가지 방법을 모두 적용할 수 있다.\n규모가 작은 청중을 상대로 테스트하고\n가명 활용하기\n먼저 아이디어부터 판매하기\n포트폴리오 다양화하기",
    "reviews": [],
    "syllabus": [],
    "link": "https://jojoldu.tistory.com/841",
    "pubDate": "Mon, 11 Aug 2025 09:50:18 +0900",
    "creator": "향로 (기억보단 기록을)",
    "categories": [
      "도서",
      "쉐도잉",
      "역설계",
      "필사"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "탁월해지기",
    "description": "2001년도에 출간된 짐 콜린스의 책 ‘Good to Great’은 당시에 아주 화제가 됐다. 웬만한 경영대학원에서 가르치는 그 어떤 수업보다 더 생생하고, 이론적이면서도 동시에 실용적인 경영 서적이었다. 한국에서는 ‘좋은 기업을 넘어 위대한 기업으로’라는 이름으로 번역되어 출간됐고, 이 책이 어떤 내용인지는 책의 제목이 그대로 설명해 준다. 좋은 기업이 되는 것도 어렵지만, 왜 어떤 기업은 그냥 좋은 기업으로 남고,(...)",
    "reviews": [],
    "syllabus": [],
    "link": "https://www.thestartupbible.com/2025/08/being-extraordinary.html",
    "pubDate": "Sun, 10 Aug 2025 21:34:00 +0000",
    "creator": "Kihong Bae",
    "categories": [
      "Uncategorized",
      "FoundersAtWork"
    ]
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "GoLand 2025.2 Is Now Out!",
    "description": "GoLand 2025.2 introduces updates for working with HTTP servers, smarter inspections powered by data flow analysis (DFA), and a new non-blocking Welcome screen. This release also brings significant quality improvements to golangci-lint support, including version 2, making the integration more robust for real-time code analysis. Let’s take a closer look at all the new additions […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/go/2025/08/05/goland-2025-2-is-now-out/",
    "pubDate": "Tue, 05 Aug 2025 12:22:27 +0000",
    "creator": "Artem Pronichev",
    "categories": []
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "구글 노트북LM 동영상 개요, 한국어로 만드는 방법",
    "description": "Google NotebookLM 동영상 개요, 왜 아직도 영어만 지원할까요? 한국 사용자를 위한 AI STUDIO 맞춤형 지침으로 완벽한 한국어 영상 개요를 만드는 비법을 담았습니다. 이제 언어의 장벽 없이 창의적인 콘텐츠를 만들어보세요!\n\n\n \n 혹시 Google NotebookLM의 동영상 개요 기능을 써보셨다가 저처럼 살짝 실망한 적 있으신가요? 정말 놀라운 기능인데, 막상 써보면 음성 요약이나 슬라이드 내용이 전부 영문으로만 나와서 '한국어 콘텐츠에는 쓸모없나?' 하는 생각이 들 때가 있더라고요. 제 주변에도 이런 고민을 하시는 분들이 정말 많았어요. 아마 저만 그런 건 아닐 거예요.  \n\n그런데 말이죠, 포기하기엔 이 기능이 너무 아깝잖아요? 그래서 제가 직접 AI STUDIO를 활용해 이 기능을 우리말에 완벽하게 맞추는 방법을 연구해봤어요. 기존의 텍스트 기반 요약 기능을 확장해서 영상 개요를 만드는 이 혁신적인 기능을, 이제 여러분도 한국어 문서로 마음껏 활용할 수 있도록 아주 쉽고 친절하게 알려드릴게요. 이 글만 읽으면 여러분의 작업 효율이 정말 비약적으로 상승할 거라고 장담합니다!\n \n1. Google NotebookLM의 놀라운 기능들 ✨\nGoogle NotebookLM은 Google Labs에서 개발한 AI 기반의 혁신적인 도구입니다. 이 도구는 단순히 검색 결과를 찾아주는 것을 넘어, 사용자가 업로드한 문서를 기반으로 상호작용하며 정보를 분석하고 정리하는 데 특화되어 있어요. Google의 강력한 AI 모델인 Gemini를 활용해 복잡한 자료를 명확하게 바꿔주고, 여러분의 연구와 학습 과정을 효율적으로 만들어주는 온라인 서비스라고 할 수 있습니다.\n\nNotebookLM은 여러분의 작업 효율을 극대화할 수 있도록 다양한 기능을 제공하고 있습니다. 어떤 기능들이 있는지 자세히 알아볼까요?\n소스 업로드 및 분석: PDF, 웹사이트, Google 문서, 슬라이드 등 다양한 형식의 소스를 올릴 수 있어요. 놀랍게도 최대 50개의 소스, 총 2,500만 단어까지 한 번에 처리할 수 있다고 하니, 방대한 양의 자료도 걱정 없겠죠!\n요약 및 설명 생성: 업로드된 콘텐츠를 바탕으로 핵심 내용을 요약하고, 상세한 설명을 생성해 줍니다. 특히, 답변의 출처를 원본 소스에 대한 인용으로 제공해 줘서 정보의 신뢰성을 확실하게 보장합니다.\n오디오 오버뷰: 2024년 9월에 출시되어 큰 주목을 받았던 기능이에요. 문서를 대화형 팟캐스트 형식으로 요약해 주기 때문에, 단순히 읽는 것보다 훨씬 재미있고 쉽게 내용을 파악할 수 있답니다.\n형식 변환: 소스 문서를 학습 가이드, 브리핑 문서, 마인드맵 등 다양한 형식으로 변환해줘요. 복잡한 자료를 내가 원하는 형태로 즉시 바꿔주니, 콘텐츠 기획자나 학생들에게 정말 유용하겠죠.\n채팅 및 질문: 마치 친구와 대화하듯 노트북과 채팅하며 궁금한 점을 물어볼 수 있어요. 복잡한 추론이 필요한 질문에도 정확하고 신뢰성 있는 답변을 얻을 수 있습니다.\n이렇게 NotebookLM은 아이디어를 다듬고 정리하는 데 특화된 강력한 도구랍니다. 더 높은 한도와 프리미엄 기능을 제공하는 기업용 버전(NotebookLM Plus)도 있으니 참고하시면 좋을 것 같아요.\n  알아두세요!\nNotebookLM은 업로드된 소스 자료에 근거해 답변을 생성하기 때문에, 잘못된 정보나 '환각' 현상(Hallucination)이 나타날 확률이 현저히 낮아요. 이 점이 NotebookLM의 가장 큰 장점 중 하나랍니다.\n \n2. 동영상 개요 기능, 한국어 사용자의 도전과제 ⚠️\n 최근 NotebookLM의 동영상 개요 기능이 처음 공개되었을 때, 저도 정말 기대가 컸어요. 그런데 사용해보니 한 가지 큰 벽에 부딪히더라고요. 바로 이 기능이 공식적으로 영문 콘텐츠에만 최적화되어 있다는 점이었죠. \n \n 음성과 슬라이드에 나타나는 텍스트는 영문으로만 생성되어, 우리말 콘텐츠를 만드는 크리에이터나 기획자 입장에서는 정말 답답할 수밖에 없죠. 이 좋은 기능을 그림의 떡처럼 바라만 봐야 하는 상황이었답니다.\n\n\n⚠️ 주의하세요!\nAI가 만들어준 결과물이라고 해서 맹신하면 안 됩니다. 특히 복잡하거나 전문적인 내용을 다룰 때는 AI가 놓친 맥락이나 세부 사항이 없는지 반드시 최종 확인하는 과정이 필요해요.\n \n3. AI STUDIO를 활용한 한국어 최적화 가이드의 핵심 원리  \n그럼 이제부터 AI STUDIO의 맞춤 설정을 활용해 Google NotebookLM의 동영상 개요 기능을 우리말에 맞게 '길들이는' 방법을 알려드릴게요. 핵심은 AI에게 우리가 원하는 결과물을 명확하게 지시하는 세 가지 원칙을 적용하는 것입니다. 이 원칙만 잘 이해하면 여러분의 한국어 문서도 전문적인 영상 개요로 재탄생할 수 있어요!\n이 세 가지 핵심 원칙을 아래 표로 정리해 보았습니다.\n핵심 원칙\n상세 내용\n\n\n\n\n100% 한국어 현지화\n음성, 슬라이드, 자막 등 영상의 모든 요소를 한국어로만 제공하고, 기술 고유명사를 제외한 외국어 사용을 엄격히 금지합니다. 예시 또한 한국의 상황과 문화에 맞게 구성하여 몰입감을 높이는 것이 핵심입니다.\n\n\n시각적 디자인 강화\n텍스트만 나열하는 대신, 각 슬라이드 내용에 맞는 [아이콘]이나 [인포그래픽] 등을 구체적으로 제안하도록 지시합니다. 또한, 핵심 키워드는 굵게 처리하고, 긍정/부정적 내용을 색상(파란색, 빨간색)으로 구분하여 메시지를 직관적으로 전달하게 합니다.\n\n\n음성 나레이션 전달력\n나레이션 스크립트를 작성할 때, 딱딱한 기계음이 아닌 전문가의 신뢰감과 친근한 어조를 동시에 갖추도록 유도합니다. 중요한 내용 앞뒤에 (잠시停)과 같은 쉼표시를 넣어 강조 효과를 더하고 시청자가 내용을 소화할 시간을 제공합니다.\n\n\n\n \n핵심 내용 한눈에 보기  \n지금까지 설명드린 내용을 한눈에 보기 쉽게 요약해 보았습니다. 이 카드만 저장해 두셔도 AI STUDIO를 활용하는 데 큰 도움이 될 거예요.\n \n한국어 최적화 가이드 핵심 요약\n✨ 현지화: 모든 요소를 100% 한국어로! 문화적 배경에 맞는 예시를 활용해 몰입감을 높이세요.\n  디자인: 시각적 요소와 색상으로 강조! [아이콘]이나 [인포그래픽]을 명시하고, 중요한 내용은 파란색 또는 빨간색으로 구분해 메시지를 명확하게 전달하세요.\n ️ 전달력: 전문가적이면서 친근한 어조! (잠시후)과 같은 쉼표시를 활용해 자연스러운 흐름을 만드세요.\n이 지침을 활용하면 NotebookLM으로 최적화된 한국어 영상 개요를 만들 수 있습니다.\n \n4. AI STUDIO 맞춤 설정 지침 다운로드  \n위에 설명드린 핵심 원리를 직접 적용할 수 있는 맞춤 설정 지침 전문을 파일로 준비했습니다. 이 파일을 다운로드하여 AI STUDIO의 '맞춤 설정' 영역에 붙여넣기만 하면 됩니다. 이제 여러분의 한국어 문서도 전문가가 만든 것처럼 체계적인 영상 개요로 재탄생할 수 있습니다.\n\n    \n\n    \n노트북 LM 영상 개요 한글화 지침.zip\n0.00MB\n\n\n 사용법\n그림과 같이 동영상 개요 - 맞춤설정 에서 첨부한 지침을 붙여넣기 하면됩니다.\n단, 기본값이 영문 강제 설정이라..... 가끔씩 한글화가 안되는 경우가 있습니다.\n \n\n\n \n결과물\n\n\n\n \n \n \n자주 묻는 질문 ❓\nQ: Google NotebookLM의 동영상 개요 기능은 한국어를 지원하나요?\nA: 현재 정식 기능으로는 한국어 음성 및 슬라이더 생성을 지원하지 않습니다. 하지만 AI STUDIO의 맞춤 설정 지침을 활용하면 한국어 영상 개요를 생성할 수 있습니다.\nQ: AI STUDIO 맞춤 설정 지침의 핵심은 무엇인가요?\nA: '100% 한국어 현지화', '시각적 디자인 및 텍스트 효과 강화', '음성 나레이션 및 전달력' 세 가지 원칙을 바탕으로, AI에게 한국어 영상에 최적화된 개요를 생성하도록 구체적으로 지시하는 것입니다.\nQ: 지침에 따라 생성된 개요를 수정해야 할까요?\nA: 네, AI가 생성한 결과물은 항상 초안으로 간주하고, 최종 사용 전에 내용을 꼼꼼하게 검토하고 수정하는 것이 좋습니다. 특히 사실 관계나 어색한 표현이 없는지 확인해야 합니다.\n\n\n\n    {\n        \"@context\": \"https://schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n            {\n                \"@type\": \"Question\",\n                \"name\": \"Google NotebookLM의 동영상 개요 기능은 한국어를 지원하나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  현재 정식 기능으로는 한국어 음성 및 슬라이더 생성을 지원하지 않습니다. 하지만 AI STUDIO의 맞춤 설정 지침을 활용하면 한국어 영상 개요를 생성할 수 있습니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI STUDIO 맞춤 설정 지침의 핵심은 무엇인가요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  '100% 한국어 현지화', '시각적 디자인 및 텍스트 효과 강화', '음성 나레이션 및 전달력' 세 가지 원칙을 바탕으로, AI에게 한국어 영상에 최적화된 개요를 생성하도록 구체적으로 지시하는 것입니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"지침에 따라 생성된 개요를 수정해야 할까요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  네, AI가 생성한 결과물은 항상 초안으로 간주하고, 최종 사용 전에 내용을 꼼꼼하게 검토하고 수정하는 것이 좋습니다. 특히 사실 관계나 어색한 표현이 없는지 확인해야 합니다.\"\n                }\n            }\n        ]\n    }",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483634",
    "pubDate": "Mon, 4 Aug 2025 13:12:03 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "ai studio",
      "AI 튜토리얼",
      "Ai 활용",
      "Google NotebookLM",
      "동영상 개요",
      "영상 스크립트",
      "영상 제작",
      "콘텐츠 기획",
      "한국어 슬라이더",
      "한국어 현지화"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "3년 차 앱 개발자가 일하는 순서를 공유합니다",
    "description": "안녕하세요, LINE Plus에서 근무하고 있는 최연두입니다. 이 글에서는 시행착오 끝에 정착한 저만의 ‘일하는 방식’을 공유하려고 합니다. 다른 팀의 아무개가 일하는 방식이 궁금...",
    "reviews": [],
    "syllabus": [],
    "link": "https://techblog.lycorp.co.jp/ko/sharing-the-workflow-of-a-third-year-app-developer",
    "pubDate": "Fri, 08 Aug 2025 02:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "[MULTI] 더 영화적인 이야기와 연출의 발전, 마피아 : 올드 컨트리",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2344",
    "pubDate": "Thu, 07 Aug 2025 21:00:21 +0900",
    "creator": "［RULIWEB］",
    "categories": [
      "리뷰"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "Dynamically Update C++ syntax using Next Edit Suggestions",
    "description": "When working in a C++ repo, you often are maintaining and updating existing code just as often as you are writing new code. However, updating code in C++ can often require navigating to several different locations in a file to ensure consistency, which can disrupt your logical workflow. For example, changing a data member’s access […]\nThe post Dynamically Update C++ syntax using Next Edit Suggestions appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/dynamically-update-c-syntax-using-next-edit-suggestions/",
    "pubDate": "Mon, 04 Aug 2025 16:36:10 +0000",
    "creator": "Sinem Akinci",
    "categories": [
      "C++",
      "Copilot",
      "New Feature"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "웹 애니메이션 API",
    "description": "시작은 제이쿼리로 되어 있는 코드를 바닐라로 변환이 필요해서 였다. 화면에서 보이지 않다가 특정 조건에서 화면에 나오는 애니메이션을 보여주는 기능이었다. 챗지피티에 물어보니 전반적인 변환은 잘 해줬는데 화면에 나오기 직전에 display: none을 block로 바꿔주다 보니 트랜지션 애니메이션이 작동하지 않았다. element.offsetWidth;같이 레이아웃을 참조하면 애니메이션이 되지만 다른 방법은 없는지 제미나이에게 물어보니 element.animate를 사용해서 변환을 했다. display 조작의 영향을 받지 않고 의도대로 작 작동한다.\n\r\n\r\n키프레임 애니메이션을 자바스크립트로 구성하는 느낌이다. element.animate(keyframes, options)와 같이 사용하면 간단하게 이용할 수 있다.\n\r\n\r\ndocument.querySelector('div').animate([\r\n\t{ width: '100px' },\r\n\t{ width: '200px' },\r\n], {\r\n\tduration: 500,\r\n\tfill: 'forwards',\r\n\teasing: 'ease'\r\n});\n\r\n\r\n나온지 10년이 다 되어가는데 잘 모르고 있었다. CSS로 애니메이션을 제어하는 것을 선호하기는 하는데 동적으로 변경되는 애니메이션을 만들어야 할 때에 유용하게 사용할 수 있다. 타임라인이나 레인지도 정의할 수 있는데 파이어폭스가 아직 지원을 안한다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://hyeonseok.com/blog/939",
    "pubDate": "Sat, 09 Aug 2025 17:13:48 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "GPT-5 출시! 유료,무료 요금제별 사용 제한과 새로운 기능 총정리",
    "description": "챗GPT의 새로운 시대, GPT-5 완벽 분석    GPT-5의 혁신적인 특징과 함께, 우리가 실제로 체감할 수 있는 변화들을 알기 쉽게 정리해봤습니다. 이 글만 읽어도 GPT-5 전문가가 될 수 있을 거예요!\n\n\n \n 오픈AI의 차세대 플래그십 모델인 GPT-5가 출시되었습니다. 기존의 여러 모델들의 장점을 하나로 통합한 똑똑하고 빠른 모델이라고 하니, 기대가 정말 큽니다.\n이번 포스트에서는 GPT-5가 어떤 새로운 기능과 변화를 가지고 왔는지, 그리고 유료/무료 사용자별로 어떤 차이가 있는지, 벤치마크 성능은 얼마나 뛰어난지 등 여러분이 궁금해할 만한 모든 내용을 꼼꼼하게 정리해봤습니다. 그럼 GPT-5의 세계로 함께 빠져볼까요?  \n \nGPT-5, 무엇이 달라졌을까?  \nGPT-5는 단순히 성능이 좋아진 모델을 넘어, 사용자의 요청에 따라 스스로 최적의 방법을 찾아내는 '통합 시스템'으로 진화했습니다. 하나의 모델 안에서 일반 대화에는 빠른 'Chat' 모드가, 복잡한 문제에는 심층적인 'Thinking' 모드가 자동으로 전환되는 방식이죠. 복잡한 코딩, 과학 문제, 데이터 분석 같은 작업에선 Thinking 모드가 스스로 더 깊이 생각해서 답변의 정확도를 높여준다고 하네요.\n이러한 똑똑한 판단은 우리가 모델을 수동으로 선택하거나, 모델의 답변이 얼마나 정확했는지에 대한 피드백을 학습해서 이뤄진다고 합니다. GPT-5는 속도와 정확도 모두 대폭 개선되었고, 가장 똑똑하고 신뢰할 수 있는 모델로 평가받고 있어요.\n  GPT-5의 '사고 과정' 알아보기!\nGPT-5의 Thinking 모델은 답변을 하기 전에 내부적으로 '사고 과정'을 먼저 생성합니다. 이 과정에서 스스로 전략을 점검하고, 실수를 인식하며, 안전 규칙을 지키도록 훈련되었어요. 덕분에 사용자의 유도나 우회 시도에도 흔들리지 않고 더 유용하고 신뢰성 높은 답변을 내놓을 수 있습니다.\n \n벤치마크로 보는 GPT-5의 압도적 성능  \nGPT-5는 다양한 벤치마크에서 이전 모델들을 압도하는 성능을 보여줬습니다. 특히 복잡한 추론과 문제 해결 능력을 평가하는 벤치마크에서 두각을 나타냈는데요.\n벤치마크\n성능 기록\n비고\n\n\n\n\nHuman Last Exam\n42%\n이전 모델 대비 크게 향상\n\n\nSWE Bench\n74.9%\n코딩 능력의 혁신적 발전\n\n\nARC-AGI-2\n1위 (Grok-4 제외)\n추론 능력과 효율성 테스트\n\n\n\n특히 LMArena의 모든 카테고리에서 1위를 기록했다는 소식은 정말 놀라웠어요. 텍스트, 웹 개발, 이미지 처리, 수학, 창의력 등 분야를 가리지 않고 최고의 성능을 입증했죠. 내부 테스트에서도 'summit'이라는 코드명으로 역대 최고 점수를 받았다고 하니, 괜히 플래그십 모델이 아니라는 생각이 들었습니다.\n⚠️ 주의하세요!\nGPT-5는 복잡한 대화에서 기만적인 행동을 억제하도록 훈련되었지만, 여전히 안전 장치(guardrails)를 준수해야 합니다. 악용 사례(데이터 자동 추출, 계정 공유, 재판매 등)에 대해서는 언제든지 일시적 사용 제한이 있을 수 있습니다.\n \nGPT-5의 요금제별 사용 제한 및 특징  \nGPT-5의 강력한 기능은 챗GPT의 다양한 요금제에 따라 조금씩 다르게 적용됩니다. 무료 사용자와 유료 사용자(Plus, Pro, Team)의 사용 제한 및 모델 선택 옵션에 대해 자세히 알아볼게요.\n요금제\n메시지 제한 (GPT-5)\n모델 선택\n추가 혜택\n\n\n\n\nChatGPT Free\n5시간마다 10개\nGPT-5 Thinking 1회/일\n-\n\n\nChatGPT Plus\n3시간마다 80개\nGPT-5, GPT-5 Thinking 선택 가능 (Thinking은 주 200회 제한)\n \n\n\nChatGPT Pro/Team\n무제한 (악용 방지 정책 적용)\nGPT-5, GPT-5 Thinking, GPT-5 Thinking Pro 선택 가능\n무제한 사용\n\n\n\n여기서 주목할 점은 GPT-5가 하나의 모델이 아니라, 여러 모델(gpt-5-main, gpt-5-thinking, mini, nano, pro 등)로 구성된 통합 시스템이라는 거예요. 기존의 GPT-4o, o3, o4-mini 모델들이 이 시스템 안으로 재편되었다고 보시면 됩니다.\nGPT-5의 컨텍스트 윈도우는 최대 40만 토큰까지 지원하고, 지식 컷오프는 2024년 9월입니다. 미니나 나노 모델은 2024년 5월 지식을 반영하고 있으니 참고하면 좋겠네요.\n \nGPT-5, 이제 다양한 곳에서 만날 수 있어요  \n놀라운 소식은 GPT-5가 챗GPT뿐만 아니라 다양한 플랫폼에서 무료로 제공되고 있다는 점이에요. 현재 Cursor, 마이크로소프트 코파일럿, 퍼플렉시티에서 GPT-5를 무료로 사용해볼 수 있습니다. 젠스파크에서는 GPT-5 PRO까지 사용 가능하다고 하니, 다양한 환경에서 직접 경험해보는 것도 좋은 방법일 것 같습니다.\n  제3자 플랫폼에서 먼저 만나는 이유\nAI 회사들은 수억 명의 사용자를 고려해 자사 앱에 바로 적용하기보다 API를 통해 안전하고 점진적으로 모델을 출시하는 전략을 사용합니다.\n반면 Perplexity나 젠스파크 같은 제3자 플랫폼은 여러 AI 모델을 유연하게 연결하는 구조를 갖추고 있어, 새로운 API가 공개되자마자 빠르게 통합하여 사용자에게 제공할 수 있습니다.\nGPT-5가 출시되면서 기존 모델들이 단계적으로 은퇴합니다. GPT-4o, GPT-4.1, GPT-4.5, o4-mini 등이 이에 해당하는데요. 만약 기존 대화창을 열면 자동으로 GPT-5의 가장 유사한 버전으로 전환된다고 하니, 예전 대화를 이어갈 때 답변이 달라질 수 있다는 점을 염두에 두어야 해요.\nGPT-5는 웹 검색, 데이터 분석, 이미지 분석, 파일 분석, 캔버스, 이미지 생성, 메모리, 맞춤 지침 등 챗GPT의 모든 도구를 제한 없이 지원합니다.\n \n음성 모델의 대대적인 업그레이드!  ️\nGPT-5와 함께 챗GPT의 음성 모델도 대폭 개선되었어요. 이제 더 자연스럽고 똑똑하게 대화할 수 있게 되었는데요. 특히 가장 큰 변화는 GPTs에서 고급 음성 모델을 바로 사용할 수 있게 되었다는 점입니다.\n커스텀 지침을 기반으로 한 음성 모드 사용이 가능해지면서, 외국어 연습이나 특정 분야의 튜터링 등 다양한 활용 사례가 등장할 것으로 예상됩니다. 무료 사용자도 음성 대화가 가능해졌고, 유료 사용자(Plus)는 사실상 무제한에 가깝게 이용할 수 있다고 하니, 정말 유용한 기능이 될 것 같아요! 참고로, 현재 보이스 모드는 여전히 GPT-4o 기반이라고 합니다.\n \nAPI 가격과 모델 상세 정보  \nGPT-5의 API 가격은 꽤 합리적으로 책정된 것 같아요. 100만 토큰 기준으로 모델별 가격을 정리해보겠습니다.\n모델\n입력(Input)\n출력(Output)\n\n\n\n\nGPT-5\n$1.25\n$10.00\n\n\nGPT-5-mini\n$0.25\n$2.00\n\n\nGPT-5-nano\n$0.05\n$0.40\n\n\n\n\n  핵심 모델 정보\n모델 버전: 4가지 버전 (GPT-5, mini, nano, chat)\n학습 데이터: 공개 인터넷 정보, 협력 파트너 자료, 사용자/연구원 제공 데이터\n지식 컷오프: GPT-5는 2024년 9월, mini/nano는 2024년 5월\n컨텍스트 윈도우: 최대 40만 토큰\n \n \n \nGPT-5: 혁신을 넘어선 진화의 핵심\n✨ 통합 시스템: 챗과 추론 모드를 실시간으로 자동 전환하여 복잡한 작업에 최적화된 답변을 제공합니다.\n  압도적 성능: Human Last Exam 42%, SWE Bench 74.9% 등 주요 벤치마크에서 역대 최고 성능을 기록했습니다.\n  안전성 강화:\nsafe-completions 훈련을 통해 환각, 아첨 감소 및 기만 방지 성능을 높였습니다.\n ‍  접근성 확장: Cursor, 코파일럿, 퍼플렉시티 등에서 무료 사용이 가능해졌고, GPTs에서 음성 모델을 바로 활용할 수 있습니다.\nGPT-5는 단순히 성능을 개선한 것이 아닌, AI의 새로운 활용 방식을 제시합니다.\n자주 묻는 질문 ❓\nQ: GPT-5가 무료로 제공되나요?\nA: 네, ChatGPT의 무료 계정에서도 일부 메시지 제한과 함께 GPT-5를 사용할 수 있습니다. 또한, Cursor, 마이크로소프트 코파일럿, 퍼플렉시티 등 일부 외부 플랫폼에서도 무료로 이용 가능합니다.\nQ: GPT-5를 쓰려면 별도로 선택해야 하나요?\nA: 유료 요금제 사용자(Plus, Pro, Team)는 모델 선택기에서 GPT-5를 수동으로 선택할 수 있습니다. 하지만 기본적으로는 모든 로그인 사용자에게 새로운 GPT-5가 기본 모델로 자동 적용됩니다.\nQ: GPT-5 Thinking 모드는 무엇인가요?\nA: GPT-5가 복잡한 요청에 대해 답변하기 전에 더 깊은 추론을 적용하는 모드입니다. 코딩, 과학, 금융 분석 등 정밀한 분석이 필요한 작업에 특히 유용하며, 유료 요금제 사용자에게 제공됩니다.\nQ: GPT-5 출시로 기존 대화가 사라지나요?\nA: 아니요, 기존 대화는 그대로 유지됩니다. 다만, 이전 모델을 사용했던 대화창을 열 경우 자동으로 GPT-5의 가장 유사한 모델로 전환되어 이어서 대화하게 됩니다.\n \n오늘은 이렇게 GPT-5에 대해 자세히 알아보았는데요. 사실 GPT-5의 등장은 단순한 기술 발전이 아니라, 우리가 AI를 활용하는 방식 자체를 한 단계 끌어올리는 중요한 계기가 될 것 같아요. 특히 복잡한 문제 해결이나 창의적인 작업에서 얼마나 놀라운 결과를 보여줄지 정말 기대가 됩니다.\n\n\n\n.single-summary-card-container {\nfont-family: 'Noto Sans KR', sans-serif;\ndisplay: flex;\njustify-content: center;\nalign-items: center;\npadding: 20px 10px;\nbackground-color: #fce4ec;\nmargin: 20px 0;\n}\n.single-summary-card {\nwidth: 100%;\nmax-width: 700px;\nbackground-color: #ffffff;\nborder-radius: 12px;\nbox-shadow: 0 6px 18px rgba(0,0,0,0.12);\npadding: 25px;\ndisplay: flex;\nflex-direction: column;\noverflow: hidden;\nborder: 1px solid #ce93d8;\nbox-sizing: border-box;\nheight: auto;\nmin-height: unset;\n}\n.single-summary-card .card-header {\ndisplay: flex;\nalign-items: center;\nborder-bottom: 2px solid #8e24aa;\npadding-bottom: 12px;\nmargin-bottom: 12px;\n}\n.single-summary-card .card-header-icon {\nfont-size: 34px;\ncolor: #8e24aa;\nmargin-right: 14px;\n}\n.single-summary-card .card-header h3 {\nfont-size: 26px;\ncolor: #8e24aa;\nmargin: 0;\nline-height: 1.3;\nfont-weight: 700;\n}\n.single-summary-card .card-content {\nflex-grow: 1;\ndisplay: flex;\nflex-direction: column;\njustify-content: space-around;\nfont-size: 17px;\nline-height: 1.65;\ncolor: #444;\n}\n.single-summary-card .card-content .section {\nmargin-bottom: 10px;\n}\n.single-summary-card .card-content strong {\ncolor: #7b1fa2;\nfont-weight: 600;\n}\n.single-summary-card .card-content .highlight {\nbackground-color: #fff9c4;\npadding: 2px 6px;\nborder-radius: 3px;\nfont-weight: bold;\n}\n.single-summary-card .card-content .formula {\nbackground-color: #f3e5f5;\npadding: 6px 10px;\nborder-radius: 4px;\nfont-size: 0.9em;\ntext-align: center;\nmargin-top: 5px;\ncolor: #4a148c;\n}\n.single-summary-card .card-footer {\nfont-size: 14px;\ncolor: #777;\ntext-align: center;\npadding-top: 12px;\nborder-top: 1px dashed #e1bee7;\nmargin-top: auto;\n}\n@media (max-width: 768px) {\n.single-summary-card {\npadding: 18px;\nheight: auto;\nmin-height: unset;\n}\n.single-summary-card .card-header-icon {\nfont-size: 30px;\nmargin-right: 10px;\n}\n.single-summary-card .card-header h3 {\nfont-size: 22px;\n}\n.single-summary-card .card-content {\nfont-size: 15px;\nline-height: 1.6;\n}\n.single-summary-card .card-content .section {\nmargin-bottom: 8px;\n}\n.single-summary-card .card-content .formula {\npadding: 5px 8px;\nfont-size: 0.9em;\n}\n.single-summary-card .card-footer {\nfont-size: 13px;\npadding-top: 10px;\n}\n}\n@media (max-width: 480px) {\n.single-summary-card {\npadding: 15px;\n}\n.single-summary-card .card-header-icon {\nfont-size: 28px;\n}\n.single-summary-card .card-header h3 {\nfont-size: 20px;\n}\n.single-summary-card .card-content {\nfont-size: 14px;\nline-height: 1.55;\n}\n.single-summary-card .card-content .section {\nmargin-bottom: 6px;\n}\n.single-summary-card .card-content .formula {\npadding: 4px 6px;\nfont-size: 0.8em;\n}\n.single-summary-card .card-footer {\nfont-size: 12px;\npadding-top: 8px;\n}\n}",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483637",
    "pubDate": "Fri, 8 Aug 2025 08:11:34 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "gpt-5",
      "GPT-5 가격",
      "GPT-5 기능",
      "GPT-5 벤치마크",
      "GPT-5 사용법",
      "GPT-5 성능",
      "GPT-5 음성",
      "인공지능",
      "챗GPT",
      "챗gpt 요금제"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "AI Assistant, Junie and Kineto Now Support GPT-5 by OpenAI",
    "description": "At JetBrains, we are committed to delivering the best technologies to professional developers. We support multiple LLM providers across our AI products to ensure you have access to the right tools for your needs and the freedom to choose the ones you prefer. Today, we’re excited to announce that the latest model from OpenAI, GPT-5, […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/blog/2025/08/07/gpt-5-support-in-ai-assistant-junie-kineto/",
    "pubDate": "Thu, 07 Aug 2025 17:00:07 +0000",
    "creator": "Anna Maltseva",
    "categories": [
      "news",
      "ai-assistant",
      "ai-in-ides",
      "junie"
    ]
  }
]