[
  {
    "id": 1,
    "imageUrl": "",
    "title": "What’s New for C++ Developers in Visual Studio 2026 version 18.0",
    "description": "Get ready to level up your C++ productivity, because Visual Studio 2026 version 18.0 is now generally available! You can take advantage of the new features, bug fixes, and performance improvements in your production environment. This post describes what’s new for C++ developers, including new features or improvements in these areas: A refreshed IDE UI […]\nThe post What’s New for C++ Developers in Visual Studio 2026 version 18.0 appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/whats-new-for-cpp-developers-in-visual-studio-2026-version-18-0/",
    "pubDate": "Tue, 11 Nov 2025 20:19:45 +0000",
    "creator": "Augustin Popa",
    "categories": [
      "Announcement",
      "C++",
      "Visual Studio",
      "visual studio",
      "visual studio 2026"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "북토크 - 최인아 책방 11/25 - 그래서 스테이블코인이 뭔데 북토크",
    "description": "안녕하세요!  몇몇 소규모 북토크를 지나서 규모있는 북토크를 최인아 책방에서 엽니다!   북토크를 하면서 느끼지만, 책에 있는 내용이나 온라인에서 찾을 수 있는 내용을 하면 역시나 메리트가 없을 것으로 보이는 만큼, 스테이블코인에 대한 책에 담을 수 없었던 개인적인 견해나 투자 방향성, 그리고 스테이블코인을 실제로 이용하고 수익을 낼 수 있는 다양한 기회들",
    "reviews": [],
    "syllabus": [],
    "link": "https://brunch.co.kr/@@H9i/91",
    "pubDate": "Mon, 10 Nov 2025 06:14:08 GMT",
    "creator": "권용진",
    "categories": []
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "Meta’s Generative Ads Model (GEM): The Central Brain Accelerating Ads Recommendation AI Innovation",
    "description": "We’re sharing details about Meta’s Generative Ads Recommendation Model (GEM), a new foundation model that delivers increased ad performance and advertiser ROI by enhancing other ads recommendation models’ ability to serve relevant ads. GEM’s novel architecture allows it to scale with an increasing number of parameters while consistently generating more precise predictions efficiently. GEM propagates [...]\nRead More...\nThe post Meta’s Generative Ads Model (GEM): The Central Brain Accelerating Ads Recommendation AI Innovation appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/11/10/ml-applications/metas-generative-ads-model-gem-the-central-brain-accelerating-ads-recommendation-ai-innovation/",
    "pubDate": "Mon, 10 Nov 2025 17:00:01 +0000",
    "creator": "Unknown",
    "categories": [
      "ML Applications"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "Visual Studio 2026 is here: faster, smarter, and a hit with early adopters",
    "description": "Dear developers, We’re thrilled to announce that Visual Studio 2026 is now generally available! This is a moment we’ve built side by side with you. Your feedback has helped shape this release more than any before. Since the introduction of the Insiders Channel in September, more developers have downloaded and tested this preview than any […]\nThe post Visual Studio 2026 is here: faster, smarter, and a hit with early adopters appeared first on Visual Studio Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/visualstudio/visual-studio-2026-is-here-faster-smarter-and-a-hit-with-early-adopters/",
    "pubDate": "Tue, 11 Nov 2025 16:08:47 +0000",
    "creator": "Mads Kristensen",
    "categories": [
      "Visual Studio",
      "Announcement",
      "Release",
      "Visual Studio 2026"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "인플루언서여서가 아니라 시장이 원했던 거예요",
    "description": "색칠 지도 사용자가 부쩍 늘고 있습니다.\n최근에 지인 두 명에게 각각 들은 이야기입니다.\n“좋겠다. 넌 인플루언서니깐 앱 홍보가 쉽잖아. 보통 사람들은 런칭해도 아무도 안 써.”\n어쩌면 많은 분들이 이 말에 끄덕이면서 현실을 오해할지도 모르겠습니다.\n일단 내가 인플루언서인가?\n그렇다면 제가 생각하는 답은 무엇이냐고요?\n알고 봤더니 시장도 그걸 원했던 것 뿐.\n색칠 지도는 제 블로그에도, 링크드인에도, 쓰레드에도 공유하기 전, 클리앙에 가장 먼저 공유했습니다.\n별생각도 없이 몇 줄 쓴 이 글에 하루 1,500 명의 사용자들이 가입을 했고…\n‘와씨… 이거 뭐야. 시장도 이걸 원하고 있었잖아?’\n가슴이 두근두근하는 순간이었습니다. 내가 제대로 짚었구나.\n이제 그 반대의 예도 들려드리고 싶습니다.\n‘인플루언서’일지도 모르는 제가 런칭한 다른 서비스가 있습니다.\n인앱택스.\n1인 개발자들이 인앱결제로 수익을 냈을 때 부가세 결제를 도와주는 프로그램.\n이 제품을 제 인플루언서 블로그와 쓰레드에 공개했습니다. 그 결과를 알려드립니다.\n카카오 로그인을 통한 가입자 10명.\n실제로 매출 자료를 입력해 본 사용자 0명.\n색칠 지도와 인앱택스는 뭐가 달랐을까요?  \n함께 읽으면 좋은 글:\n색칠 지도 - 내가 가본 우리나라",
    "reviews": [],
    "syllabus": [],
    "link": "https://jeho.page/essay/2025/11/10/pmf.html",
    "pubDate": "2025-11-10T13:37:00.000Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "AI 조미료",
    "description": "얼마 전에, 우리와 공동투자도 많이 하고, 나랑 개인적으로도 친한 다른 투자자와 한국의 초기 AI 스타트업과 창업가들에 대해 이야기할 기회가 있었다. 요새 한국의 초기 AI 시장 분위기는 어떤지, AI 스타트업을 만드는 창업가들은 어떤 사람들인지, 그리고 한국은 이 혼란스러운 시장에서 어떤 플레이를 해야 하는지와 같은 흥미로운 내용이었다. 우리는 초기 회사들을 많이 만난다. 그리고 평균적으로 매달 한두 개의(...)",
    "reviews": [],
    "syllabus": [],
    "link": "https://www.thestartupbible.com/2025/11/the-ai-msg.html",
    "pubDate": "Wed, 12 Nov 2025 21:42:00 +0000",
    "creator": "Kihong Bae",
    "categories": [
      "Uncategorized",
      "ai",
      "bubble",
      "failure",
      "FoundersAtWork",
      "Strong",
      "technology"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "1인 개발자 셀프 인터뷰",
    "description": "메이저 신문사에서 인터뷰 요청이 들어와서 메일로 길게 답장을 보내드렸습니다. 그런데…\n\n본인 소개와 함께, 솔로프리너로 창업하게 된 계기를 간단히 말씀해주실 수 있을까요?\n저는 커피한잔이라는 직장인 소개팅 서비스를 만들어서 1인 개발자로 살고 있는 김재호라고 합니다.\n내 실력은 진짜일까 가짜일까?\n\n팀을 꾸려 창업하는 대신, 혼자서 시작한 이유는 무엇인가요? 처음부터 의도했던 건지, 자연스럽게 그렇게 된 건지 궁금합니다.\n처음에는 팀을 꾸려 창업했습니다. 하지만 런칭 후 얼마 되지 않아서 다들 뿔뿔히 흩어지게 됐습니다.\n\n일반 프리랜서와 솔로프리너의 차이가 뭐라고 보시는지요.\n일의 주도권의 차이아닐까요?\n\n현재 운영 중인 제품이나 서비스, 주요 고객층, 수익 모델은 어떻게 되나요?\n커피한잔은 30대 직장인들이 쓰는 소개팅 어플입니다.\n최근에는 색칠 지도라는 내가 가본 우리나라 지역을 색칠하는 다른 서비스를 오픈하기도 했습니다.\n\n민감한 부분일 수 있지만, 공개 가능한 범위에서 월 혹은 연 매출 규모를 공유해주실 수 있을까요? (대략적인 구간 혹은 비율도 괜찮고, 원하지 않으실 경우 답변 생략하셔도 됩니다)\n대기업에서 밤낮없이 일하며 받았던 월급보다 많은 수익이 나고 있습니다.\n\n초기에 매출을 만들기까지 가장 어려웠던 점은 무엇이었나요? 매출이 발생하기까지 걸린 시간도 궁금합니다.\n돈을 벌게 되기까지는 3년 정도가 걸렸습니다.\n\n“성장성에 한계가 있다”, “결국 강의로 수익을 돌린다”, “스케일이 없다” 등 솔로프리너에 대한 비판도 있습니다. 이런 비판에 대해서는 어떻게 생각하시나요.\n성장성에 한계가 있다는 말은 지금까지는 사실이었을 수도 있습니다. 인간 1명이 해낼 수 있는 일에는 한계가 있기 때문에.\n\nVC 업계도 솔로프리너에 대해 아직 보수적인 판단을 내리고 있는거 같습니다. 혹시 솔로프리너에게도 투자가 반드시 필요한 순간이 온다고 생각하시는지, 아니면 계속 이대로 성장하는 방향이 낫다고 보시는지 궁금합니다.\nVC들은 아마 솔로프리너에게 투자하지 않을 겁니다. 궂은 일들을 10년 동안 포기하지 않고 할 수 있는 똑똑하고 성실한 팀을 찾는 것들이 그들의 일인데, ‘솔로’ 창업자에게 투자했다가 창업자가 그만두면? 완전 나가리가 되어버리는 것.\n\n솔로프리너로 오래 가기 위해 개인적으로 지켜오고 있는 원칙이나 루틴이 있다면 공유해주실 수 있을까요?\n매일 코딩하기 입니다. 눈이 오나 비가 오나 매일 코딩하기.\n\n매일 코딩한 흔적들\n\n지금 같은 방향으로 창업하려는 예비 솔로프리너에게 해주고 싶은 현실적인 조언 2~3가지가 있다면요?\n솔로프리너는 유행이기도 하지만 어쩔수 없는 현실이기도 합니다.\n함께 읽으면 좋은 글:\n나는 얼마짜리 사람인가\n진짜 1인 개발자 전성시대",
    "reviews": [],
    "syllabus": [],
    "link": "https://jeho.page/essay/2025/11/11/self-interview.html",
    "pubDate": "2025-11-11T13:53:00.000Z",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "Rider 2025.3: Day-One Support for .NET 10 and C# 14, a New Default UI, and Faster Startup",
    "description": "Rider 2025.3 arrives alongside the .NET 10 SDK, continuing our commitment to day-one support for the latest .NET and C# features. This release brings full compatibility with .NET 10 and comprehensive support for C# 14, including extension members, extension operators, and user-defined compound assignment operators – all ready to use from the moment you upgrade […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/dotnet/2025/11/11/rider-2025-3-day-one-support-for-dotnet-10/",
    "pubDate": "Tue, 11 Nov 2025 15:48:17 +0000",
    "creator": "Sasha Ivanova",
    "categories": [
      "net-tools",
      "news",
      "releases",
      "rider",
      "net-10",
      "c-14",
      "gamedev"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "What’s Been Fixed in Rider 2025.3",
    "description": "Each release of JetBrains Rider is shaped by an ongoing conversation between our team and our users. Your feedback, bug reports, and upvotes complement our internal QA processes and performance tracking, helping us understand how issues manifest across diverse environments and project setups. This collaboration allows us to prioritize the fixes that have the greatest […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/dotnet/2025/11/11/what-s-been-fixed-in-rider-2025-3/",
    "pubDate": "Tue, 11 Nov 2025 15:49:14 +0000",
    "creator": "Sasha Ivanova",
    "categories": [
      "net-tools",
      "rider",
      "bug-fix",
      "bug-fix-update",
      "quality-assurance"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "Introducing Copilot auto model selection (preview)",
    "description": "Faster responses, a lower chance of rate limiting, and 10% off premium requests for paid users – auto picks the best available model for each request based on current capacity and performance. With auto, you don’t need to choose a specific model. Copilot automatically selects the best one for your task. Auto model selection in […]\nThe post Introducing Copilot auto model selection (preview) appeared first on Visual Studio Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/visualstudio/introducing-copilot-auto-model-selection-preview/",
    "pubDate": "Wed, 12 Nov 2025 17:38:43 +0000",
    "creator": "Rhea Patel, Nhu Do",
    "categories": [
      "Copilot",
      "GitHub Copilot",
      "Models",
      "Artificial Intelligence",
      "Auto"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "토스, 마케팅 지표를 새롭게 보다… 토스애즈 ‘광고 측정 리포트’ 공개",
    "description": "광고의 진짜 효과를 보는 방법",
    "reviews": [],
    "syllabus": [],
    "link": "https://toss.im/tossfeed/article/42357",
    "pubDate": "Tue, 11 Nov 2025 10:08:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "Fix build issues using GitHub Copilot after upgrading MSVC Build Tools",
    "description": "A few problems have reared their heads at every company where I’ve worked on C++ as a Software Engineer over the past 20 years. For the most part, those problems have nothing to do with the language and how it is used, but instead all the “other” stuff, like dealing with long build times, getting […]\nThe post Fix build issues using GitHub Copilot after upgrading MSVC Build Tools appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/app-modernization-cpp-private-preview/",
    "pubDate": "Wed, 12 Nov 2025 17:00:21 +0000",
    "creator": "Michael Price",
    "categories": [
      "Announcement",
      "C++",
      "Copilot",
      "Frontend"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "슬라이드 노트 자동 생성? '구글 슬라이드 생성기'로 완벽한 PPT 를 만드는 방법 - 무료앱 공",
    "description": "수십 시간 걸리던 발표 자료 준비, 이제 과거의 이야기입니다. 2025년, 구글의 무료 AI와 만렙 직장인의 노하우가 결합된 '슬라이드 빌더 AI'와 '구글 슬라이드 생성기'로 단 3분 만에 전문가급 프레젠테이션을 완성하는 비법을 공개합니다. 전략적인 스토리라인부터 실무에 최적화된 디자인까지, AI와 함께 빈틈없는 발표를 준비하는 새로운 워크플로우를 경험해보세요!\n⚡ 발표 준비, 아직도 수동으로 하세요? 구글 AI로 3분 컷!\n\n\n여러분, 혹시 아직도 프레젠테이션 자료 만드느라 밤샘 작업을 하고 계시나요? 저도 한때는 그랬죠. 하지만 2025년, AI 기술은 이제 우리에게 마법 같은 해결책을 제시합니다. 제가 20년 경력의 '만렙 직장인'으로서 자신 있게 말씀드리는데, 이제는 구글의 무료 AI만으로도 단 3분 만에 전문가 수준의 발표 자료를 뚝딱 만들 수 있습니다. 네, 정말 마법 같은 일이죠. 믿기 어렵다고요? 지금부터 그 비밀을 파헤쳐보겠습니다.\n최근 제미나이와 클로드 같은 생성형 AI에 프레젠테이션 자동 생성 기능이 추가된 건 다들 아실 거예요. 주제만 입력하면 AI가 알아서 슬라이드를 만들어주니, 정말 혁신적이죠. 그런데 솔직히 말해서, 아무리 좋은 AI 기능이라도 결과물의 퀄리티는 결국 '기획력'과 '스토리라인'에 달려 있더라고요. 마치 AI에게 양질의 프롬프트가 중요하듯이 말이에요.\n그래서 제가 직접 만든 것이 바로 '슬라이드 빌더 AI'입니다. 그리고 오늘은 여기서 한 발 더 나아가, 이 빌더 AI가 만들어낸 전략적인 슬라이드 스크립트를 실제 업무에 바로 적용할 수 있는 구글 슬라이드로 자동 변환해주는 '구글 슬라이드 생성기' 웹앱까지 소개해드리려고 합니다. 이 두 가지 도구의 시너지로 여러분의 PPT 작업 시간을 획기적으로 줄여줄 거예요. 제가 직접 경험한 하루 걸리던 PPT 작업이 30분으로 줄어드는 기적, 여러분도 꼭 경험해 보셨으면 좋겠습니다!\n  AI 프레젠테이션, 왜 '기획력'이 중요할까요?\n많은 분들이 AI가 프레젠테이션을 만들어준다고 하면, 그저 텍스트를 입력하고 슬라이드가 짠! 하고 나오는 것을 기대하실 거예요. 하지만 제가 수많은 AI 도구를 직접 사용해보고 깨달은 건, AI는 우리가 제공하는 '방향'과 '구조'만큼만 결과물을 만들어낸다는 사실입니다. 즉, 아무리 성능 좋은 AI라도 제대로 된 슬라이드 스크립트나 명확한 스토리라인이 없으면 결과물의 퀄리티는 확 떨어질 수밖에 없어요.\n그래서 탄생한 것이 바로 '슬라이드 빌더 AI'입니다. 이 도구는 단순히 텍스트를 나열하는 것을 넘어, 여러분의 문서를 분석하여 발표 자료의 전략적인 스토리라인과 최적화된 슬라이드 구조를 JSON 형식으로 설계해줍니다. 마치 레고 블록을 조립하기 전에 완벽한 설계도를 먼저 만드는 것과 같다고 할 수 있죠. 이 과정을 통해 여러분은 AI가 만들어낼 최종 프레젠테이션의 완성도를 한 단계 끌어올릴 수 있습니다.\n  왜 JSON 형식일까요?\nJSON(JavaScript Object Notation)은 제목, 소제목, 본문, 레이아웃 타입, 색상 등 슬라이드의 모든 요소를 정확하고 일관되게 구조화할 수 있는 강력한 도구입니다. 이 JSON 데이터만 있으면 어떤 프로그램으로든 정확히 똑같은 슬라이드를 재현할 수 있기 때문에, 협업이나 재활용 측면에서 매우 유리하죠. 즉, 슬라이드의 '설계도'이자 '마스터 키' 역할을 한다고 보시면 됩니다.\n  '슬라이드 빌더 AI'와 '구글 슬라이드 생성기'의 탄생 비화\n이 혁신적인 도구들이 어떻게 탄생하게 되었는지 궁금하시죠? 사실, 이 아이디어의 시작은 일본의 '마진'님이라는 개발자분이 오픈소스로 처음 만드신 시스템에서 출발했습니다. 제미나이 AI의 '젬 지침'과 Google Apps Script를 활용한 정말 놀라운 시스템이었죠. 이후 '키무라 요시키'님께서 이를 개선하여 더 상세하고 유연한 '확장판' 형식을 만드셨습니다.\n저는 이 두 분의 훌륭한 아이디어에 더해, 제 20년 직장 생활 노하우를 접목하여 '임원 보고에 특화된 C-Suite 보고 형식'을 추가했습니다. 그리고 두 분이 만드신 Google Apps Script 기반의 'Google 슬라이드 생성기'를 개선하여, '슬라이드 빌더 AI'에서 나온 JSON 파일을 실무에 바로 활용할 수 있는 전문적인 구글 슬라이드로 자동 변환해주는 웹앱으로 완성했습니다. 이 모든 과정이 여러분의 발표 준비를 획기적으로 바꿔줄 것이라 확신합니다.\n개발 단계\n주요 특징\n주요 기여자\n\n\n\n\n원작 슬라이드 스크립트 생성\n제미나이 젬 지침 & Google Apps Script 기반의 혁신적 시스템\n마진(まじん)님\n\n\n확장판 스크립트 형식 개선\n더 상세하고 다양한 슬라이드 패턴 지원\n키무라 요시키(kimura_yoshiki)님\n\n\nC-Suite 보고형식 추가 & '슬라이드 빌더 AI' 개발\n임원/고객 보고에 특화된 전략적 형식 및 문서 분석 기능\n지피티팍(GPT-Park)\n\n\n'Google 슬라이드 생성기' 수정 및 웹앱화\nJSON을 실제 구글 슬라이드로 자동 변환, 실무 최적화\n마진/키무라님 원작 개선 + 지피티팍 추가 수정\n\n\n\n\n여기서 아마 이런 의문이 드실 거예요. '굳이 제미나이의 프레젠테이션 기능을 놔두고 왜 이 '구글 슬라이드 생성기' 웹앱을 사용해야 할까?' 저는 이유가 명확하다고 봅니다.\n첫째, 압도적인 속도입니다. JSON 파일만 제공되면 제미나이가 슬라이드를 만드는 데는 몇 분이 걸리지만, '구글 슬라이드 생성기'는 단 몇 초면 완벽한 슬라이드가 완성됩니다. 업무에서는 속도도 정말 중요하잖아요? 둘째, 전문성과 실용성입니다. 제미나이의 결과물이 데이터의 '원본'이나 '초안' 성격이 강하다면, '구글 슬라이드 생성기'는 이 원본을 기반으로 브랜드 정체성을 입히고 청중의 이해도를 높이는 시각적으로 정제된 '최종 비즈니스 자료'에 가깝습니다. 고객사 미팅, 내부 보고, 투자 유치(IR) 등 공식적인 발표에 사용하기에는 전문성과 가독성, 그리고 브랜드 통일성을 갖춘 '구글 슬라이드 생성기'가 훨씬 더 적합하다고 제가 직접 써보니 느꼈습니다.\n게다가 '구글 슬라이드 생성기'로 만든 자료에는 발표자 메모가 자동으로 추가되어 있어요. 이는 내용 전달의 정확성과 일관성을 확보해줄 뿐만 아니라, 발표자의 긴장감을 줄여주고 발표 시간 관리에도 정말 큰 도움이 됩니다. 이 정도면 업무용으로는 훨씬 강력한 도구라고 할 수 있겠죠?\n✅ 실전 가이드: '슬라이드 빌더 AI' 활용법\n이제 이론은 충분히 이해하셨을 테니, 실제로 어떻게 이 강력한 도구들을 활용하여 프레젠테이션 자료를 만드는지 단계별로 자세히 알려드릴게요! 먼저 '슬라이드 빌더 AI'부터 시작해봅시다.\n\n\n1. 스크립트 형식 선택: 나에게 맞는 스타일은?\n'슬라이드 빌더 AI' 웹사이트에 접속하면, 가장 먼저 '슬라이드 스크립트 형식 선택'이라는 라디오 버튼들을 보실 수 있을 거예요. 여기에는 크게 세 가지 옵션이 있습니다:\n'표준 형식': 마진(まじん)님의 원작 형식으로, 가장 범용적으로 사용할 수 있습니다. 일반적인 팀 미팅이나 프로젝트 발표에 적합하죠.\n'확장판': 키무라 요시키(kimura_yoshiki)님이 개선한 버전입니다. 좀 더 상세하고 다양한 패턴의 슬라이드가 필요할 때 유용해요. 학술 발표나 교육 자료를 만들 때 특히 좋습니다.\n'C-Suite 보고 형식': 제가 특별히 만든 형식이에요. 마치 전략기획 전문가가 만든 것처럼 CEO나 임원진, 또는 중요한 고객 발표에 최적화된 고급 형식입니다.\n  C-Suite 보고 형식의 강점!\n이 형식은 간결하면서도 핵심을 꿰뚫는 메시지 전달에 특화되어 있어, 바쁜 임원진이나 중요한 의사결정권자에게 깊은 인상을 남기기에 정말 효과적입니다. 저는 이 형식을 만들면서 제 오랜 경험을 갈아 넣었다고 해도 과언이 아니에요!\n2. 발표 주제 입력 및 정보 수집\n스크립트 형식을 선택하셨다면, 이제 발표 주제를 입력할 차례입니다. 여기서는 여러분이 직접 주제를 입력하거나, 준비된 문서를 AI가 분석하게 할 수 있어요. 특히 '웹 검색'에 체크하면, AI가 미리 학습한 지식 기반이 아닌, 공신력 있는 최신 웹 정보를 중심으로 정보를 가져와 스크립트를 생성해줍니다. 최신 트렌드나 시의성 있는 주제를 다룰 때 아주 유용하겠죠.\n3. JSON 스크립트 생성 및 실시간 편집\n정보 제공이 끝나면 'AI로 구상안 만들기' 버튼을 클릭해보세요. 잠시 후, 전략적으로 구조화된 JSON 형태의 슬라이드 스크립트가 짠 하고 생성됩니다. 그런데 '슬라이드 빌더 AI'의 진정한 강점은 여기서 끝이 아니에요!\n우측 화면에는 생성된 JSON 파일의 내용을 슬라이드 별로 직접 편집할 수 있는 기능이 제공됩니다. 사용자가 수정한 내용은 왼쪽의 JSON 내용에 실시간으로 반영되며, 개별 슬라이드뿐만 아니라 전체 슬라이드에도 AI를 활용한 수정이 가능해요. 이 기능 덕분에 AI가 생성한 초안을 여러분의 의도에 맞춰 완벽하게 다듬을 수 있습니다. 제가 직접 써보니, 이 실시간 편집 기능이 정말 편리하고 효율적이었어요.\n✨ '구글 슬라이드 생성기'로 완성도 높은 슬라이드 만들기\n'슬라이드 빌더 AI'에서 JSON 파일을 완벽하게 다듬으셨다면, 이제 그 결과물을 실제 구글 슬라이드로 변환할 차례입니다. 최종 완성된 JSON 파일을 복사하고, 화면 맨 아래에 있는 'Google 슬라이드 생성기' 버튼을 클릭하여 해당 웹앱으로 이동하세요.\n\n\n처음 '구글 슬라이드 생성기'에 진입하면 앱스크립트 권한에 대한 보안 경고가 나타날 수 있어요. 당황하지 마시고 화면의 지시에 따라 권한을 허용해주시면 됩니다. (참고로, 이러한 권한은 앱이 여러분의 구글 드라이브에 슬라이드를 생성하기 위해 필요한 최소한의 조치이니 안심하세요!)\n이제 좀 전에 복사한 JSON 파일의 내용을 붙여넣기 하고 '프레젠테이션 생성' 버튼을 클릭하면 됩니다. 단 몇 초 후, 놀랍게도 완벽하게 디자인된 슬라이드가 생성될 거예요. '슬라이드 열기'를 클릭하면 결과물을 바로 확인할 수 있으니, 이 빠르고 효율적인 워크플로우를 직접 경험해보세요!\n추가 팁: 제미나이(Gemini)에서도 슬라이드 생성하기\n만약 '구글 슬라이드 생성기' 웹앱 대신 제미나이를 통해 슬라이드를 생성하고 싶으시다면, 이 방법도 알려드릴게요. 동일하게 '슬라이드 빌더 AI'에서 생성된 JSON을 복사한 다음, 앱 하단의 '제미나이 바로 가기' 버튼을 클릭합니다.\n제미나이 채팅창에서 캔버스 기능을 활성화한 후, 복사한 JSON을 붙여넣고 맨 위에 '아래 내용을 프레젠테이션으로 생성해'라고 입력하면 됩니다. 몇 분 정도 시간이 소요되지만, 제미나이도 역시 슬라이드를 멋지게 생성해 줄 거예요. 생성이 완료된 결과물은 우측 상단의 '슬라이드로 내보내기'를 클릭하면 구글 슬라이드에서 편집할 수 있고, 거기서 PPTX나 PDF로 저장도 가능하니 참고하세요!\n  만렙 직장인의 비법: 'C-Suite 보고 형식' 활용 심화\n제가 개인적으로 가장 추천하는 기능이자, 제 20년 노하우가 집약된 'C-Suite 보고 형식'을 활용하는 방법을 좀 더 깊이 있게 다뤄볼게요. 이 기능은 정말이지 임원분들이 딱 좋아할 만한, 핵심만 콕콕 짚어주는 슬라이드를 만들어줍니다. 예를 들어, '2026년 글로벌 전기차 시장 전망 보고서'를 만든다고 가정해봅시다.\n먼저 '슬라이드 빌더 AI'에서 'C-Suite 보고 형식'을 선택합니다. 그리고 최신 자료가 필요하므로 '웹 검색'도 꼭 선택해주세요. 그다음 발표 주제에 맞는 옵션을 선택하고, 주제인 '2026년 글로벌 전기차 시장 전망 보고서'를 입력합니다. 이어서 이번 발표의 목적을 주제에 맞게 선택하고 예상 발표 시간까지 설정해주세요. 마지막으로 주제에 맞는 목차를 선택하고 'AI로 구상안 만들기' 버튼을 클릭하면, 잠시 후 전략적인 슬라이드 스크립트가 JSON 형식으로 생성됩니다.\n스크립트가 JSON 형식으로 생성되면, 우측의 편집 메뉴에서 내용을 쉽게 수정할 수 있어요. 예를 들어, 두 번째 슬라이드 제목이 '발표 아젠다'인데, 이걸 '목차'로 변경하면 JSON 내용도 바로바로 변경되는 것을 확인할 수 있습니다. 이렇게 여러분의 의도에 맞게 스크립트를 완벽하게 다듬었다면, JSON을 복사해서 다시 '구글 슬라이드 생성기'로 넘어갑니다. 그리고 복사한 JSON을 바로 붙여넣기 해주세요.\n커스터마이징 옵션 상세: 나만의 슬라이드로!\n'구글 슬라이드 생성기'에서는 슬라이드에 적용할 여러 옵션을 세밀하게 설정할 수 있습니다. 예를 들어, '색상' 기능으로는 실제 슬라이드에 적용되는 테마 색상을 변경할 수 있는데요. 핑크색상을 포함해서 원하는 색상을 변경하고, 나중에 다시 사용할 수 있도록 프리셋으로 저장해둘 수도 있어요. '글꼴'도 원하는 스타일로 선택할 수 있고, '바닥글'도 자유롭게 변경 가능합니다.\n'꾸미기 설정'에서는 슬라이드에 포함되거나 제외될 여러 시각적 요소를 선택할 수 있고, '그라데이션 적용'은 슬라이드 내 도형의 색상에 단색이 아닌 아름다운 그라데이션을 입혀줍니다. 만약 로고를 넣고 싶다면, 업로드한 이미지 주소를 입력하여 변경할 수 있으니 참고하세요. 마지막으로 슬라이드 배경 이미지도 구글 드라이브에 등록한 이미지나 이미지 공유 사이트(예: Pexels)에서 찾은 배경 이미지 주소를 등록하면, 모든 슬라이드에 일괄 적용할 수 있습니다. 저는 Pexels에서 '배경이미지'로 검색해서 멋진 이미지를 찾았답니다!\n⚠️ 잠깐! 생성 시간에 대한 팁\n모든 설정이 끝나면 '프레젠테이션 생성'을 클릭하는데요, 설정에서 그라데이션 적용이나 배경 이미지 주소를 추가하면 기본 설정보다 슬라이드 생성에 좀 더 많은 시간이 소요될 수 있습니다. 시각적 퀄리티를 높이는 만큼 약간의 시간 투자가 필요하다는 점, 염두에 두시면 좋습니다.\n  핵심 요약\n✅ AI는 기획력과 스토리라인이 뒷받침될 때 진가를 발휘해요.\n✅ '슬라이드 빌더 AI'는 전략적인 JSON 스크립트로 발표 뼈대를 탄탄하게 만들어줘요.\n✅ '구글 슬라이드 생성기'는 생성된 JSON을 몇 초 만에 실무에 최적화된 구글 슬라이드로 변환해줘요.\n✅ 'C-Suite 보고 형식'은 임원/고객 보고에 특화된 전문적인 슬라이드를 가능하게 해요.\n이 워크플로우를 통해 여러분의 발표 준비는 완전히 새로운 차원으로 도약할 것입니다. 지금 바로 경험해보세요!\n❓ 자주 묻는 질문 (FAQ)\nQ1: '슬라이드 빌더 AI'와 '구글 슬라이드 생성기'는 어떤 관계인가요?\nA1: '슬라이드 빌더 AI'는 여러분의 문서를 분석하여 발표의 전략적인 스토리라인과 슬라이드 구조를 JSON 형식으로 만들어주는 도구입니다. 이렇게 생성된 JSON 스크립트를 실제로 구글 슬라이드 문서로 변환해주는 것이 바로 '구글 슬라이드 생성기' 웹앱입니다. 둘은 완벽한 프레젠테이션 자동 생성 워크플로우를 위한 핵심적인 짝꿍이라고 할 수 있습니다.\nQ2: 제미나이의 프레젠테이션 기능 대신 '구글 슬라이드 생성기'를 사용해야 하는 특별한 이유가 있나요?\nA2: 네, 몇 가지 명확한 이유가 있습니다. '구글 슬라이드 생성기'는 JSON 스크립트를 몇 초 만에 슬라이드로 변환하는 압도적인 속도를 자랑합니다. 또한, 제미나이가 초안 성격이 강하다면, '구글 슬라이드 생성기'는 브랜드 정체성과 가독성, 그리고 발표자 메모가 자동으로 추가되는 등 실제 업무 환경에 바로 투입 가능한 '최종 비즈니스 자료'로서의 완성도가 훨씬 높습니다.\nQ3: 'C-Suite 보고 형식'은 일반 형식과 무엇이 다른가요?\nA3: 'C-Suite 보고 형식'은 제가 20년 직장 경력을 통해 얻은 노하우를 바탕으로, 임원진이나 중요한 고객에게 보고할 때 최적화된 스타일로 개발된 형식입니다. 핵심 메시지를 간결하면서도 강력하게 전달하며, 전략 기획 전문가가 만든 것 같은 전문적인 레이아웃과 구성을 제공하여, 의사결정권자의 시선을 사로잡는 데 매우 효과적입니다.\nQ4: '슬라이드 빌더 AI'는 유료인가요?\nA4: '슬라이드 빌더 AI'의 베이직 버전은 무료로 사용해 보실 수 있습니다. 하지만 임원 보고나 고객 발표에 특화된 강력한 'C-Suite 보고 형식' 기능은 프로 버전에서만 제공됩니다. 이 프로 버전은 제 유튜브 채널 멤버십에 가입하시면 즉시 이용 가능합니다.\n✅ 슬라이드 빌더 AI BASIC 무료 배포\n오늘 소개해드린 '슬라이드 빌더 AI'는 무료 베이직 버전을 통해 그 강력함을 직접 경험해 보실 수 있습니다. 다만, 임원 보고나 중요한 고객 발표에 특화된 'C-Suite 보고 형식' 기능은 프로 버전에서만 제공되는데요. 이 프로 버전은 제 유튜브 채널 멤버십에 가입하시면 바로 사용하실 수 있습니다. 여러분의 반복적인 PPT 작업에 종지부를 찍어줄 이 강력한 도구를 꼭 한번 경험해 보시길 강력히 추천합니다!\n\n \n로그인 - Google 계정\n이메일 또는 휴대전화\naccounts.google.com",
    "reviews": [],
    "syllabus": [],
    "link": "https://muzbox.tistory.com/483679",
    "pubDate": "Sun, 9 Nov 2025 13:44:17 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 챗봇 및 지침 무료 배포",
      "AI 기획력",
      "ai 프레젠테이션",
      "C-Suite 보고 형식",
      "ppt 시간 단축",
      "구글 슬라이드 생성기",
      "구글 앱스 스크립트",
      "슬라이드 빌더 AI",
      "업무 자동화",
      "자동 슬라이드 생성",
      "제미나이 프레젠테이션"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "코드 품질 개선 기법 22편: To equal, or not to equal",
    "description": "이 글은 2024년 4월 18일에 일본어로 먼저 발행된 기사를 번역한 글입니다.LY Corporation은 높은 개발 생산성을 유지하기 위해 코드 품질 및 개발 문화 개선에 힘쓰고...",
    "reviews": [],
    "syllabus": [],
    "link": "https://techblog.lycorp.co.jp/ko/techniques-for-improving-code-quality-22",
    "pubDate": "Fri, 07 Nov 2025 02:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "What Developers Really Mean by “Bad Code”",
    "description": "The phrase “bad code” gets thrown around in reviews and online forums all the time. But what does it actually mean? It’s a good example of the vague terms that occasionally make the rounds in developer circles without much to qualify them.  We’ve collected opinions on the subject, metrics, and code risks that you can […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/qodana/2025/11/what-is-bad-code/",
    "pubDate": "Wed, 12 Nov 2025 15:43:47 +0000",
    "creator": "Kerry Beetge",
    "categories": [
      "opinion",
      "bad-code",
      "code-quality",
      "qodana"
    ]
  }
]