[
  {
    "id": 1,
    "imageUrl": "",
    "title": "느긋히 섬을 꾸미며 힐링, 아일랜더스: 새로운 해안",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2341",
    "pubDate": "Sat, 02 Aug 2025 22:57:54 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "게임툰"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "25.08.03 - 아를의 평원, 캐슬 콤보",
    "description": "게임을 하면서 사진을 잘 안찍어서 사진은 많지 않지만 간단히라도 평을 남겨보려고 한다. 아를의 평원 우베 로젠버그의 게임으로 2인 전용이고 확장을 넣으면 3인까지 할 수 있다. 아를이란 지역을 개발하여 여러 건물을 올리고 농사를 짖고 교역을 하면서 건물을 짖고 여행도 가고 하면서 점수를 모으면 된다. 여기저기 마이너스 점수가 있고 채우면 없어진다. 황무지를 개간하면 토탄이란 개념이 나오는데 그냥 석탄이라고 이해하면 편하다. 평소엔 잘 쓰지않는 단어지만 난 게임을 하면서 몇번 들었던 적이 있어서 어색하진 않았으나 처음듣는 사람은 그게 뭔데 ? 할 수 있다. 맨날 먹는 우베의 그런 맛이지만 역시 맛있는 그런 느낌이다. 와.......",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.naver.com/dlehddus84/223957607677?fromRss=true&trackingCode=rss",
    "pubDate": "Sun, 03 Aug 2025 21:55:07 +0900",
    "creator": "dlehddus84",
    "categories": [
      "플레이"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "구글 노트북LM 동영상 개요, 한국어로 만드는 방법",
    "description": "Google NotebookLM 동영상 개요, 왜 아직도 영어만 지원할까요? 한국 사용자를 위한 AI STUDIO 맞춤형 지침으로 완벽한 한국어 영상 개요를 만드는 비법을 담았습니다. 이제 언어의 장벽 없이 창의적인 콘텐츠를 만들어보세요!\n\n\n \n 혹시 Google NotebookLM의 동영상 개요 기능을 써보셨다가 저처럼 살짝 실망한 적 있으신가요? 정말 놀라운 기능인데, 막상 써보면 음성 요약이나 슬라이드 내용이 전부 영문으로만 나와서 '한국어 콘텐츠에는 쓸모없나?' 하는 생각이 들 때가 있더라고요. 제 주변에도 이런 고민을 하시는 분들이 정말 많았어요. 아마 저만 그런 건 아닐 거예요.  \n\n그런데 말이죠, 포기하기엔 이 기능이 너무 아깝잖아요? 그래서 제가 직접 AI STUDIO를 활용해 이 기능을 우리말에 완벽하게 맞추는 방법을 연구해봤어요. 기존의 텍스트 기반 요약 기능을 확장해서 영상 개요를 만드는 이 혁신적인 기능을, 이제 여러분도 한국어 문서로 마음껏 활용할 수 있도록 아주 쉽고 친절하게 알려드릴게요. 이 글만 읽으면 여러분의 작업 효율이 정말 비약적으로 상승할 거라고 장담합니다!\n \n1. Google NotebookLM의 놀라운 기능들 ✨\nGoogle NotebookLM은 Google Labs에서 개발한 AI 기반의 혁신적인 도구입니다. 이 도구는 단순히 검색 결과를 찾아주는 것을 넘어, 사용자가 업로드한 문서를 기반으로 상호작용하며 정보를 분석하고 정리하는 데 특화되어 있어요. Google의 강력한 AI 모델인 Gemini를 활용해 복잡한 자료를 명확하게 바꿔주고, 여러분의 연구와 학습 과정을 효율적으로 만들어주는 온라인 서비스라고 할 수 있습니다.\n\nNotebookLM은 여러분의 작업 효율을 극대화할 수 있도록 다양한 기능을 제공하고 있습니다. 어떤 기능들이 있는지 자세히 알아볼까요?\n소스 업로드 및 분석: PDF, 웹사이트, Google 문서, 슬라이드 등 다양한 형식의 소스를 올릴 수 있어요. 놀랍게도 최대 50개의 소스, 총 2,500만 단어까지 한 번에 처리할 수 있다고 하니, 방대한 양의 자료도 걱정 없겠죠!\n요약 및 설명 생성: 업로드된 콘텐츠를 바탕으로 핵심 내용을 요약하고, 상세한 설명을 생성해 줍니다. 특히, 답변의 출처를 원본 소스에 대한 인용으로 제공해 줘서 정보의 신뢰성을 확실하게 보장합니다.\n오디오 오버뷰: 2024년 9월에 출시되어 큰 주목을 받았던 기능이에요. 문서를 대화형 팟캐스트 형식으로 요약해 주기 때문에, 단순히 읽는 것보다 훨씬 재미있고 쉽게 내용을 파악할 수 있답니다.\n형식 변환: 소스 문서를 학습 가이드, 브리핑 문서, 마인드맵 등 다양한 형식으로 변환해줘요. 복잡한 자료를 내가 원하는 형태로 즉시 바꿔주니, 콘텐츠 기획자나 학생들에게 정말 유용하겠죠.\n채팅 및 질문: 마치 친구와 대화하듯 노트북과 채팅하며 궁금한 점을 물어볼 수 있어요. 복잡한 추론이 필요한 질문에도 정확하고 신뢰성 있는 답변을 얻을 수 있습니다.\n이렇게 NotebookLM은 아이디어를 다듬고 정리하는 데 특화된 강력한 도구랍니다. 더 높은 한도와 프리미엄 기능을 제공하는 기업용 버전(NotebookLM Plus)도 있으니 참고하시면 좋을 것 같아요.\n  알아두세요!\nNotebookLM은 업로드된 소스 자료에 근거해 답변을 생성하기 때문에, 잘못된 정보나 '환각' 현상(Hallucination)이 나타날 확률이 현저히 낮아요. 이 점이 NotebookLM의 가장 큰 장점 중 하나랍니다.\n \n2. 동영상 개요 기능, 한국어 사용자의 도전과제 ⚠️\n 최근 NotebookLM의 동영상 개요 기능이 처음 공개되었을 때, 저도 정말 기대가 컸어요. 그런데 사용해보니 한 가지 큰 벽에 부딪히더라고요. 바로 이 기능이 공식적으로 영문 콘텐츠에만 최적화되어 있다는 점이었죠. \n \n 음성과 슬라이드에 나타나는 텍스트는 영문으로만 생성되어, 우리말 콘텐츠를 만드는 크리에이터나 기획자 입장에서는 정말 답답할 수밖에 없죠. 이 좋은 기능을 그림의 떡처럼 바라만 봐야 하는 상황이었답니다.\n\n\n⚠️ 주의하세요!\nAI가 만들어준 결과물이라고 해서 맹신하면 안 됩니다. 특히 복잡하거나 전문적인 내용을 다룰 때는 AI가 놓친 맥락이나 세부 사항이 없는지 반드시 최종 확인하는 과정이 필요해요.\n \n3. AI STUDIO를 활용한 한국어 최적화 가이드의 핵심 원리  \n그럼 이제부터 AI STUDIO의 맞춤 설정을 활용해 Google NotebookLM의 동영상 개요 기능을 우리말에 맞게 '길들이는' 방법을 알려드릴게요. 핵심은 AI에게 우리가 원하는 결과물을 명확하게 지시하는 세 가지 원칙을 적용하는 것입니다. 이 원칙만 잘 이해하면 여러분의 한국어 문서도 전문적인 영상 개요로 재탄생할 수 있어요!\n이 세 가지 핵심 원칙을 아래 표로 정리해 보았습니다.\n핵심 원칙\n상세 내용\n\n\n\n\n100% 한국어 현지화\n음성, 슬라이드, 자막 등 영상의 모든 요소를 한국어로만 제공하고, 기술 고유명사를 제외한 외국어 사용을 엄격히 금지합니다. 예시 또한 한국의 상황과 문화에 맞게 구성하여 몰입감을 높이는 것이 핵심입니다.\n\n\n시각적 디자인 강화\n텍스트만 나열하는 대신, 각 슬라이드 내용에 맞는 [아이콘]이나 [인포그래픽] 등을 구체적으로 제안하도록 지시합니다. 또한, 핵심 키워드는 굵게 처리하고, 긍정/부정적 내용을 색상(파란색, 빨간색)으로 구분하여 메시지를 직관적으로 전달하게 합니다.\n\n\n음성 나레이션 전달력\n나레이션 스크립트를 작성할 때, 딱딱한 기계음이 아닌 전문가의 신뢰감과 친근한 어조를 동시에 갖추도록 유도합니다. 중요한 내용 앞뒤에 (잠시停)과 같은 쉼표시를 넣어 강조 효과를 더하고 시청자가 내용을 소화할 시간을 제공합니다.\n\n\n\n \n핵심 내용 한눈에 보기  \n지금까지 설명드린 내용을 한눈에 보기 쉽게 요약해 보았습니다. 이 카드만 저장해 두셔도 AI STUDIO를 활용하는 데 큰 도움이 될 거예요.\n \n한국어 최적화 가이드 핵심 요약\n✨ 현지화: 모든 요소를 100% 한국어로! 문화적 배경에 맞는 예시를 활용해 몰입감을 높이세요.\n  디자인: 시각적 요소와 색상으로 강조! [아이콘]이나 [인포그래픽]을 명시하고, 중요한 내용은 파란색 또는 빨간색으로 구분해 메시지를 명확하게 전달하세요.\n ️ 전달력: 전문가적이면서 친근한 어조! (잠시후)과 같은 쉼표시를 활용해 자연스러운 흐름을 만드세요.\n이 지침을 활용하면 NotebookLM으로 최적화된 한국어 영상 개요를 만들 수 있습니다.\n \n4. AI STUDIO 맞춤 설정 지침 다운로드  \n위에 설명드린 핵심 원리를 직접 적용할 수 있는 맞춤 설정 지침 전문을 파일로 준비했습니다. 이 파일을 다운로드하여 AI STUDIO의 '맞춤 설정' 영역에 붙여넣기만 하면 됩니다. 이제 여러분의 한국어 문서도 전문가가 만든 것처럼 체계적인 영상 개요로 재탄생할 수 있습니다.\n\n    \n\n    \n노트북 LM 영상 개요 한글화 지침.zip\n0.00MB\n\n\n 사용법\n그림과 같이 동영상 개요 - 맞춤설정 에서 첨부한 지침을 붙여넣기 하면됩니다.\n단, 기본값이 영문 강제 설정이라..... 가끔씩 한글화가 안되는 경우가 있습니다.\n \n\n\n \n결과물\n\n\n\n \n \n \n자주 묻는 질문 ❓\nQ: Google NotebookLM의 동영상 개요 기능은 한국어를 지원하나요?\nA: 현재 정식 기능으로는 한국어 음성 및 슬라이더 생성을 지원하지 않습니다. 하지만 AI STUDIO의 맞춤 설정 지침을 활용하면 한국어 영상 개요를 생성할 수 있습니다.\nQ: AI STUDIO 맞춤 설정 지침의 핵심은 무엇인가요?\nA: '100% 한국어 현지화', '시각적 디자인 및 텍스트 효과 강화', '음성 나레이션 및 전달력' 세 가지 원칙을 바탕으로, AI에게 한국어 영상에 최적화된 개요를 생성하도록 구체적으로 지시하는 것입니다.\nQ: 지침에 따라 생성된 개요를 수정해야 할까요?\nA: 네, AI가 생성한 결과물은 항상 초안으로 간주하고, 최종 사용 전에 내용을 꼼꼼하게 검토하고 수정하는 것이 좋습니다. 특히 사실 관계나 어색한 표현이 없는지 확인해야 합니다.\n\n\n\n    {\n        \"@context\": \"https://schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n            {\n                \"@type\": \"Question\",\n                \"name\": \"Google NotebookLM의 동영상 개요 기능은 한국어를 지원하나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  현재 정식 기능으로는 한국어 음성 및 슬라이더 생성을 지원하지 않습니다. 하지만 AI STUDIO의 맞춤 설정 지침을 활용하면 한국어 영상 개요를 생성할 수 있습니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"AI STUDIO 맞춤 설정 지침의 핵심은 무엇인가요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  '100% 한국어 현지화', '시각적 디자인 및 텍스트 효과 강화', '음성 나레이션 및 전달력' 세 가지 원칙을 바탕으로, AI에게 한국어 영상에 최적화된 개요를 생성하도록 구체적으로 지시하는 것입니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"지침에 따라 생성된 개요를 수정해야 할까요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  네, AI가 생성한 결과물은 항상 초안으로 간주하고, 최종 사용 전에 내용을 꼼꼼하게 검토하고 수정하는 것이 좋습니다. 특히 사실 관계나 어색한 표현이 없는지 확인해야 합니다.\"\n                }\n            }\n        ]\n    }",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483634",
    "pubDate": "Mon, 4 Aug 2025 13:12:03 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "ai studio",
      "AI 튜토리얼",
      "Ai 활용",
      "Google NotebookLM",
      "동영상 개요",
      "영상 스크립트",
      "영상 제작",
      "콘텐츠 기획",
      "한국어 슬라이더",
      "한국어 현지화"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "나는 이 아이를 본적이 있어요!! - 프린세스 메이커: 예언의 아이들",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2337",
    "pubDate": "Tue, 29 Jul 2025 19:42:05 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "게임툰"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "토스, 토스 앱에 ‘Apple Hub’ 출시\n ",
    "description": "Apple Services 구매∙구독 내역 통합 관리",
    "reviews": [],
    "syllabus": [],
    "link": "https://toss.im/tossfeed/article/appleHub",
    "pubDate": "Wed, 30 Jul 2025 15:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "악역영애 4컷 만화는 한 주 쉬어갑니다.",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2339",
    "pubDate": "Wed, 30 Jul 2025 13:13:05 +0900",
    "creator": "｜RULIWEB｜",
    "categories": [
      "웹툰"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "블랜더 리깅 해보자",
    "description": "영상: https://www.youtube.com/watch?v=66y6xnTYBeY\n\n\n\n \n뻐량 오브젝트가 동시에 안보여서 이영상 저영상 보다보니\nIn Fomt 를 해줘야하는군요\n이 영상이 도움이 되었습니다.\n \n뼈 심어 봅시다.\n \n팁 - 빼 바꿔가며 웨이트 칠하기\n\n\n4.0 부터는 단축키가 바꼈다고 합니다.\n칠을하다 뼈를 바꾸고 싶으면\n뼈위에서 shift + ctrl + 좌클릭 을 하면 뼈를 바꿀 수 있습니다.\n\n\n아 빠르다\n \n \n팁2 - 모델에 뼈 붙이기\n영상: https://www.youtube.com/shorts/w29pAeH_xvU\n\n\n\n영상은 ctrl + p 를 이용해 모델에 뼈를 붙이고 자동으로 weight 를 설정하는 방법을 보여줍니다.\n저는 모델은 그대로 두고 뼈 위치만 바꾸고 싶었는데 그냥 옮기면 모델도 변형이 일어납니다.\n1. 그래서 모델과 뼈를 분리한 후에\n    a. 모델에서 모디파이어를 본다.\n    b. 아마추어 라고 하나 있는데 x 버튼을 눌러 제가한다.\n    c. 뼈와 연결이 제거 됩니다.\n2. 뼈를 옮기고\n3. 모델에 뼈를 다시 붙이기를 애햐합니다.\n    a. object mode 로 간다.\n    b. 모델을 선택하고 shift 누르고 뼈 선택\n    c. ctrl + p 누르고 아마추어 위드 웨이트 오토 인가 그거 누르면 다시 뼈가 붙습니다.\n이때 도움이 된 영상입니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1368",
    "pubDate": "Thu, 31 Jul 2025 15:55:34 +0900",
    "creator": "SIDNFT",
    "categories": [
      "프로그래밍/개발메모",
      "블랜더"
    ]
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "DataGrip and Database tools UX Survey #2 Results",
    "description": "Introduction Hello, DataGrip community! We’re back with the results of our second UX Survey. It’s been nearly a year since the first one, and thanks to your feedback, we’ve made some significant improvements to enhance your experience with DataGrip and Database tools. What was done based on the previous survey: And much more! Check out […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/datagrip/2025/08/04/datagrip-and-database-tools-ux-survey-2-results/",
    "pubDate": "Mon, 04 Aug 2025 14:01:11 +0000",
    "creator": "Dmitry Romanov",
    "categories": [
      "datagrip",
      "survey",
      "ux"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "읽고 끝내는 자기계발서는 이제 그만! ChatGPT와 함께 나만의 워크북 만들기",
    "description": "책을 '읽는 행위'에서 '실천하는 습관'으로! ChatGPT를 활용해 나만의 자기계발 워크북을 만드는 구체적인 방법을 소개합니다. 더 이상 책장에 꽂아두지만 말고, 내 삶의 변화를 위한 첫걸음을 시작해보세요.\n\n\n \n자기계발서, 좋아하시나요? 저도 참 좋아하는데요, 좋은 문장을 발견하면 밑줄을 긋고, 메모하고, 혼자 감탄까지 하죠. 근데 이상하게도, 그렇게 열심히 읽은 책들이 제 삶을 진짜로 바꿔줬던 적은 별로 없었던 것 같아요. 오히려 시간이 지나면 어떤 책을 읽었는지 가물가물해질 때가 더 많더라고요.  \n그러던 어느 날, 우연히 유튜브에서 \"책은 읽는 게 아니라 써야 내 것이 된다. 워크북을 만들어 보세요\"라는 한 크리에이터의 말을 듣게 됐습니다. 이 한마디가 머릿속을 쾅! 하고 울렸달까요? 그래서 저는 그날부터 책 속 문장들을 바탕으로 나만의 실천 워크북을 ChatGPT와 함께 만들기 시작했어요.\n1. 책의 핵심 문장을 정리하기  \n가장 먼저 시작한 책은 김민식 PD님의 베스트셀러, 《매일 아침 써봤니》였어요. 책 전체를 요약하려는 부담은 내려놓고, 제가 정말 인상 깊게 읽은 문장들만 따로 모았죠. 종이책이라면 포스트잇이나 밑줄, 사진 찍기를 활용해도 좋고, 전자책은 밀리의 서재나 리디북스의 메모 기능으로 하이라이트를 정리할 수 있어서 편해요.\n이렇게 모은 문장들을 가지고 ChatGPT에게 이렇게 말했어요. \"제가 밑줄 친 문장을 각 장별로 3가지 핵심 포인트로 요약해 주세요.\" 챕터별로 깔끔하게 정리된 요약을 받아보니, 그 안에서 실천 아이디어로 확장할 수 있을 만한 포인트들이 하나둘씩 눈에 들어오기 시작했습니다. 진짜 신기하더라고요!\n2. 감명 깊은 문장에서 실천 아이디어 뽑아내기  \n책을 읽으며 가장 마음에 남았던 문장은 바로 \"글을 쓰는 사람은 매일 자신을 편집해 나가는 사람이다.\"였어요. 이 문장을 보는 순간, '나도 매일 나를 조금씩 편집할 수 있을까?' 하는 생각이 들었죠. 그래서 바로 ChatGPT에게 이렇게 물어봤습니다.\n  ChatGPT 프롬프트 예시\n\"이 문장(‘글을 쓰는 사람은 매일 자신을 편집해 나가는 사람이다’)을 바탕으로 제가 일상에서 실천할 수 있는 3가지 방법을 알려주세요.\"\n그 결과 나온 제안들은 정말 현실적이었어요. 예를 들어, '하루 한 문장으로 나를 돌아보는 글 써보기', 'SNS 대신 5분간 일기 쓰기', '하루를 마무리하며 \"오늘 내가 가장 자랑스러운 선택은?\"이라고 스스로에게 질문하기' 같은 아이디어였죠. 이렇게 얻은 아이디어들을 바탕으로 자연스럽게 워크북에 넣을 질문과 과제들이 만들어지기 시작했습니다.\n3. 연습 문제는 다양하게 구성하기 ✨\n꾸준히 실천하려면 한 가지 형식보다는 여러 형식의 연습 문제를 섞는 게 좋아요. 제가 주로 사용한 대표적인 형식들을 표로 정리해봤습니다.\n문제 형식\n예시\n\n\n\n\n반성 질문 (Reflection)\n\"나는 어떤 글을 쓸 때 가장 내 마음에 솔직한가요?\"\n\n\n미니 프로젝트 (Mini Project)\n\"하루 5분, ‘감정 일기’ 실험해보기\"\n\n\n습관 추적기 (Habit Tracker)\n\"일주일간 글쓰기 습관 체크리스트 만들어보기\"\n\n\n시각화 질문 (Visualization)\n\"3개월 동안 매일 글을 쓴 나의 모습을 상상해보세요.\"\n\n\n\n이런 질문들은 단순한 ‘독서’를 넘어, 나 자신과 마주보게 하는 대화의 도구가 되어줍니다. 책의 내용을 내 삶으로 끌어당기는 힘이 생기는 거죠.  \n4. 한 챕터만 골라도 충분합니다  \n처음부터 책 전체를 다 워크북으로 만들려고 하면 정말 부담스럽잖아요. 그래서 저는 한 챕터씩, 딱 하나의 문장만 골라 연습 문제를 만들기 시작했습니다. 예를 들어 《매일 아침 써봤니》 중 ‘아침 루틴과 글쓰기’에 대한 챕터를 골라 이렇게 구성해봤어요.\n  실천 워크북 챕터 구성 예시\n핵심 아이디어: 아침은 하루 중 가장 순수한 시간이다.\n반성하기: 나는 아침을 어떻게 보내고 있는가?\n실천하기: 내일 아침 10분만 '마음 흘려쓰기' 실험하기\n기록하기: 7일간 아침 글쓰기 실천 결과 기록지 만들기\n이런 식으로 핵심 → 시도 → 반성 → 추적의 흐름을 따라가면 어떤 책이든 워크북 형식으로 재구성할 수 있습니다. 한 챕터만 완벽하게 내 것으로 만들어도 충분한 성과가 되잖아요.\n5. 나만의 워크북 만들기 (Google Docs 활용)  \n완성된 질문과 과제들은 Google Docs에 정리했어요. 노션(Notion)이나 티스토리 비공개 글 등 편한 도구를 활용하면 됩니다. 제 워크북의 구성은 대략 이랬어요.\n표지: 책 제목과 '나만의 성장 노트'\n시작 노트: 왜 이 책을 선택했고, 무엇을 실천하고 싶은지\n챕터별 연습 문제: 질문 + 실천 + 추적 템플릿\n중간 점검 페이지: \"지금까지 잘한 점은?\", \"아직 어려운 점은?\"\n마무리 편지: \"이 책을 읽고, 나는 이렇게 변했다.\", \"앞으로 무엇을 지속하고 싶은가?\"\nChatGPT에게 \"이 내용을 예쁘게 정리된 워크북 형식으로 만들어주세요 (Google Docs용)\"이라고 요청하면 서식 구성도 도와주니 참고해 보세요!\n \n마무리하며: 책은 곧 도구입니다  ️\n예전엔 책을 다 읽으면 배움도 끝났다고 생각했어요. 하지만 지금은 책을 다 읽은 순간이 진짜 실천의 시작점이 된다는 걸 깨달았죠. 책장에 꽂힌 책이 아니라, 손에 들고 직접 '쓰는' 책이 되어야 하니까요.\n하이라이트 한 줄, 인상적인 문장 하나면 충분합니다. 그걸 ChatGPT에게 보여주고, 질문을 던져보세요. 그 작은 문장이 여러분의 삶에 생각지 못한 작은 변화를 일으킬 수 있습니다. 책이 책장에 꽂혀 있기만 한다면, 너무 아깝지 않을까요? 지금 한 챕터만 골라서, 워크북으로 꺼내보세요. 저처럼 분명히 새로운 ‘무언가’가 시작될 거예요.  \n \n \nChatGPT와 함께 워크북 만들기\n✨ 핵심 문장 정리: 책 전체가 아닌, 인상 깊은 문장만 추려보세요!\n  실천 아이디어 확장: \"내가 일상에서 실천할 수 있는 방법\"을 ChatGPT에게 물어보세요.\n  다양한 문제 구성:\n반성 질문, 미니 프로젝트, 습관 추적기, 시각화 질문 등\n  부담 없이 시작: 한 챕터씩만 골라 연습 문제를 만들어봐도 충분해요!\n책을 '읽기'에서 '쓰기'로 바꿔 당신의 성장을 편집하세요.\n \n자주 묻는 질문 ❓\nQ: 워크북을 만드는 데 꼭 ChatGPT를 써야 하나요?\nA: 꼭 필요한 건 아니지만, ChatGPT는 실천 아이디어를 구체화하고 다양한 연습 문제를 만드는 데 큰 도움을 줄 수 있습니다. 혼자 고민하는 시간을 줄이고, 아이디어를 빠르게 확장하는 좋은 도구죠.\nQ: 워크북을 만들 책은 어떻게 고르는 게 좋을까요?\nA: 가장 좋아하는 책, 혹은 최근에 읽으면서 '이거다!' 하고 감명 깊었던 문장이 있는 책으로 시작해 보세요. 처음부터 부담 없이 시작하는 것이 가장 중요합니다.\nQ: 책 전체를 다 다뤄야 한다는 부담이 있어요.\nA: 굳이 책 전체를 다 다룰 필요는 없습니다. 글에서 제안한 것처럼, 가장 인상 깊은 한 챕터나 문장만 골라 워크북을 만들어도 충분한 효과를 볼 수 있어요. 작게 시작해 보세요!\n\n\n\n    {\n        \"@context\": \"https://schema.org\",\n        \"@type\": \"FAQPage\",\n        \"mainEntity\": [\n            {\n                \"@type\": \"Question\",\n                \"name\": \"워크북을 만드는 데 꼭 ChatGPT를 써야 하나요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  꼭 필요한 건 아니지만, ChatGPT는 실천 아이디어를 구체화하고 다양한 연습 문제를 만드는 데 큰 도움을 줄 수 있습니다. 혼자 고민하는 시간을 줄이고, 아이디어를 빠르게 확장하는 좋은 도구죠.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"워크북을 만들 책은 어떻게 고르는 게 좋을까요?\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  가장 좋아하는 책, 혹은 최근에 읽으면서 '이거다!' 하고 감명 깊었던 문장이 있는 책으로 시작해 보세요. 처음부터 부담 없이 시작하는 것이 가장 중요합니다.\"\n                }\n            },\n            {\n                \"@type\": \"Question\",\n                \"name\": \"책 전체를 다 다뤄야 한다는 부담이 있어요.\",\n                \"acceptedAnswer\": {\n                    \"@type\": \"Answer\",\n                    \"text\": \"  굳이 책 전체를 다 다룰 필요는 없습니다. 글에서 제안한 것처럼, 가장 인상 깊은 한 챕터나 문장만 골라 워크북을 만들어도 충분한 효과를 볼 수 있어요. 작게 시작해 보세요!\"\n                }\n            }\n        ]\n    }",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483631",
    "pubDate": "Fri, 1 Aug 2025 16:11:41 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "chatgpt 활용",
      "글쓰기",
      "독서법",
      "성장",
      "습관",
      "실천",
      "워크북",
      "자기계발",
      "자기계발서"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "Watch Live: Visual Studio Toolbox at VS LIVE! Redmond 2025",
    "description": "Join Robert Green and Leslie Richardson for a full day of live sessions, demos, and interviews. Live from Microsoft HQ – Stream Tuesday’s Sessions with Visual Studio Toolbox! On Tuesday, August 5, join us for a special edition of Visual Studio Toolbox Live—broadcast from VS LIVE! Redmond and hosted by Leslie Richardson and Robert Green. […]\nThe post Watch Live: Visual Studio Toolbox at VS LIVE! Redmond 2025 appeared first on Visual Studio Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/visualstudio/watch-live-visual-studio-toolbox-at-vs-live-redmond-2025/",
    "pubDate": "Tue, 29 Jul 2025 15:28:53 +0000",
    "creator": "Jim Harrer",
    "categories": [
      "Visual Studio"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "독일 스타트업 생태계 분석 - 유럽 최대 시장에서 성공하는 법",
    "description": "독일은 유럽에서 가장 강력한 경재력을 가진 국가이자, 스타트업 혁신의 중심지입니다. 특히 베를린은 세계적으로 주목받는 창업 도시 중 하나로, 핀테크 / 클린테크 / 모빌리티 분야의 선도 허브입니다. 안정적인 산업 기반, 유럽 전역으로 확장 가능한 시장, 강력한 정부 지원정책 덕분에 글로벌 스타트업에게 매력적인 기회를 제공합니다. 이번 포스팅에서는 독일 스타",
    "reviews": [],
    "syllabus": [],
    "link": "https://brunch.co.kr/@@LOc/302",
    "pubDate": "Thu, 31 Jul 2025 03:00:10 GMT",
    "creator": "고명환",
    "categories": []
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "토스, ‘2025 토스 NEXT 개발자 챌린지’ 접수 시작 ",
    "description": "총 5개 분야에서 경력 3년 이하 개발자 최대 50명 영입 목표",
    "reviews": [],
    "syllabus": [],
    "link": "https://toss.im/tossfeed/article/2025next",
    "pubDate": "Wed, 30 Jul 2025 05:09:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "WebStorm 2025.2: TypeScript-Go Language Server Support, Baseline Support, Bun Improvements, and More",
    "description": "Our second major release of 2025 is here! This release introduces various new features and addresses several challenges. Key improvements include experimental TypeScript-Go language server support, Baseline support, Bun improvements, and a range of essential updates. Starting with this release, we’ll be including noteworthy features from minor updates in our main release blog posts. Since […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/webstorm/2025/08/webstorm-2025-2/",
    "pubDate": "Mon, 04 Aug 2025 12:52:49 +0000",
    "creator": "David Watson",
    "categories": [
      "news",
      "releases",
      "webstorm-2025-2"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "non-raid구성+raid 구성을 위해 VMD Controller 부분적으로 활성화하기",
    "description": "여차저차 해서 결국 970 EVO 1TB가 2개 남는 상황이 됐다. 이미 메인 데스크탑은 990Pro 2TB에 OS와 필요한 어플들 설치를 끝낸 상황이므로 이건 그대로 두고 970EVO 2개를 raid로 묶어서 추가하고 싶다. 990 Pro에 OS설치할 때는 먼저 사용하던 RAID를 해제하고(VMD Controller 비활성화) AHCI모드로 돌려놓은 상태에서 990 pro에 Windows를 설치했었다. 이 상태에서 SSD 2개를 추가해서 RAID묶겠다고 VMD Controller를 … More non-raid구성+raid 구성을 위해 VMD Controller 부분적으로 활성화하기",
    "reviews": [],
    "syllabus": [],
    "link": "https://megayuchi.com/2025/07/30/non-raid%ea%b5%ac%ec%84%b1raid-%ea%b5%ac%ec%84%b1%ec%9d%84-%ec%9c%84%ed%95%b4-vmd-controller-%eb%b6%80%eb%b6%84%ec%a0%81%ec%9c%bc%eb%a1%9c-%ed%99%9c%ec%84%b1%ed%99%94%ed%95%98%ea%b8%b0/",
    "pubDate": "Wed, 30 Jul 2025 10:18:42 +0000",
    "creator": "megayuchi",
    "categories": [
      "IT",
      "Pub",
      "컴퓨터일반",
      "RAID",
      "ssd",
      "Windows"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "싱가포르 스타트업 성공 전략 - 아시아 창업 허브의 비밀",
    "description": "싱가포르는 동남아시아 스타트업 생태계의 중심지로, 세계에서 가장 창업 친화적인 국가 중 하나로 꼽힙니다. 낮은 법인세, 글로벌 금융 허브, 영어 사용 환경, 그리고 정부 주도의 강력한 스타트업 지원정책 덕분에 아시아는 물론 글로벌 스타트업들이 싱가포르를 베이스캠프로 삼고 있습니다. 이번 포스팅에서는 싱가포르 스타트업 생태계의 특징, 주요 산업, 정부 지원정",
    "reviews": [],
    "syllabus": [],
    "link": "https://brunch.co.kr/@@LOc/303",
    "pubDate": "Fri, 01 Aug 2025 03:00:11 GMT",
    "creator": "고명환",
    "categories": []
  }
]