[
  {
    "id": 1,
    "imageUrl": "",
    "title": "2025 활기찬 노후를 위한 중장년 시니어 정책 총정리: 중장년경력지원제부터 치매안심센터까지",
    "description": "대표적인 중중년 시니어 정책 모아보기",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.toss.im/article/money-policies-41",
    "pubDate": "Fri, 02 May 2025 01:02:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "There’s a Linux File Explorer built into Visual Studio!?!",
    "description": "The Remote File Explorer in Visual Studio provides developers with a convenient way to browse, view, and edit files on remote machines—directly from within the IDE. It’s a powerful tool for managing remote environments without leaving your development workflow. Scott Hanselman published a new YouTube video to his channel, taking us on the journey of […]\nThe post There’s a Linux File Explorer built into Visual Studio!?! appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/theres-a-linux-file-explorer-built-into-visual-studio/",
    "pubDate": "Thu, 01 May 2025 15:44:39 +0000",
    "creator": "Sinem Akinci",
    "categories": [
      "C++"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "개인정보가 불안할 때, 토스 쓰면 안전한 이유",
    "description": "명의 도용 방지, 악성 앱 탐지, 가족 보안 지킴이 등 토스로 내 정보 지키는 법",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.toss.im/article/toss-guide-safety",
    "pubDate": "Fri, 02 May 2025 10:21:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "해외주식 백트래킹 사이트.",
    "description": "안녕하세요. 최근 주식 백트래킹 사이트를 운영하고 있습니다.\nhttps://deepquant.app\n\n \nDeepQuant - 나만의 전략을 위한 주식 백테스팅\nDeepQuant에서 이동평균선, 볼린저밴드 등 다양한 지표를 활용하여 나만의 주식 투자 전략을 만들고 과거 데이터로 성과를 검증해보세요. 쉽고 빠른 무료 백테스팅을 경험하세요!\ndeepquant.app\n\n아직 제공하고 있는 기능은 많이 없지만, 점차 늘려갈 예정입니다!\n사이트 접속시 노출되는 화면.\n\n\n원하는 해외주식 종목을 선택해서 그동안 생각했던 매수/매도조건을 테스트 해볼 수 있도록 제작 하였습니다.\n저는 이평선과 볼린저밴드를 주로 많이 보는 편인데요. 이를 바탕으로 제작 해보았습니다.\n추후 기능들을 더 넣을 예정입니다.\n트레이딩 안전 설정\n\n\n트레이딩 안전 설정을 사용하시면, 상승채널일때만 매매하는 테스트도 진행해볼 수 있습니다. \n \ni 마크에 마우스 올리면 노출되는 안내문구.\n\n\n기능 이해가 잘 안 되시는 경우에는 i 버튼에 마우스 올리시면 설명이 노출되도록 해두었습니다.\n \n백테스트 결과\n\n\n백테스트 히스토리는 위와 같이 나오는데요. 어떤 전략으로 인하여 매수/매도가 발생했는지 알 수 있게 매매 히스토리를 제공합니다.\n \n어느 기능을 더 추가해야할지 잘 감이 안 옵니다. 행잉맨, 해머, 슈티스타, 반전 해머, 비석형, 드래건플라이, 긴십자형, 상승장악형 등등 다양한 캔들 패턴이 있는데, 이를 어떤 패턴으로 제공하면 좋을지 잘 모르겠습니다. 어떤 패턴들을 잘 보시는지 모르겠습니다. 댓글을 통하여 알려주시면 다음 기능 추가시에 적극 반영하겠습니다.\n이런식으로 알려주시면 더 좋은 참고가 될 거 같습니다.\n상승장악형 - 전 하락캔들이 3%일때, 5%이상 상승장악 캔들이 나오면 매수 ( 혹은 반대의 케이스에 매도 )\n \n감사합니다!\n \n \n서비스를 바탕으로 기능을 정리 해보았습니다. 사용시 참고하시면 될 거 같습니다. 사이트에 기재된 글이기도 합니다.\n1. DeepQuant: 주요 기능 살펴보기\nDeepQuant는 사용자가 코딩 없이 자신만의 주식 투자 전략을 과거 데이터로 검증해볼 수 있는 웹 기반 백테스팅 서비스입니다. 제공된 프론트엔드 코드를 통해 다음과 같은 기능들을 확인할 수 있습니다.\n핵심 기능: 주식 백테스팅\n전략 시뮬레이션: 사용자가 설정한 매수/매도 조건에 따라 특정 주식(티커)의 과거 데이터를 기반으로 가상 투자를 실행하고 그 결과를 확인합니다.\n웹 기반 인터페이스: 별도의 프로그램 설치 없이 웹 브라우저에서 모든 기능을 이용할 수 있습니다.\n백테스팅 설정\n기본 정보 입력:\n\n티커 검색: 분석할 주식의 티커 심볼 또는 회사 이름을 입력하면 관련 주식이 자동으로 추천됩니다\n초기 예수금 설정: 백테스팅을 시작할 가상 투자금을 달러($) 단위로 입력합니다\n조회 기간 설정: 백테스팅을 수행할 시작 년/월과 종료 년/월을 'YYYY.MM' 형식으로 입력하거나 달력 UI를 통해 선택합니다\n\n분봉 매매 옵션: (베타/옵션 기능으로 추정) '분봉으로 매매하기' 체크 시 더 짧은 시간 간격으로 테스트할 수 있으며, 이 경우 조회 기간이 제한될 수 있습니다.\n매수 조건 설정:\n\n상세 조건 추가: '+' 버튼을 눌러 매수 신호를 발생시킬 조건을 동적으로 추가할 수 있습니다\n\n이동평균선(SMA) 우상향: 단기 이동평균선이 장기 이동평균선을 상향 돌파하는 시점을 조건으로 설정합니다 (예: 5일선이 20일선을 돌파)\n볼린저 밴드: 가격이 볼린저 밴드 하단에 근접하거나 특정 %B 값(%B < 임계값) 이하일 때를 조건으로 설정합니다 (기간, 표준편차 배수 K, %B 임계값 설정)\n(준비중) RSI, MACD, 스토캐스틱: 향후 추가될 지표로 UI 상에 표시되어 있습니다\n매수 투자 조건:\n\n투자 단위: 매수 시 투자할 금액을 현재 보유 예수금의 비율(%) 또는 고정 금액(달러)으로 설정할 수 있습니다\n매도 조건 설정:\n\n상세 조건 추가: '+' 버튼으로 매도 신호 조건을 추가합니다\n\n이동평균선(SMA) 우하향: 단기 이동평균선이 장기 이동평균선을 하향 돌파하는 시점을 조건으로 설정합니다\n볼린저 밴드: 가격이 볼린저 밴드 상단에 근접하거나 특정 %B 값(%B > 임계값) 이상일 때를 조건으로 설정합니다\n수익/손실률 기준: 목표 수익률(%) 또는 손절 기준(%)을 설정하여 매도할 수 있습니다. (체크박스로 활성화)\n(준비중) RSI, MACD, 스토캐스틱: 향후 추가될 지표로 UI 상에 표시되어 있습니다\n매도 투자 조건:\n\n매도 단위: 매도 시 매도할 수량을 현재 보유 주식의 비율(%) 또는 고정 수량(주)으로 설정할 수 있습니다.\n트레이딩 안전 설정 (선택 사항):\n\n활성화 토글: 전체 안전 설정을 켜고 끌 수 있는 스위치가 제공됩니다\n세부 규칙:\n\n최소 보유 기간: 매수 후 최소 N일(캔들 수) 동안 매도를 금지합니다 (수익/손실률 기준 제외).\n재진입 쿨다운: 매도 후 최소 N일 동안 재매수를 금지합니다.\n최소 가격 변동: 마지막 매도 가격 대비 N% 이상 가격 변동 시에만 다음 매수가 가능합니다.\n최대 연속 거래: 같은 방향(매수 또는 매도)으로 연속 N회까지만 거래를 허용합니다.\n채널 감지: 특정 조건(기간, 상승 기울기%, 유효성 임계값)을 만족하는 가격 채널 패턴이 감지될 때만 거래를 실행하도록 필터링할 수 있습니다.\n\n이 기능 활성화 시, 설정된 매수/매도 조건 외에 추가적으로 채널 조건을 만족해야 거래가 실행됩니다. (툴팁 설명 참고)\n결과 확인 및 분석\n요약 정보: 백테스팅 실행 시 설정된 티커, 기간, 조건 등 주요 설정값을 요약하여 보여줍니다. 이 영역은 접고 펼 수 있습니다.\n상세 거래 내역:\n\n날짜별 매매 활동(매수, 매도, 보유), 실행 조건, 보유 주식 수, 거래별 수익률(금액 및 %), 예수금 변화, 총 평가금액(예수금+주식 평가액)을 표 형태로 제공합니다\n수익률은 상승 시 빨간색(▲), 하락 시 파란색(▼)으로 시각적으로 구분됩니다.\n로딩 상태 표시: 백테스팅 실행 중에는 로딩 스피너와 함께 '분석 중...' 메시지가 표시됩니다.\n커뮤니티 및 추가 정보\n실시간 백테스팅 현황: 다른 사용자들이 최근 실행한 백테스팅 정보(티커, 수익률 등)를 사이드바에서 실시간으로 확인할 수 있습니다. 상세 전략은 접기/펼치기로 볼 수 있습니다.\nTop 백테스팅 결과: 높은 수익률을 기록한 백테스팅 결과 상위 N개를 사이드바에서 보여줍니다. 상세 전략 확인이 가능합니다.\n서비스 소개 페이지: 서비스 기능, 사용 가이드, 백테스팅 개념, 사용되는 기술적 지표(이동평균선, 볼린저밴드)에 대한 설명을 별도 페이지에서 탭 형식으로 제공합니다.\n게시판:\n\n사용자 간 소통을 위한 게시판 기능을 제공합니다.\n글쓰기: 제목, 닉네임, 비밀번호, 내용(Toast UI 에디터 사용)을 입력하여 게시글을 작성할 수 있습니다. 이미지 첨부(업로드 토큰 필요, 진행률 표시) 기능이 포함된 위지윅/마크다운 에디터를 제공합니다.\n글 목록: 게시글 목록을 제목, 글쓴이(IP 일부 표시), 작성시간, 댓글 수와 함께 보여주며, 공지 기능 및 페이지네이션을 지원합니다.\n글 상세 보기: 게시글 내용, 작성자 정보(닉네임, IP 일부, 작성시간, 고유번호)를 보여주며, 비밀번호를 이용한 게시글 삭제 기능을 제공합니다.\n댓글: 닉네임, 비밀번호, 내용을 입력하여 댓글을 작성하고, 작성된 댓글 목록(작성자, IP 일부, 시간)을 볼 수 있습니다. 비밀번호를 이용한 댓글 삭제 기능을 제공합니다.\n기타\n반응형 디자인: 데스크톱, 태블릿, 모바일 등 다양한 화면 크기에 맞춰 레이아웃이 조절됩니다 (CSS 파일 확인).\n투자 유의사항 안내: 모든 페이지 하단에 백테스팅 결과는 과거 데이터 기반이며 미래 수익을 보장하지 않고, 투자 결정 책임은 사용자에게 있다는 면책 조항이 명시되어 있습니다.\n2. DeepQuant 백테스팅, 이렇게 사용해보세요! (단계별 가이드)\nDeepQuant 서비스를 이용하여 나만의 주식 매매 전략을 백테스팅하는 방법은 다음과 같습니다.\n1단계: 기본 정보 입력\n티커 입력:\n\n'티커' 입력란에 분석하고 싶은 주식의 티커 심볼(예: AAPL) 또는 회사 이름을 입력 시작합니다.\n입력과 동시에 관련 주식 목록이 자동으로 나타나면, 원하는 주식을 클릭하여 선택합니다.\n예수금 입력:\n\n'예수금' 입력란에 백테스팅을 시작할 초기 가상 투자금을 달러($) 단위 숫자로 입력합니다. (예: 10000)\n2단계: 매수 조건 설정\n매수 상세 조건 추가:\n\n'매수상세조건' 섹션에서 [+ 조건 추가] 버튼을 클릭합니다.\n나타나는 드롭다운 메뉴에서 원하는 매수 조건(예: '이평선 우상향', '볼린저 밴드')을 선택합니다.\n선택한 조건에 필요한 파라미터 값을 입력합니다.\n\n이평선 우상향: 단기 N일선 값과 장기 M일선 값을 입력합니다. (예: 5, 20)\n볼린저 밴드: 기간(예: 20), 표준편차 배수 K(예: 2.0), 매수할 %B 임계값(예: 0.2)을 입력합니다.\n필요한 만큼 조건을 더 추가할 수 있습니다.\n매수 투자 조건 설정:\n\n'매수투자조건' 섹션에서 매수 시 투자할 금액 또는 비율을 입력합니다.\n숫자 입력 후, 옆의 단위 토글 버튼을 클릭하여 '%'(예수금 비율) 또는 '달러'(고정 금액)를 선택합니다.\n3단계: 매도 조건 설정\n매도 상세 조건 추가:\n\n'매도상세조건' 섹션에서 [+ 조건 추가] 버튼을 클릭합니다.\n드롭다운 메뉴에서 원하는 매도 조건(예: '이평선 우하향', '볼린저 밴드', '수익/손실률 기준')을 선택합니다.\n선택한 조건에 필요한 파라미터 값을 입력합니다.\n\n이평선 우하향: 단기 N일선 값과 장기 M일선 값을 입력합니다.\n볼린저 밴드: 기간, K값, 매도할 %B 임계값(예: 0.8)을 입력합니다.\n수익/손실률 기준: 해당 조건을 추가하면 '목표 수익률'과 '손절 기준' 입력란이 나타납니다. 사용하려는 항목 앞의 체크박스를 선택하고 원하는 비율(%)을 입력합니다. (둘 중 하나 또는 둘 다 활성화 가능)\n필요한 만큼 조건을 더 추가할 수 있습니다. ('수익/손실률 기준'은 하나만 추가 가능)\n매도 투자 조건 설정:\n\n'매도투자조건' 섹션에서 매도 시 매도할 수량 또는 비율을 입력합니다.\n숫자 입력 후, 옆의 단위 토글 버튼을 클릭하여 '%'(보유량 비율) 또는 '주'(고정 수량)를 선택합니다.\n4단계: 트레이딩 안전 설정 (선택 사항)\n안전 설정 활성화:\n\n'트레이딩 안전 설정' 섹션 우측의 토글 스위치를 클릭하여 기능을 활성화합니다.\n세부 규칙 설정:\n\n사용하려는 안전 규칙 앞의 체크박스를 선택합니다.\n선택된 규칙에 필요한 숫자 값을 입력합니다 (예: 최소 보유 기간 '5'일, 재진입 쿨다운 '3'일 등).\n채널 감지를 활성화하면, 추가적으로 '감지 기간', '상승 기울기', '유효성 임계값'을 설정하는 입력란이 나타납니다. 필요한 값을 입력합니다.\n5단계: 조회 기간 설정 및 실행\n조회 기간 입력:\n\n'조회기간' 섹션에서 백테스팅을 시작할 년/월과 종료할 년/월을 'YYYY.MM' 형식으로 직접 입력하거나, 입력란 옆의 달력 아이콘( )을 클릭하여 원하는 년도와 월을 선택합니다.\n주의: 시작 날짜는 종료 날짜보다 반드시 이전이어야 합니다.\n(선택) 분봉 매매: '분봉으로 매매하기' 체크박스를 선택하면 분 단위 데이터로 테스트합니다. 이 경우 조회 기간이 자동으로 조절될 수 있습니다.\n결과 보기:\n\n모든 설정이 완료되면 [결과 보기] 버튼을 클릭합니다. 버튼이 '분석 중...'으로 바뀌며 로딩 스피너가 나타납니다.\n6단계: 결과 해석\n요약 정보 확인:\n\n결과 영역 상단에 설정했던 티커, 기간, 주요 조건들이 요약되어 표시됩니다. '상세조건' 부분을 클릭하여 접거나 펼 수 있습니다.\n상세 거래 내역 확인:\n\n'결과' 섹션에 상세한 거래 내역이 표 형태로 나타납니다.\n날짜: 거래 발생 시점\n매매: 매수 / 매도 / 보유 상태\n조건: 해당 거래를 발생시킨 조건\n소유 주식 수: 해당 시점 보유 주식 수\n수익률: 해당 거래로 인한 수익/손실 금액\n수익률(%): 해당 거래로 인한 수익/손실률 (%)\n예수금: 해당 시점 보유 현금\n총 평가금액: 보유 현금과 보유 주식의 평가 가치를 합한 총 자산. 이 값의 추세가 전략의 전반적인 성과를 나타냅니다.\n표를 통해 전략의 진입/청산 시점, 수익/손실 발생 패턴 등을 분석할 수 있습니다.\n추가 팁\n초기화: 설정값을 모두 지우고 처음부터 다시 시작하려면 [초기화] 버튼을 사용하세요.\n다른 사용자 결과 참고: 메인 페이지 우측의 '실시간 백테스팅 현황'과 'Top 백테스팅 결과'를 참고하여 다른 사용자들은 어떤 전략을 테스트하는지 살펴보세요. 클릭하면 상세 조건을 확인할 수 있습니다.\n지표/용어 이해: '서비스 소개' 페이지의 '백테스팅이란?', '지표 설명' 탭에서 관련 용어와 기술적 지표(이동평균선, 볼린저밴드)에 대한 설명을 참고하면 전략 수립에 도움이 됩니다.\n커뮤니티 활용: 궁금한 점이나 전략 아이디어는 '게시판'을 통해 다른 사용자들과 공유하고 토론해 보세요.\n주의: DeepQuant는 정보 제공 및 교육 목적으로 제공되며, 백테스팅 결과는 과거 데이터에 기반한 시뮬레이션으로 미래 수익을 보장하지 않습니다. 모든 투자 결정의 책임은 사용자 본인에게 있습니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://kwongyo.tistory.com/46",
    "pubDate": "Fri, 2 May 2025 01:04:21 +0900",
    "creator": "KwonGyo",
    "categories": [
      "주식백테스트",
      "주식시뮬레이션",
      "주식테스트",
      "해외주식",
      "해외주식백테스트",
      "해외주식백트래킹"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "한비자, 관계의 기술",
    "description": "사람 대 사람 사이에서 가장 중요한 건 서로간의 '이득' 이라는 것을 책 한권을 통해 전달하는 것으로 읽혔다.\n이득 기반으로 인간 관계가 움직인다는 사상을 인정하고 좋아하기에 전체적인 내용을 많이 동의했다.\n내 기준에서 회사는 4단계의 계층이 있다고 본다.\n대표\nC레벨 혹은 임원\n중간 리더\n팀원\n이 중 이 책에서 언급되는 \"군주\"는 사실상 회사의 대표라고 볼 수 있는데, 대표에게 직언을 할 수 있는 위치인 C레벨 (혹은 임원)은 이 책의 여러 고사들에게서 배울 점이 많다.\n그 중에서도 아래 메세지들은 지금의 내 위치에서 생각해볼 것들이 많았다.\n\"군주에게 간언하고 설득하는 자는 군주가 자기를 사랑하는지, 미워하는지 살펴 본 후 설득해야 한다는 것을 알 수 있다\"\n\"누군가를 설득할 때에는 상대방이 수치심을 느끼거나 부끄러워하는 감정을 건드리지 말아야 한다\"\n\"일반적으로 군주들은 신임하지 않는 자가 간언하면 비방한다고 생각하고, 신임하는 사람이 간언하지 않으면 봉록만을 훔치는 자라고 생각하는 경향이 있다\"\n\"군주에게서 충분한 신임을 얻기 전까지는 간언을 조심해야하며, 신뢰를 얻은 후에는 간언을 계속 해야하며, 신뢰의 정도에 따라 간언의 수위를 조절해야하며, 간언을 전달할 때는 최대한 역린을 건드리지 않도록 주의하면서 전달해야한다\" 로 정리될 수 있다.\n이 내용은 군주에게 간언해야하는 위치의 사람들이 항상 생각해야할 것들이다.\n회사로 본다면 아마도 C레벨과 임원들이 해당될 것 같다.\n종종 회사에 합류하자마자 바로 어떠한 액션을 취하려고 강한 주장을 하거나 대표에게 직언을 하는 리더나 임원들의 이야기들을 들을때가 있다.\n그리고 그 리더는 대부분 얼마가지 않아 퇴사를 했다는 것도.\n상위 직급자와 나와의 신뢰 관계는 어느 정도이며, 이 정도에서는 어디까지의 이야기가 허용 가능한지 판단할 수 있는 시야를 갖고 있는 사람이 좋은 리더가 될 수 있다는 생각이 들었다.\n또 하나 중요한 점은 C레벨 혹은 중간 리더는 본인의 신뢰 자산을 기반으로 아직 충분한 신뢰 자산이 쌓이지 않은 팀원들의 건설적인 의견을 대표에게 잘 전달해야한다는 것이다.\n예전에 태호님이 작성하신 쿠팡의 통역가분들에 대한 이야기 를 보고나서, 이것이 조직의 중간 리더의 역할과 다를 바 없다고 생각이 들었다.\n“회사가 커지면 상하 위계 간은 물론이고 각 조직 간의 크고 작은 이해관계와 알력다툼이 만연하며 성장 속도가 늦어지는데, 어째서 쿠팡은 이렇게 되지 않았고 이를 최소화할 수 있었을까?”\n나중에 문득 깨달은 것이지만, 나는 바로 쿠팡의 통역사분들이 이를 가능하게 했다고 감히 생각한다.\n쿠팡은 한국 본사의 임원진부터 글로벌 오피스의 실무자까지 많은 외국인들과 함께 일한다.\n업무 시 공용어는 한국어보다는 영어다.\n모든 주요 문서는 영어로 작성되고 모든 주요 미팅에는 전담 통역사가 함께 들어와 실시간 통역을 지원한다.\n그런데 이분들의 실시간 통역이란 것이 단순히 영어를 한글로, 한글을 영어로 바꿔 말하는 게 다가 아니더라.\n쿠팡의 통역사분들은 수많은 미팅에 들어가고 문서를 검토하며 회사 전반과 각 조직의 가장 많은 정보와 컨텍스트를 갖고 있어 이것이 마법을 만들어낸다.\n예를 들어,\n누군가 오해를 살 수 있는 표현을 해도 -> 통역이 오해 없도록 명확한 용어로 바뀐다.\n누군가 잘못된 정보를 근거로 해도 -> 통역 시 가볍게 다시 물어 정정할 수 있도록 한다.\n누군가 조직 이기주의 등 편협한 소리를 해도 -> 통역이 톤앤매너를 조절해 건설적으로 이것이 논의될 수 있는 기회로 바꾼다.\n미팅이 같은 말을 반복하며 빙빙 돌고 있어도 -> 통역이 간파하고 원래의 주제에서 결론을 낼 수 있도록 넛지를 한다.\n누군가 너무 감정적이거나 화를 내도 -> 통역이 그 감정이 잠시 담길 작은 버퍼가 되어준다.\n등등등\n정말 수많은 부분에서 통역사분들의 역량이 발휘된다.\n굉장한 건 이것들이 미팅 안에서 절대 티가 나지 않는다는 것이다.\n통역사가 주인공이 되는 일은 없다.\n다만 그 미팅은 여러 함정을 무사히 넘기고 좋은 의사 결정을 이룬다.\n누군가 정말 잘하는 것들은 그대로 스며들어 당연한 것이 되지 잘한 티가 나지 않더라.\n팀원들은 아직까지 조직간 관계나 처세 등에 대해 익숙하지 않다.\n대표와의 신뢰 관계도 충분하지 않다.\n이런 상황에서 팀원 -> 대표로의 간언은 유효할 확률이 거의 없다.\n이때 중간 리더가 (쿠팡의 통역처럼) 팀원의 의견을 잘 해석하여 대표가 설득될 수 있는 수준으로 포장하여 전달해야하는 역할을 해야한다.\n중간 리더의 신뢰 자산은 그러라고 쌓는 것이다.\n물론 이 외에도 조직원들을 어떻게 대해야하는지에 대해서도 인사이트를 얻을 수 있었다.\n조직 내에서 해야할 일들에 대해서 \"이 일은 본인에게도 좋은 일이다\" 는 것으로 자연스럽게 귀결 될 수 있도록 전달하는 것이 참 중요하다.\n조직장으로서는 이 일을 개인을 위한 일 인것처럼 느껴지게 할 것인지를 고민해야하고,\n개인은 어떻게 하면 이 일이 나에게 도움이 되도록 해석할 것인가가 전체적인 삶의 만족도를 결정하게 되는 것 같다.\n책 속 문장\n한비자는 인간은 이해득실만을 따질 뿐 도덕성은 생각하지 않는다고 보았다.\n그는 이것을 부모가 낳은 아이가 아들일 경우와 딸일 경우 보여주는 행동의 차이로 설명했다.\n아들이나 딸 모두 부모의 품에서 나왔지만, 아들을 선호하는 것은 따지고 보면 부모 자신의 노후를 걱정한 데서 비롯된다는 것이다.\n또한 사람들의 이해관계는 늘 어긋난다.\n예컨대 군주와 신하가 생각하는 이익이 각기 다르며, 남편과 아내, 형과 아우 사이에도 이해는 서로 엇갈리기 마련이다.\n이 중에서도 특히 군주와 신하는 남남이 만나 각자의 이익을 추구하는 관계이므로 군주가 신하에게 충성만을 요구한다거나 도덕만으로 다스린다는 것은 어리석은 일이다.\n[옛날 미자하는 위나라 왕에게 총애를 받았다.\n위나라의 범에 왕의 수레를 몰래 타는 자에게는 발이 잘리는 형벌을 내리도록 하였다.\n미자하의 어머니가 병들었을 때 어떤 사람이 밤에 몰래 와서 미자하에게 알려주었다.\n그러자 미자하는 슬쩍 왕의 수레를 타고 나갔다.\n왕은 이 일을 듣고 그를 칭찬하며 말하였다.\n\"효자로구나. 어머지를 위하느라 발이 잘리는 벌도 잊었구나!\"\n다른 날 미자하는 왕과 함께 정원에서 노닐다가 복숭아를 따먹게 되었는데, 맛이 아주 달자 반쪽을 왕에게 주었다.\n왕이 말하였다.\n\"나를 사랑하는구나. 맛이 좋으니 과인을 잊지 않고 맛보게 하는구나\"\n세월이 흘러 미자하의 미모가 쇠하고 왕의 사랑도 식게 되었을 때 한번은 미자하가 왕에게 죄를 지었다.\n그러자 왕은 이렇게 말하였다.\n\"이놈은 옛날에 과인의 수레를 몰래 훔쳐 타기도 하고, 또 자기가 먹던 복숭아를 과인에게 먹으라고 내밀기도 하였다.\"\n미자하의 행동은 변함이 없었으나 전에는 칭찬을 받았지만 뒤에는 벌을 받은 까닭은 사랑이 미움으로 바뀌었기 때문이다.]\n...\n군주에게 간언하고 설득하는 자는 군주가 자기를 사랑하는지, 미워하는지 살펴 본 후 설득해야 한다는 것을 알 수 있다.\n...\n비단 왕뿐 아니라 사람에게도 저마다 역린이 있다.\n누군가를 설득할 때에는 상대방이 수치심을 느끼거나 부끄러워하는 감정을 건드리지 말아야 한다.\n아무리 논리적으로 설득할지라도 외면당할 수 있기 때문이다.\n결국 상대방의 마음을 잘 헤아려 나의 의도를 그에게 맞추려면 상대방의 역린을 읽어낼 수 있는 감수성이 필요하다.\n설득은 마음을 움직이는 일이므로 논리보다는 감성이 앞선다고 할 수 있다.\n노자는 통치술의 첫째로서, 통치가의 존재 그 자체를 부정하고 있다.\n앞에 나서서 설치는 자는 최상의 군주가 아니고 뒤에서 조용히 조종하는 자가 최상이라는 것이다.\n물론 그 존재 자체도 느끼지 못할 때 그것이 최상이다.\n일반적으로 군주들은 신임하지 않는 자가 간언하면 비방한다고 생각하고, 신임하는 사람이 간언하지 않으면 봉록만을 훔치는 자라고 생각하는 경향이 있다.\n그러므로 신하들은 충성스러운 간언을 할 분위기가 조성되지 않으면 침묵하게 된다.\n이러한 문제를 해결하고자 당 태종은 간언을 독려한다.\n\"사람이 자기 얼굴을 보려면 반드시 맑은 거울이 있어야 하고, 군주가 자기 허물을 알려면 반드시 충직한 신하에 의지해야 하오.\n군주가 만일 자신을 현인이나 성인이라고 여기는 착각에 빠져있고, 신하도 정확한 의견을 제시하여 바로잡지 않는다면, 이런 상황에서 위험과 실패를 면하는 것이 어찌 가능하겠소?\n군주가 국토와 사직을 버리면 신하 또한 자신의 집안을 보존할 수 없소.\n수양제는 잔인하고 포학했지만 신하가 입을 다문 채 아무 말도 하지 않았으므로 자기에게 어떤 허물이 있는지 듣지 못했소.\n결국 나라는 멸망했소.\n우세기 등의 대신 또한 오래지 않아 피살되었소.\n이것은 과거 오래전의 일이 아니오.\n대신들은 내가 백성들에게 불리한 일을 하는 것을 보게 되면, 반드시 거리낌 없이 직언을 하여 비판 해야 하오.\"\n한비자는 도성을 떠나 유람을 가는 것 또한 지극히 경계했다.\n군주가 궁궐을 비우고 외부로 떠나는 것은 결국 궁정의 긴장감을 무너뜨리게 되므로, 조직의 긴장도를 위해 군주는 유람할 시간이 없다는 것이다.\n아이가 어릴 때 부모의 양육이 소홀하게 되면, 그 자식은 성장하여 부모를 원망하게 된다.\n또 그 자식이 장년이 되었을 때 부모에 대한 효도를 망각하면, 그 부모는 자식을 책망하게 될 것이다.\n부자 사이는 가장 친밀한 사이임에도 책망하거나 원망한다는 것은 서로 상대가 자기를 위해서 일을 한다는 마음이 없었기 때문이다.\n아랫사람을 고용하여 씨앗을 뿌리거나 경작을 시킬 때, 주인이 집안 살림에서 과용을 하며 좋은 음식과 쫗은 옷을 주고 노동의 대가로 돈도 챙겨주는 것은 그 아랫사람을 배려하기 때문이 아니다 .\n그렇게 후하게 대해야만 깊이 땅을 팔 것이며, 잡초를 샅샅이 뽑으리라 생각하기 때문인 것이다.\n...\n결국 주인과 일하는 사람 양쪽 모두 자기 이익만을 생각하고 있는 것이다.\n그러므로 자기에게 이익이 되도록 일을 하면 적대적인 나라 사람과도 우호적으로 지낼 수 있고, 자기 이익을 떠나게 되면 부자지간도 서로가 원망하게 된다는 것이다.\n...\n남을 위해 죽도록 일하는 것이 아니라 자신의 이익과 목표를 위해 일한다고 생각하면 상대에 대한 평가도 어렵지 않으리라.\nps.\n여담이지만, 챕터별로 편차가 있지만, 챕터의 제목과 챕터의 전반부/후반부의 내용이 상이해서 생뚱 맞다는 느낌을 받았다.\n챕터의 첫번째 사례로 드는 고사는 제목과 잘 어울려서 챕터를 이해하는데 도움이 되었지만, 두번째, 세번째 고사는 사실 챕터에서 이야기하고자 하는 바와 어울리지 않을 때가 많아서 띠용한 적이 종종 있다.\n예를 들어 \"15. 만족을 모르면 근심도 떠나지 않는다\" 에서 2번째 고사는 새옹지마 사례다보니 '일희일비 하지 않는다' 라는 주제에선 어울리겠지만, '만족할 줄 알아야 한다'를 이야기해야하는 이 챕터에서는 전혀 어울리는 고사는 아니라고 생각했다.\n그 외에도 이런 사례가 많아서 책의 좋은 내용과 별개로 책에 대한 평가를 할 때 '절하' 되는 근거가 될 것 같다.",
    "reviews": [],
    "syllabus": [],
    "link": "https://jojoldu.tistory.com/826",
    "pubDate": "Tue, 6 May 2025 09:38:32 +0900",
    "creator": "향로 (기억보단 기록을)",
    "categories": [
      "도서",
      "C레벨",
      "리더",
      "리더십",
      "스타트업",
      "트레바리",
      "한비자"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "What’s New in vcpkg (April 2025)",
    "description": "This blog post summarizes changes to the vcpkg package manager as part of the 2025.04.09 registry release, 2025-03-22, 2025-04-01, and 2025-04-07 tool releases, as well as changes to vcpkg documentation throughout April. This release contains bug fixes, a new documentation article on offline usage of vcpkg, and other minor improvements. Arm64 Linux users of vcpkg […]\nThe post What’s New in vcpkg (April 2025) appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/whats-new-in-vcpkg-april-2025/",
    "pubDate": "Fri, 02 May 2025 21:44:09 +0000",
    "creator": "Augustin Popa",
    "categories": [
      "C++",
      "Vcpkg",
      "vcpkg"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "Redis 와 Valkey 무엇을 선택해야 할까?",
    "description": "2024년에 Redis 7.2.4 부터 라이센스 이슈로 Valkey 가 fork 되면서 많은 사람들이 Redis와 Valkey 중에 무엇을 사용해야 하는가? 그럼 어떤 차이가 있는지에 대한 질문이 꽤 많습니다. 그래서 거기에 대한 간단한 의견(답정너) 를 소개하려고 합니다. 일반적으로 클라우드 기반에서 사용하던 분들 특히 AWS의 ElastiCache 를 쓰는 분들은 그냥 Redis 쓰는 것보다 Valkey로 가셔도 전혀 문제가 없습니다.(비용이 더 […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://charsyam.wordpress.com/2025/05/03/redis-%ec%99%80-valkey-%eb%ac%b4%ec%97%87%ec%9d%84-%ec%84%a0%ed%83%9d%ed%95%b4%ec%95%bc-%ed%95%a0%ea%b9%8c/",
    "pubDate": "Sat, 03 May 2025 08:16:52 +0000",
    "creator": "charsyam",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "C++ - Mimalloc:Free List Sharding in Action 을 읽고 정리",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://jacking75.github.io/Cpp_20250430/",
    "pubDate": "Wed, 30 Apr 2025 00:00:00 +0900",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "VS Code C++ Extension 1.25 Release:  Explain C++ symbols using Copilot & Customize recursive include paths",
    "description": "The 1.25 release of the C++ extension in Visual Studio Code introduces a new way to understand your code faster with GitHub Copilot-powered symbol summaries, as well as new customization options for recursive #include path processing. With these enhancements, you gain AI-powered insights into unfamiliar or undocumented code and can optimize IntelliSense performance based on […]\nThe post VS Code C++ Extension 1.25 Release:  Explain C++ symbols using Copilot & Customize recursive include paths appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/vs-code-c-extension-1-25-release-explain-c-symbols-using-copilot-customize-recursive-include-paths/",
    "pubDate": "Wed, 30 Apr 2025 23:31:17 +0000",
    "creator": "Alexandra Kemper, Sinem Akinci",
    "categories": [
      "C++",
      "Copilot",
      "performance",
      "Visual Studio Code"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "파운데이션 모델이란?",
    "description": "파운데이션 모델은 방대한 양의 일반 데이터로 학습된 강력한 인공 지능(AI)의 유형으로, 광범위한 작업을 처리할 수 있습니다. OpenAI의 GPT(Generative Pre-trained Transformer) 시리즈나 Google의 BERT (Bidirectional Encoder Representations from Transformers)와 같은 파운데이션 모델은 인터넷의 다양한 소스에서 일반적인 언어 패턴과 지식을 수집하도록 설계되었습니다. 그런 다음 이러한 모델을 소규모의 작업별 데이터 세트에 맞게 파인튜닝하여 텍스트 분류, 요약, 번역, 질문 […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://ppss.kr/archives/269222",
    "pubDate": "Wed, 30 Apr 2025 03:32:08 +0000",
    "creator": "박명근",
    "categories": [
      "IT",
      "개발"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "Suno v4.5 주요 업데이트 소개, 프로급 음악 제작이 더 쉬워졌다!",
    "description": "음악 창작의 새 역사를 쓰는 Suno v4.5가 드디어 공개됐어요! 더 풍부한 장르, 감성적인 보컬, 복잡한 사운드까지... 여러분의 음악적 상상력이 현실이 되는 마법 같은 경험을 함께 해볼까요?\n\n\n \n여러분, 혹시 머릿속에서 맴도는 멜로디가 있으신가요? 어떤 특별한 순간에 떠오르는 그 음악, 그냥 흘려보내기 아쉽지 않으셨어요? 저도 그랬어요. 음악을 전공하지 않았지만 항상 제 감정을 표현할 수 있는 노래를 만들고 싶었거든요.\n솔직히 말해서, 음악 제작은 전문가들의 영역이라고만 생각했어요. 작곡, 편곡, 믹싱... 이런 단어들만 들어도 진입장벽이 느껴지잖아요. 그런데 Suno의 새로운 v4.5 모델을 경험하고 나서 제 생각이 완전히 바뀌었어요. 진짜로요!  \n \nSuno v4.5, 무엇이 달라졌을까? ✨\nSuno v4.5는 이전 버전에서 한 단계 더 진화했어요. 제가 직접 사용해본 결과, 몇 가지 놀라운 변화를 발견했답니다.\n확장된 장르와 장르 믹스업  \n장르 옵션이 크게 확장되었고, v4.5는 이전보다 장르를 더 정확하게 따라갑니다. 예전에는 'EDM'이라고 하면 뭔가 비슷비슷한 느낌이었는데, 이제는 확실히 다양한 EDM 하위 장르의 특징을 잘 살려주더라고요.\n제가 한번 \"펑크 록\"과 \"재즈 하우스\"를 입력했는데, 와... 진짜 그 장르의 특성이 잘 살아있었어요! 심지어 \"그레고리안 성가\"까지 도전해봤는데, 마치 중세 수도원에 있는 것 같은 경험이었죠.\n더 신기한 건 장르 조합도 훨씬 잘 작동한다는 거예요. 미드웨스트 이모와 네오소울을 섞거나 EDM과 포크를 조합하면 더 일관되고 창의적인 음악이 만들어집니다. 전에는 뭔가 어색했던 결합들이 이제는 마치 원래부터 존재했던 장르처럼 자연스럽게 들려요.\nStart with Rap , transition to R&B Vocals   for the hook, then switch the beat to a Stereo Bounce and finally into a Soul Sample\n랩으로 시작하여 후크를 위해 R&B 보컬로 전환한 다음 비트를 스테레오 바운스로 전환하고 마지막으로 소울 샘플로 전환합니다.\n \n향상된 보컬 퀄리티  \n보컬은 이제 더 넓은 음역대와 감정적 깊이를 갖추게 되었습니다. 섬세하고 친밀한 퍼포먼스부터 비브라토가 있는 강력한 전달력까지 모든 것을 만들 수 있습니다.\n \n실제로 감정을 담은 가사를 작성하고 그에 맞는 보컬 스타일을 지정하니, 마치 진짜 가수가 부른 것처럼 느껴졌어요. 예전에는 뭔가 기계적인 느낌이 살짝 있었는데, 이제는 진짜 사람이 감정을 담아 부르는 것 같아요. 저는 개인적으로 이 부분이 가장 마음에 들었답니다!\n \n더 복잡한 사운드 구현  \nv4.5는 자연스러운 톤 변화부터 악기 레이어링, 섬세한 사운드 디테일까지 깊이를 더하는 미묘한 음악적 요소를 포착합니다. 예전에는 기본적인 느낌만 전달됐다면, 이제는 섬세한 뉘앙스까지 표현돼요.\n \n\"기분 좋은 노스텔직한 톤\", \"나뭇잎 질감\", \"멜로딕한 휘파람\" 같은 설명이 이제 직접 음악에 반영될 수 있습니다. 제가 \"숲속에서 들리는 새소리와 함께 잔잔한 피아노 멜로디\"라고 입력했더니, 정말 그 분위기가 생생하게 담긴 음악이 만들어졌어요. 마치 제 상상력이 그대로 음악이 된 느낌이었달까요?\n\n\n \n더 똑똑해진 Suno, 더 직관적인 경험  \n더 스마트한 프롬프트 해석 능력\nv4.5는 여러분의 설명을 더 잘 이해하고 번역합니다. 여러분이 지정한 세부 사항, 분위기, 악기를 더 잘 포착합니다. 이제 감정적 뉘앙스와 기술적 음악 요소 모두 노래에 더 잘 반영됩니다.\n \n전에는 \"슬프면서도 희망적인 느낌\"이라고 하면 뭔가 어중간한 결과물이 나왔는데, 이제는 진짜 슬픔에서 시작해 점점 희망적인 분위기로 변해가는 섬세한 감정 전환까지 표현해내요. 진짜 사람이 작곡한 것 같은 느낌이랄까요?\n프롬프트 향상 도우미\nv4.5의 새로운 복잡성을 최대한 활용하기 위해 프롬프트 향상 도우미를 활용해보세요. 여러분의 장르 아이디어가 그대로 사용하거나 원하는 대로 수정할 수 있는 풍부하고 상세한 스타일 설명으로 발전하는 것을 볼 수 있습니다.\n이건 정말 유용한 기능이에요! 제가 \"힙합\"이라고만 입력했을 때, 프롬프트 향상 도우미는 \"90년대 붐뱁 비트와 재즈 샘플이 결합된 올드스쿨 힙합, 유려한 래핑과 소울풀한 후렴구\" 같은 상세한 설명으로 확장해주더라고요. 덕분에 더 정확한 음악을 만들 수 있었답니다.\n \n더 다양한 창작 기능들, 한계는 없다!  \n업그레이드된 커버와 페르소나\n커버와 페르소나가 큰 향상을 받았습니다. 커버곡을 만들면 더 많은 멜로디 디테일을 유지해야 합니다. 장르 전환도 개선되었습니다—좋아하는 록 음악을 하우스 리믹스로 바꾸어 변화를 들어보세요.\n제가 좋아하는 팝송을 재즈 버전으로 커버해봤는데, 원곡의 멜로디는 그대로 유지하면서도 완전히 다른 분위기로 재탄생했어요. 이전에는 원곡의 느낌이 많이 사라졌었는데, 이제는 \"아, 이 노래구나!\" 하고 바로 알아차릴 수 있더라고요.\n커버와 페르소나의 결합\n커버와 페르소나를 함께 사용하여 목소리, 스타일, 구조를 한 번에 리믹스하세요. 함께 사용하면 무한한 창의적 가능성을 열어줍니다.\n이건 정말 혁명적인 기능이에요! 제 취향의 아티스트 목소리로 좋아하는 노래를 부르게 하고, 동시에 장르까지 바꿀 수 있다니... 상상만 해도 설레지 않나요? 저는 팝송을 메탈 버전으로 바꾸고 완전 다른 보컬로 커버해봤는데, 그 결과물이 너무 신선했어요!\n더 빠른 생성 속도와 긴 곡 길이\n생성 속도가 크게 향상되어 실험하고 개선할 시간이 더 많아졌습니다. 이제 기다리는 시간이 훨씬 줄어들어서 창작 과정이 중단되지 않고 아이디어가 떠오르는 대로 바로바로 시도해볼 수 있어요.\n \n그리고 이제 최대 8분 길이의 노래를 만들 수 있으며, 긴 구성에서도 처음부터 끝까지 품질과 일관성을 유지할 수 있습니다. 전에는 긴 곡을 만들면 후반부로 갈수록 퀄리티가 떨어지는 경우가 있었는데, 이제는 8분짜리 대곡도 처음부터 끝까지 완성도 있게 만들 수 있어요!\n개선된 오디오 품질\nv4.5는 더 균형 잡히고 풍부한 믹스를 제공하며, 오디오 열화와 시머 효과를 모두 감소시킵니다. 더 긴 구성에서도 처음부터 끝까지 일관된 사운드 품질을 유지합니다.\n이전 버전에서는 가끔 사운드가 울리거나 지직거리는 현상이 있었는데, v4.5에서는 이런 문제가 확실히 개선되었어요. 마치 프로 스튜디오에서 녹음한 것처럼 깔끔한 사운드를 경험할 수 있었답니다.\n \n\n\n나만의 음악 세계를 열어보세요  \n음악 창작은 더 이상 전문가들만의 영역이 아니에요. Suno v4.5와 함께라면 누구나 자신만의 음악적 상상력을 현실로 만들 수 있어요. 복잡한 장비나 전문 지식 없이도, 그저 여러분의 아이디어를 글로 표현하는 것만으로 멋진 음악이 탄생합니다.\n저는 Suno v4.5를 써보고 정말 놀랐어요. 제 머릿속에서만 울리던 그 멜로디, 제가 느끼던 그 감정들이 실제 음악으로 표현된다는 게 얼마나 신기한지 몰라요. 지금 당장 여러분도 Suno에서 v4.5 노래를 만들어보세요. 더 많은 기능들이 곧 출시될 예정이니 귀 기울여 주세요!\nFAQ\nQ: Suno v4.5는 무료인가요?\nA: 기본 기능은 무료로 사용 가능하지만, 프리미엄 기능을 위한 Pro & Premier 구독 옵션이 있습니다.\nQ: 음악 전문가가 아니어도 사용할 수 있나요?\nA: 네! 음악적 배경 없이도 직관적으로 사용 가능합니다. 원하는 분위기나 장르를 설명하기만 하면 됩니다.\nQ: 만든 음악의 저작권은 누구에게 있나요?\nA: Suno로 만든 음악은 비상업적 용도로 자유롭게 사용 가능합니다. 상업적 이용에 관해서는 Suno의 라이선스 정책을 확인하세요.\nQ: 몇 분 길이의 음악까지 만들 수 있나요?\nA: v4.5에서는 최대 8분 길이의 곡을 만들 수 있습니다.\nQ: 외국어 노래도 만들 수 있나요?\nA: 네, 다양한 언어로 가사를 입력하면 해당 언어로 노래를 만들 수 있습니다.\n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [{\n    \"@type\": \"Question\",\n    \"name\": \"Suno v4.5는 무료인가요?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"기본 기능은 무료로 사용 가능하지만, 프리미엄 기능을 위한 Pro & Premier 구독 옵션이 있습니다.\"\n    }\n  }, {\n    \"@type\": \"Question\",\n    \"name\": \"음악 전문가가 아니어도 사용할 수 있나요?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"네! 음악적 배경 없이도 직관적으로 사용 가능합니다. 원하는 분위기나 장르를 설명하기만 하면 됩니다.\"\n    }\n  }, {\n    \"@type\": \"Question\",\n    \"name\": \"만든 음악의 저작권은 누구에게 있나요?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Suno로 만든 음악은 비상업적 용도로 자유롭게 사용 가능합니다. 상업적 이용에 관해서는 Suno의 라이선스 정책을 확인하세요.\"\n    }\n  }, {\n    \"@type\": \"Question\",\n    \"name\": \"몇 분 길이의 음악까지 만들 수 있나요?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"v4.5에서는 최대 8분 길이의 곡을 만들 수 있습니다.\"\n    }\n  }, {\n    \"@type\": \"Question\",\n    \"name\": \"외국어 노래도 만들 수 있나요?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"네, 다양한 언어로 가사를 입력하면 해당 언어로 노래를 만들 수 있습니다.\"\n    }\n  }]\n}",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483577",
    "pubDate": "Fri, 2 May 2025 09:43:15 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 비디오 및 멀티미디어",
      "ai 음악 생성",
      "suno v4.5",
      "보컬 향상",
      "음악 창작 도구",
      "음악 커버",
      "음악 테크놀로지",
      "음악 페르소나",
      "음악 프롬프트",
      "인공지능 작곡",
      "장르 믹스업"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "토스페이 혜택, 사용법 총정리 2025년 5월",
    "description": "컬리, 신세계면세점, 11번가, 컴퓨존, 아디다스 등 할인·적립 쿠폰 확인하기",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.toss.im/article/tosspay-2025-02",
    "pubDate": "Wed, 30 Apr 2025 15:05:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "The First Set of Bug Fixes for ReSharper and Rider 2025.1 Is Here!",
    "description": "Hello everyone, The ReSharper and Rider 2025.1.1 bug-fix updates have just been released! If you haven’t upgraded to the 2025.1 versions of our products, we highly recommend that you check out these two blog posts: And now, let’s go over the most important fixes in 2025.1.1. ReSharper 2025.1.1  The first bug-fix update fixes the issue […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/dotnet/2025/04/29/2025-1-1-hot-fix/",
    "pubDate": "Tue, 29 Apr 2025 06:53:33 +0000",
    "creator": "Sasha Ivanova",
    "categories": [
      "net-tools",
      "bugfix",
      "news",
      "releases",
      "resharper",
      "rider"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "블록 분해 게임 - 아이디어",
    "description": "블록 분해 게임\n영상: https://youtu.be/_EVuM-JzcMw\n\n\n\n \n상자대신 물고기\n영상: https://youtu.be/dPZPeKa-1ws\n\n\n\n한칸애 물고기 하나를 너으면 찌그러트려야하고\n3칸짜리 상자를 상어 한마리에 대입하는건 왜곡이 덜하겠군요",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1297",
    "pubDate": "Wed, 30 Apr 2025 13:24:43 +0900",
    "creator": "SIDNFT",
    "categories": [
      "프로그래밍/개발메모",
      "게임",
      "아이디어"
    ]
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "Pure Virtual C++ 2025 is Tomorrow",
    "description": "Pure Virtual C++ is our free, one-day, virtual conference for the whole C++ community. It’s running live tomorrow, 30th April, from 14:00 to 16:30 UTC. The talks are: 14:00 UTC: Welcome to v1.0 of the meta::[[verse]]! with Inbal Levi 14:30 UTC: Proxy: Next Generation Polymorphism with Mingxin Wang 15:00 UTC: Making unfamiliar C++ code familiar with […]\nThe post Pure Virtual C++ 2025 is Tomorrow appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/pure-virtual-cpp-2025-is-tomorrow/",
    "pubDate": "Tue, 29 Apr 2025 09:07:40 +0000",
    "creator": "Sy Brand",
    "categories": [
      "Announcement",
      "C++",
      "Pure Virtual C++"
    ]
  }
]