[
  {
    "id": 1,
    "imageUrl": "",
    "title": "Fixing Overload Resolution For Parameter Arrays in C++/CLI",
    "description": "Fix a problem in C++/CLI parameter array overload resolution which affects newer .NET versions.\nThe post Fixing Overload Resolution For Parameter Arrays in C++/CLI appeared first on C++ Team Blog.",
    "reviews": [],
    "syllabus": [],
    "link": "https://devblogs.microsoft.com/cppblog/fixing-overload-resolution-for-parameter-arrays-in-c-cli/",
    "pubDate": "Mon, 29 Sep 2025 14:00:08 +0000",
    "creator": "Tanveer Gani",
    "categories": [
      "C++",
      "C++/CLI"
    ]
  },
  {
    "id": 2,
    "imageUrl": "",
    "title": "개발 시간 반으로 줄이는 UI 컴포넌트 전략: '이거 뭔지' 모르는 답답함 해소",
    "description": "개발 과정에서 ‘이 버튼은 어떻게 만들지?’ ‘이 상황엔 어떤 요소를 써야 할까?’ 같은 UI 컴포넌트 고민, 다들 한 번쯤 해보셨죠? 이 글은 초보 개발자도 헤매지 않고 핵심 UI 컴포넌트들을 정확히 이해하고 활용해서 개발 시간을 절반으로 줄일 수 있는 실질적인 전략을 제시합니다. 막막했던 UI 개발에 자신감을 불어넣어 드릴 거예요.\n  UI 컴포넌트, 대체 뭘까요? 왜 이렇게 중요할까요?\n\n\n\n처음 코딩을 시작했을 때, 기능 구현은 어떻게든 되겠는데 화면에 보이는 요소들, 예를 들어 체크박스나 드롭다운 같은 것들이 너무 헷갈렸던 기억이 나요. 이름조차 생소해서 이걸 어떻게 불러야 할지, 언제 써야 할지 막막했던 적, 저만 그런 건 아니겠죠?\nUI 컴포넌트란 쉽게 말해 웹이나 모바일 앱 같은 사용자 인터페이스(UI)를 구성하는 데 쓰이는 재사용 가능한 최소 단위를 말합니다. 마치 레고 블록처럼 버튼, 입력 필드, 체크박스, 카드 등 다양한 디자인과 기능을 가진 부품들이 모여서 하나의 페이지를 이루고, 이를 통해 사용자는 시스템과 상호작용하며 필요한 정보를 얻게 되는 거죠. 하나하나 직접 조립하는 게 아니라 만들어진 블록을 가져다 쓰는 개념이에요.\n그럼 왜 이 UI 컴포넌트들이 그렇게 중요할까요? 제 생각엔 크게 두 가지 이유가 있어요. 첫째, 재사용성이 뛰어나다는 점이에요. 한 번 제대로 만들어둔 버튼은 웹사이트의 어느 페이지에서든, 아니면 다른 프로젝트에서조차 똑같이 가져다 쓸 수 있죠. 개발 시간을 확 줄여주는 마법 같은 일이 벌어집니다.\n둘째는 일관성을 유지하기 쉽다는 것이에요. 모든 페이지의 버튼이 같은 모양, 같은 색, 같은 동작을 한다고 상상해보세요. 사용자는 훨씬 더 직관적으로 앱을 이해하고 편안하게 사용할 수 있게 됩니다. 우리가 2025년에 흔히 쓰는 잘 만든 앱들을 보면, 이런 일관성이 정말 중요한 역할을 하고 있잖아요? 예를 들어, 다음 글에서 함께 만들 할 일 관리 앱에서도 '할 일 추가 버튼', '완료 체크박스', '삭제 버튼' 등이 모두 통일된 스타일을 가져야 사용하기 편할 거예요.\n\n\n  핵심 UI 컴포넌트, 헷갈리지 말고 제대로 알아봅시다!\n이제 가장 많이 쓰이고, 또 가장 헷갈리기 쉬운 핵심 UI 컴포넌트들을 하나씩 살펴보면서 정확한 이름과 용도를 익혀볼 거예요. 더 이상 '저기 있는 그거!'라고 하지 말고, 정확한 명칭으로 소통하면서 개발 효율을 높여봐요.\n \nUI 컴포넌트를 미리 체험할 수 있는 'UI 컴포넌트 쇼케이스'를 활용하시면 \n컴포넌트 이해에 도움이 될 거예요. \n아래 링크를 참고하세요.\n\n \n로그인 - Google 계정\n이메일 또는 휴대전화\naccounts.google.com\n\n\n \n1. 사용자 행동 유도: 버튼과 입력 필드\n사용자의 액션을 유도하거나 정보를 받는 가장 기본적인 요소들이죠.\n버튼 (Button): 사용자가 클릭해서 특정 행동을 취할 때 사용하는 가장 기본적인 컴포넌트예요. 기본(파란색 계열), 보조(회색 계열), 외곽선, 그리고 위험(빨간색 계열) 등 다양한 스타일이 있고, 상황에 따라 비활성화(disabled)할 수도 있습니다. 클릭할 때마다 버튼에 할당된 명령을 수행하는, 정말 없어서는 안 될 핵심 요소라고 할 수 있어요.\n입력 필드 (Input Field): 사용자로부터 정보를 입력받을 때 사용하는 컴포넌트예요. 일반 상태, 정보를 입력할 수 없는 비활성화 상태, 그리고 잘못된 정보가 입력되었을 때 나타나는 오류 상태가 있습니다. 예를 들어, 구독 양식에서 이메일 주소를 입력할 때 유효성 검사를 통해 \"이메일은 필수 항목입니다\" 또는 \"유효한 이메일 주소를 입력해주세요\" 같은 오류 메시지를 띄워 사용자에게 올바른 정보 입력을 유도하는 경우가 많죠. 올바르게 입력되면 \"구독해주셔서 감사합니다!\" 같은 성공 메시지가 나타나기도 하고요.\n2. 정보 탐색과 분류: 탭과 선택 컴포넌트\n많은 정보를 효율적으로 보여주고, 사용자가 원하는 것을 선택하게 돕는 중요한 컴포넌트들이에요.\n탭 (Tab): 관련된 정보를 여러 섹션으로 나누어 사용자가 원하는 내용만 골라볼 수 있게 해주는 컴포넌트예요. 제품 상세 페이지에서 '설명', '사양', '리뷰' 탭을 클릭할 때마다 해당 내용만 깔끔하게 정리되어 나타나는 것을 떠올려보세요. 복잡한 정보를 효과적으로 보여주는 데 정말 유용하죠.\n사용자 선택을 받아내는 네 가지 핵심 컴포넌트\n이제 사용자에게 옵션을 제시하고 선택을 받는 네 가지 중요한 컴포넌트를 알아볼게요. 각각의 용도가 명확해서 정확히 이해하고 사용하는 게 중요해요.\n드롭다운 (Dropdown): 선택지가 많을 때 화면을 깔끔하게 유지하면서도 많은 옵션을 제공할 수 있는 컴포넌트예요. 클릭하면 옵션 목록이 펼쳐지고, 그중 하나를 선택할 수 있습니다. 국가 선택이나 연도 선택처럼 수십 개의 옵션이 있을 때 정말 유용하죠.\n라디오 버튼 (Radio Button): 여러 옵션 중 반드시 단 하나만 선택해야 할 때 사용해요. 모든 옵션이 화면에 명확히 보이며, 하나를 선택하면 이전에 선택했던 것은 자동으로 해제됩니다. 성별 선택이나 결제 방법 선택 같은 상황에 딱 맞습니다.\n체크박스 (Checkbox): 여러 항목을 동시에 선택하거나, 어떤 항목에 대한 동의 여부를 표시할 때 사용합니다. 각각의 체크박스는 독립적으로 체크하거나 해제할 수 있어요. 약관 동의나 관심사 선택처럼 복수 선택이 필요한 경우에 주로 쓰입니다.\n토글 (Toggle): 켜짐/꺼짐 두 가지 상태를 직관적으로 표시하는 컴포넌트예요. 스위치를 좌우로 움직이는 애니메이션 덕분에 상태 변화가 명확하죠. 알림 설정이나 다크 모드 전환 같은 기능에 많이 사용됩니다.\n사용자 설정 페이지를 예로 들면, 언어는 드롭다운으로 여러 언어 중 선택하고, 테마는 라디오 버튼으로 라이트/다크 모드 중 하나만 선택하며, 알림은 토글 스위치로 켜고 끄고, 마케팅 동의는 체크박스로 체크하는 식으로 각각의 컴포넌트가 용도에 맞게 명확하게 구분되어 사용되는 걸 볼 수 있어요. 이렇게 각 컴포넌트의 특성을 이해하면 적재적소에 배치해서 사용자 경험을 크게 향상시킬 수 있습니다.\n\n\n3. 값 조절과 피드백: 슬라이더와 알림\n사용자가 값을 부드럽게 조절하거나, 시스템의 상태를 인지하게 하는 중요한 컴포넌트들이에요.\n슬라이더 (Slider): 정해진 범위 안에서 값을 부드럽게 조절할 때 사용해요. 볼륨 조절, 밝기 조절, 가격 범위 설정 같은 곳에서 많이 쓰이죠. 미디어 플레이어에서 재생 진행률을 조절하는 슬라이더를 보면, 드래그하면서 실시간으로 재생 시간이 바뀌는 걸 볼 수 있습니다. 숫자로 직접 입력하는 것보다 훨씬 직관적이고 편리해요.\n알림 (Notification): 사용자에게 현재 상황이나 피드백을 전달할 때 사용해요. 정보 알림은 파란색, 성공 알림은 초록색, 경고 알림은 노란색, 오류 알림은 빨간색으로 표시해서 색상만으로도 상황을 직감할 수 있게 하는 경우가 많습니다. 파일 업로드 시뮬레이터를 생각해보면, 성공 시 초록색 \"성공적으로 업로드되었습니다!\", 경고 시 노란색 \"파일 크기가 초과합니다\", 실패 시 빨간색 \"지원하지 않는 파일 형식입니다\"와 같은 메시지가 잠시 후 사라지는 식으로 나타나죠. 정말 편리하고 사용자 친화적인 요소입니다.\n4. 진행 상황과 보조 정보: 로더와 툴팁\n사용자가 기다려야 할 때 지루함을 덜어주고, 필요한 정보를 숨김없이 제공하는 컴포넌트들이에요.\n로더 (Loader): 사용자를 기다리게 할 때, '지금 뭔가 작업 중'이라는 것을 시각적으로 보여줘서 답답함을 줄여주는 컴포넌트예요. 빙글빙글 도는 아이콘인 스피너 (Spinner)와 진행률을 막대로 보여주는 프로그레스 바 (ProgressBar)가 대표적이죠. 데이터 로딩 시뮬레이터에서 '데이터 가져오기' 버튼을 누르면 스피너와 함께 \"서버에서 데이터를 가져오는 중\" 메시지가 뜨고, 진행률 바가 서서히 채워지다가 완료되면 프로필 카드가 나타나는 흐름을 떠올려보세요. 사용자에게 신뢰를 주는 아주 중요한 요소입니다.\n툴팁 (Tooltip): 마우스를 올렸을 때 추가 정보를 보여주는 작은 말풍선이에요. 화면을 복잡하게 만들지 않으면서도 필요한 정보를 즉각적으로 제공할 수 있다는 장점이 있습니다. 에디터 툴바의 저장 아이콘에 마우스를 올리면 \"문서 저장\" 툴팁이 나타나는 것처럼 말이죠. 아이콘만으로는 기능을 알기 어려울 때 정말 유용하며, 보통 간결하게 한 줄로 작성하는 것이 좋습니다.\n5. 집중과 확장: 모달, 팝업, 팝오버\n사용자의 주의를 집중시키거나, 특정 요소에 대한 상세 정보를 제공할 때 쓰는 컴포넌트들이에요.\n모달 (Modal): 현재 페이지 위에 레이어처럼 떠오르는 창이에요. 주로 중요한 확인이나 정보 입력 등 사용자의 즉각적인 반응을 필요로 할 때 사용합니다. 계정 삭제 버튼을 클릭했을 때 화면 중앙에 모달 창이 뜨고 배경이 어두워지면서, 모달이 닫히기 전까지는 뒤 배경과 상호작용할 수 없게 되는 경우가 대표적이죠.\n팝업 (Popup): 모달과 달리 완전히 새로운 브라우저 창으로 열리는 방식이에요. 하지만 요즘은 대부분의 브라우저에서 팝업을 차단하기 때문에 잘 사용되지 않습니다. 중요한 확인이 필요할 때는 모달을 쓰는 것이 일반적이에요.\n팝오버 (Popover): 특정 요소를 클릭했을 때 그 근처에 나타나는 작은 정보창이에요. 모달보다는 가볍고, 툴팁보다는 많은 내용을 담을 수 있습니다. 사용자 아바타를 클릭하면 바로 아래에 프로필 미리보기 팝오버가 나타나고, 팝오버 바깥을 클릭하면 자동으로 사라지는 식이죠. 전체 화면을 가리지 않으면서 필요한 정보를 바로 볼 수 있어서 간단한 메뉴나 정보 표시에 아주 유용해요.\n6. 시각적 소통: 아이콘\n텍스트 없이도 의미를 전달하는 강력한 시각적 요소입니다.\n아이콘 (Icon): 텍스트 없이도 의미를 전달하는 시각적 요소로, 일관된 스타일로 사용하는 것이 정말 중요해요. 예를 들어, 정보 아이콘은 파란색 동그라미에 'i'자, 성공 아이콘은 초록색 체크 마크, 경고 아이콘은 노란색 삼각형에 느낌표, 오류 아이콘은 빨간색 엑스표 등 색상과 모양만으로도 의미를 즉시 파악할 수 있도록 디자인됩니다. 버튼 안에 아이콘을 넣을 때는 텍스트와의 간격을 잘 맞추면 훨씬 보기 좋아요.\n✨ 실전 활용: UI 컴포넌트로 나만의 계산기 앱 만들기\n이제 이론적으로 배운 컴포넌트들을 실제로 어떻게 활용하는지, 간단한 계산기 앱을 만들면서 보여드릴게요. 요즘 핫한 노코드/로우코드 앱 빌더를 활용하면, 채팅창에 원하는 컴포넌트 목록과 기능을 설명하는 것만으로도 앱이 뚝딱 만들어진답니다.\n다양한 컴포넌트를 활용하여 만든 다기능 계산기는 아래 링크를 참고하세요.\n\n \n로그인 - Google 계정\n이메일 또는 휴대전화\naccounts.google.com\n\n\n \n \n예를 들어, 채팅창에 '일반/공학/단위변환 기능이 포함된 계산기를 만들어 줘. 다음 컴포넌트들을 모두 사용해'라고 입력하고, 앞서 설명한 버튼, 탭, 토글, 체크박스, 슬라이더, 라디오 버튼, 드롭다운, 로더, 팝오버 등의 목록을 제공하는 거죠. 그러면 AI가 이 모든 요구사항을 반영해서 멋진 계산기 앱을 만들어줍니다.\n메인 화면: 버튼과 탭이 기본으로 구성됩니다. 설정 아이콘을 클릭하면 모달 창이 뜨는데, 여기에는 토글 스위치, 체크박스, 슬라이더 등 다양한 컴포넌트가 보이죠.\n공학용 탭: 각도 단위 선택을 위한 라디오 버튼, 계산 과정 보기를 위한 로더(AI가 결과 출력 전까지) 등이 배치됩니다.\n단위 변환 탭: 변환 종류 및 from/to 단위를 선택할 때 드롭다운이 사용되고, 변환할 값은 입력창을 통해 받게 되어 있어요.\n이처럼 앱 빌더를 활용하면 우리가 배운 대부분의 컴포넌트를 사용한 앱을 순식간에 완성할 수 있습니다. 놀랍지 않나요? 솔직히 전 처음 보고 좀 놀랐어요.\n\n\n  문제 해결도 컴포넌트 이름을 정확히 알면 훨씬 쉬워져요!\n가령, 계산기록 팝오버 창이 잘리는 문제를 발견했을 때, 채팅창에 '계산기록 팝오버 창이 잘리는 문제를 해결해'라고 요청하면 바로 수정됩니다. 또, 라이트 모드에서 단위 변환 탭의 드롭다운 목록 글자색이 배경과 비슷해서 잘 안 보인다면, '라이트 모드에서 단위 변환 탭의 드롭다운 목록 글자색을 흰색으로 변경해'라고 정확히 요청할 수 있죠. 컴포넌트 이름을 모른다면 '저기, 그거 검은색으로 바꿔줘'라고 말하며 답답해했을 거예요. 명칭을 아는 것이 이렇게 중요합니다.\n  핵심 요약\n✅ UI 컴포넌트는 재사용성과 일관성을 통해 개발 효율을 극대화합니다.\n✅ 버튼, 입력 필드, 탭, 드롭다운, 라디오 버튼, 체크박스, 토글은 사용자 상호작용의 기본입니다.\n✅ 슬라이더, 알림, 로더, 툴팁, 모달, 팝오버, 아이콘은 사용자 경험을 풍부하게 만드는 핵심 요소입니다.\n✅ 컴포넌트의 정확한 명칭과 용도 이해는 문제 해결 능력을 높이고 개발 속도를 가속화합니다.\n이 핵심들을 기억하면 UI 개발이 더 이상 어렵지 않을 거예요!\n❓ 자주 묻는 질문 (FAQ)\nQ1: UI 컴포넌트의 명칭을 정확히 아는 것이 왜 그렇게 중요한가요?\nA1: 컴포넌트의 정확한 명칭을 알면 개발자 간의 소통이 원활해지고, 필요한 기능을 검색하거나 문제 해결을 위해 AI 도구에 요청할 때 더욱 정확하고 빠르게 해결할 수 있습니다. 마치 공구 이름을 모르면 집을 짓기 어려운 것과 같아요.\nQ2: 드롭다운, 라디오 버튼, 체크박스, 토글은 어떤 기준으로 구분해서 사용해야 하나요?\nA2: 드롭다운은 선택지가 많을 때 화면 공간을 효율적으로 사용하고, 라디오 버튼은 여러 옵션 중 단 하나만 선택할 때, 체크박스는 여러 개를 동시에 선택하거나 동의 여부를 표시할 때 사용합니다. 토글은 켜짐/꺼짐처럼 두 가지 상태를 직관적으로 전환할 때 적합합니다. 각 컴포넌트의 특성을 이해하고 사용자 경험에 맞춰 선택하는 것이 중요해요.\nQ3: 모달과 팝오버는 어떻게 다른가요?\nA3: 모달은 현재 페이지 위에 레이어처럼 떠서 사용자의 주의를 집중시키고, 모달이 닫히기 전까지는 뒤 배경과 상호작용할 수 없습니다. 중요한 확인이나 정보 입력에 주로 사용하죠. 반면 팝오버는 특정 요소를 클릭했을 때 그 근처에 나타나는 작은 정보창으로, 모달보다 가볍고, 팝오버 바깥을 클릭하면 자동으로 사라지는 등 비교적 가벼운 정보 표시에 사용됩니다.\n  마무리하며: UI 컴포넌트, 개발 속도를 결정하는 핵심!\n오늘 우리는 버튼부터 아이콘까지 15가지 핵심 UI 컴포넌트들의 정확한 이름과 용도를 배워봤어요. 이제 더 이상 '저기 있는 그거!'가 아니라, '드롭다운 컴포넌트'라고 정확히 말할 수 있게 된 거죠. 이런 작은 변화가 실제 개발 환경에서는 엄청난 효율 차이를 만듭니다. UI 컴포넌트에 대한 깊은 이해는 선택이 아니라 개발자의 필수 역량이라고 감히 말씀드리고 싶어요.\n  직접 경험해보세요!\n이 글에서 설명한 'UI 컴포넌트 쇼케이스'와 '계산기 앱'은 글 설명란 링크에서 직접 체험해보실 수 있도록 준비해둘게요. 눈으로 보는 것과 직접 만져보는 것은 정말 다르답니다. 복습하시면서 각 컴포넌트의 동작 방식과 용도를 몸으로 익히시면, 훨씬 더 확실하게 개념을 잡으실 수 있을 거예요.",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483661",
    "pubDate": "Sun, 28 Sep 2025 00:25:28 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "DALL-E 프롬프트",
      "UI 컴포넌트",
      "UX 디자인",
      "개발 속도",
      "개발 효율",
      "레고 블록 UI",
      "사용자 인터페이스",
      "웹 개발",
      "컴포넌트 라이브러리",
      "프론트엔드"
    ]
  },
  {
    "id": 3,
    "imageUrl": "",
    "title": "때가 된 아이디어",
    "description": "레미제라블과 노트르담의 곱추의 저자 빅토르 위고의 명언 중 “군대는 막을 수 있어도, 때가 된 아이디어는 막을 수 없다.(An invasion of armies can be resisted but not an idea whose time has come)”라는 말이 있는데 나는 요새 이 말의 중요성과 위력을 자주 느끼고 있다. 아마도 이분이 이 말을 한 배경에는 당시의 격동적인 새로운 시대적 흐름, 혁신,(...)",
    "reviews": [],
    "syllabus": [],
    "link": "https://www.thestartupbible.com/2025/09/an-idea-whose-time-has-come.html",
    "pubDate": "Sun, 28 Sep 2025 21:36:00 +0000",
    "creator": "Kihong Bae",
    "categories": [
      "Uncategorized",
      "korea",
      "regulation",
      "Strong",
      "technology"
    ]
  },
  {
    "id": 4,
    "imageUrl": "",
    "title": "“I tried out JetBrains’ code analysis tool Qodana”",
    "description": "This is the English version of the Japanese article first published by Jan Maki on Qiita. This post was not commissioned by Qodana and was written independently. For more information please reach out to them in the comments or via their link tree. Qodana is JetBrains’ code analysis platform for quality and aspects of code […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/qodana/2025/09/i-tried-out-jetbrains-code-analysis-tool-qodana/",
    "pubDate": "Mon, 29 Sep 2025 12:59:55 +0000",
    "creator": "Kerry Beetge",
    "categories": [
      "ai",
      "use-case",
      "qodana",
      "static-code-analysis"
    ]
  },
  {
    "id": 5,
    "imageUrl": "",
    "title": "Why Is Python So Popular in 2025?",
    "description": "While other programming languages come and go, Python has stood the test of time and firmly established itself as a top choice for developers of all levels, from beginners to seasoned professionals. Whether you’re working on intelligent systems or data-driven workflows, Python has a pivotal role to play in how your software is built, scaled, […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/pycharm/2025/09/why-is-python-so-popular/",
    "pubDate": "Wed, 24 Sep 2025 11:19:08 +0000",
    "creator": "Evgenia Verbina",
    "categories": [
      "data-science",
      "web-development",
      "ai",
      "machine-learning",
      "python",
      "survey"
    ]
  },
  {
    "id": 6,
    "imageUrl": "",
    "title": "스팀 - 멀웨어감염 게임된 2D 플렛포머 게임 삭제",
    "description": "영상: https://youtu.be/oKwBGpMz9hs?t=570\n\n\n\n9분 30초에 짤막하게 나옵니다.\n \n스팀에 올라오는 게임도 안전한건 아닌가 봅니다.\n암호화폐는 이미 도난 당한 후에 삭제 되었다고 합니다.\n \n아마도 멀웨어는 지갑주소를 복붙할때 본인 지갑주소로 슬적 바꿔넣는 기능이 있을것 같습니다.\n스팀도 안전한건 아닌가 봅니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1402",
    "pubDate": "Mon, 29 Sep 2025 15:40:51 +0900",
    "creator": "SIDNFT",
    "categories": [
      "게임",
      "멀웨어",
      "스팀"
    ]
  },
  {
    "id": 7,
    "imageUrl": "",
    "title": "AssetGen: Generating 3D Worlds With AI",
    "description": "Imagine being able to use AI to create 3D virtual worlds using prompts as easily as you can generate images. The intersection of AI and VR was one of the biggest topics at Meta Connect this year. In his keynote, Mark Zuckerberg shared his vision of a future where anyone can create virtual worlds using [...]\nRead More...\nThe post AssetGen: Generating 3D Worlds With AI appeared first on Engineering at Meta.",
    "reviews": [],
    "syllabus": [],
    "link": "https://engineering.fb.com/2025/09/29/virtual-reality/assetgen-generating-3d-worlds-with-ai/",
    "pubDate": "Mon, 29 Sep 2025 14:00:42 +0000",
    "creator": "Unknown",
    "categories": [
      "AI Research",
      "ML Applications",
      "Virtual Reality",
      "Meta Tech Podcast"
    ]
  },
  {
    "id": 8,
    "imageUrl": "",
    "title": "인디게임 - Dicealot / 주사위로 대전하는 게임",
    "description": "영상: https://www.youtube.com/watch?v=oKTJd3humMY\n\n\n\n \n보드게임\n주사위를 굴려 공격하는 간단한 방식의 게임이다.\n심플해서 마음에 든다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1401",
    "pubDate": "Mon, 29 Sep 2025 15:27:48 +0900",
    "creator": "SIDNFT",
    "categories": [
      "게임",
      "인디게임"
    ]
  },
  {
    "id": 9,
    "imageUrl": "",
    "title": "[PS5] 소니 제일검의 찬바라 그 두 번째 막, 고스트 오브 요테이",
    "description": "No description available",
    "reviews": [],
    "syllabus": [],
    "link": "https://bbs.ruliweb.com/news/board/11/read/2366",
    "pubDate": "Thu, 25 Sep 2025 22:00:07 +0900",
    "creator": "(RULIWEB`Д')/",
    "categories": [
      "리뷰"
    ]
  },
  {
    "id": 10,
    "imageUrl": "",
    "title": "Supercharging Unit Test Generation with in-IDE TestSpark",
    "description": "Test generation is an essential yet time-consuming part of quality assurance. Automating test-generation techniques means accelerating the development process and improving the quality of the final software. However, traditional automated techniques, and their respective tools, are not usually user-friendly, having a command-line interface and not being integrated with the IDE. To boost acceleration and quality […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/research/2025/09/testspark-unit-test-generation/",
    "pubDate": "Tue, 23 Sep 2025 11:13:56 +0000",
    "creator": "Katie Fraser",
    "categories": [
      "idea",
      "research",
      "testing",
      "intellij-idea",
      "jetbrains-research",
      "test-generation"
    ]
  },
  {
    "id": 11,
    "imageUrl": "",
    "title": "Introducing Claude Agent in JetBrains IDEs",
    "description": "TL;DR: The new Claude Agent is now seamlessly integrated into JetBrains IDEs via the AI chat and included in the JetBrains AI subscription. No extra plugins, no extra subscriptions – just advanced AI coding assistance built on Anthropic’s Agent SDK, which powers Claude Code, right inside your IDE. The new agent leverages Anthropic models, including […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://blog.jetbrains.com/ai/2025/09/introducing-claude-agent-in-jetbrains-ides/",
    "pubDate": "Mon, 29 Sep 2025 17:04:16 +0000",
    "creator": "Ivan Moiseev",
    "categories": [
      "news",
      "ai-in-ides"
    ]
  },
  {
    "id": 12,
    "imageUrl": "",
    "title": "[책 리뷰] 밑바닥부터 만들면서 배우는 LLM",
    "description": "해당 도서는 길벗 출판사의 리뷰이벤트로 증정받았습니다. OpenAI에서 GPT가 나온이후로, 수 많은 LLM(Large Language Model)이 나오게 되었습니다. llama나 deepseek, qwen과 같은 sLM 까지 포함하면 굉장히 빠르게 발전하고 있는 분야가 이 부분입니다. 현재 AI 프로젝트라고 하면 대부분 이런 LLM이나 sLM을 이용한 결과를 내는 것이 대부분입니다. 그렇다면 모두가 LLM을 정확히 이해해야 하는가라고 물어보면 사실 그런건 아닙니다. 그런데, LLM을 […]",
    "reviews": [],
    "syllabus": [],
    "link": "https://charsyam.wordpress.com/2025/09/29/%ec%b1%85-%eb%a6%ac%eb%b7%b0-%eb%b0%91%eb%b0%94%eb%8b%a5%eb%b6%80%ed%84%b0-%eb%a7%8c%eb%93%a4%eb%a9%b4%ec%84%9c-%eb%b0%b0%ec%9a%b0%eb%8a%94-llm/",
    "pubDate": "Mon, 29 Sep 2025 16:01:11 +0000",
    "creator": "charsyam",
    "categories": [
      "Uncategorized"
    ]
  },
  {
    "id": 13,
    "imageUrl": "",
    "title": "인디게임 - CLOVER PIT / 슬롯머신 게임",
    "description": "트레일러: https://www.youtube.com/watch?v=CtX2WIBqsds\n\n\n\n \n \n영상: https://www.youtube.com/watch?v=RKmRfxyZhcY\n\n\n\n14분20초에 콤보가 연속으로 터지는 장면이 있군요\n \n멋진 비주얼입니다.",
    "reviews": [],
    "syllabus": [],
    "link": "http://serverdown.tistory.com/1403",
    "pubDate": "Mon, 29 Sep 2025 16:05:26 +0900",
    "creator": "SIDNFT",
    "categories": [
      "게임",
      "인도게임"
    ]
  },
  {
    "id": 14,
    "imageUrl": "",
    "title": "PD1 AI 해커톤, 그 뜨거웠던 열기 속으로!",
    "description": "최근 LY Corporation뿐 아니라 IT 산업 전반에서 AI 기술을 서비스에 접목하려는 움직임이 활발히 이어지고 있습니다. 메시징과 커뮤니케이션, 콘텐츠, 업무 자동화에 이르...",
    "reviews": [],
    "syllabus": [],
    "link": "https://techblog.lycorp.co.jp/ko/pd1-ai-hackathon-recap",
    "pubDate": "Fri, 26 Sep 2025 02:00:00 GMT",
    "creator": "Unknown",
    "categories": []
  },
  {
    "id": 15,
    "imageUrl": "",
    "title": "챗GPT 품은 카톡 업데이트, 2025년 10월 예정!",
    "description": "드디어 기다리던 소식이 현실이 되었습니다! 한국인의 필수 앱 카카오톡이 2025년 10월, 챗GPT(GPT-5 기반)와 자체 AI '카나나'를 품고 대대적인 변신을 예고했어요. 단순한 메신저를 넘어, AI 비서와 소셜 플랫폼으로 진화하는 카카오톡의 혁신적인 변화와 함께 5천만 사용자의 일상이 어떻게 달라질지, 그리고 프라이버시는 안전하게 지켜질지 자세히 알아볼게요. AI 시대, '카톡해'의 의미가 완전히 새로워질 거예요!\n\n\n 한국인의 삶에 깊숙이 자리 잡은 카카오톡이 오는 2025년 10월, 챗GPT를 품고 대대적인 업데이트를 앞두고 있다는 소식입니다. 저도 이 소식을 듣고 정말 놀라지 않을 수 없었는데요, 단순한 AI 기능 추가를 넘어 카카오톡 15년 역사상 가장 큰 변화가 될 것이라고 하니, 그 내용이 더욱 궁금해집니다. 그럼 지금부터 이 혁신적인 업데이트가 우리의 일상을 어떻게 바꿀지, 그리고 주요 내용은 무엇인지 자세히 살펴보겠습니다.\n✨ 국내 최초 OpenAI 전략적 제휴의 빛나는 결실\n이번 카카오톡 업데이트는 단순한 기능 추가를 넘어, 카카오와 OpenAI가 8개월간 공들여 진행한 공동 개발 프로젝트의 최종 결과물이라고 해요. 특히 정신아 카카오 대표가 2025년 9월 23일 경기도 용인 카카오 AI 캠퍼스에서 열린 '이프 카카오(if(kakao) 2025)' 컨퍼런스에서 직접 발표하면서, 그 의미를 더했어요. 정신아 대표님은 이번 통합이 사용자 경험을 완전히 바꿔놓을 새로운 AI 서비스가 될 것이라고 강조했습니다.\n생각해보니, 카카오가 OpenAI와 전략적 제휴를 맺은 것이 벌써 2025년 2월 4일이었네요. 당시 샘 올트먼 OpenAI CEO와 정신아 카카오 대표가 함께 기자간담회에 참석해 'AI 서비스 대중화'라는 공동 목표를 밝히면서 큰 기대를 모았었죠. 이번 카카오톡과 챗GPT의 통합은 OpenAI가 국내 기업과 맺은 첫 번째 전략적 제휴의 구체적인 성과라는 점에서 정말 특별하다고 할 수 있습니다.\n최신 기술의 정점, GPT-5 기반 모델 적용\n카카오톡에 탑재되는 챗GPT는 놀랍게도 OpenAI의 최신 모델인 GPT-5를 기반으로 한다고 합니다. 현재 일반 사용자들이 접하는 챗GPT보다 훨씬 더 발전된 기술력을 자랑하는데요, 텍스트와 이미지를 처리하고 생성하는 능력은 물론, 고도로 복잡한 맥락까지 인지하는 능력을 갖췄다고 해요. 올리버 제이 OpenAI 인터내셔널 비즈니스 총괄은 \"카카오톡은 한국에서 가족, 친구, 창작자, 기업이 연결되는 플랫폼이며, 이제 세계 최고 수준의 AI가 이 공간에 함께하게 됐다\"고 언급하며 이번 통합의 중요성을 다시 한번 강조했습니다.\n  GPT-5의 주요 특징:\n\n향상된 텍스트 및 이미지 처리/생성 능력\n더욱 정교해진 맥락 인지 능력\n현재 사용 가능한 모델 대비 혁신적인 성능 향상\n  카카오톡 15년 만의 대대적 개편, 그 핵심은?\n이번 AI 통합은 카카오톡이 지난 15년간 쌓아온 역사를 뛰어넘는 대대적인 개편을 동반합니다. 단순히 AI 기능을 추가하는 것을 넘어, 카카오톡의 기본적인 사용 방식 자체를 혁신적으로 변화시킬 예정이라고 해요. 저는 이 부분이 정말 기대되더라고요!\n채팅탭 상단의 'ChatGPT' 버튼 신설\n가장 눈에 띄는 변화는 바로 카카오톡 채팅탭 상단에 생기는 'ChatGPT' 버튼입니다. 별도의 앱을 설치할 필요 없이, 이 버튼 하나만 누르면 바로 챗GPT를 이용할 수 있다고 해요. 그리고 여기서 생성된 대화 내용이나 콘텐츠는 채팅방에 즉시 공유할 수 있어서, 친구들과 대화하다가 궁금한 점이 생기면 바로 AI의 도움을 받고 그 결과를 공유하는 방식으로 활용할 수 있을 것 같아요. 유용하 카카오 AI에이전트플랫폼 성과리더는 \"모든 기능이 대화 안에서 자연스럽게 연결되는 새로운 사용자 경험\"이라고 설명했답니다. 상상만 해도 편리함이 느껴지지 않나요?\n\n\n카카오 에이전트를 통한 생태계 통합\n여기서 끝이 아닙니다. 단순히 AI 채팅을 넘어, 챗GPT가 카카오 에이전트를 통해 카카오 생태계 전반과 연동되는 것이 이번 통합의 진정한 핵심이라고 할 수 있어요. 예를 들어, \"성수동 카페 추천해줘\"라고 물어보면 AI가 알아서 카카오맵을 열어주고, \"엄마 생일 선물로 뭐가 좋을까?\"라는 질문에는 선물하기 서비스로 연결되어 바로 결제까지 할 수 있게 됩니다.\n멜론과 연동되어 인기 노래 차트 정보를 제공하거나, 카카오 예약하기를 통해 식당 예약까지 한 번에 처리하는 것도 가능하다고 하니, 이건 정말 혁신적인 변화라고 생각해요. 이러한 통합 서비스는 앞으로 카카오 계열사뿐만 아니라 공공기관, 외부 파트너들까지 참여하는 대규모 AI 서비스 생태계 플랫폼으로 확장될 예정이라고 하니, 미래의 카카오톡이 정말 기대됩니다.\n⚠️ 주의 사항: 새로운 기능들이 편리함을 제공하지만, AI가 제공하는 정보는 최종 확인이 필요할 수 있습니다. 특히 결제나 예약과 관련된 중요한 결정은 반드시 직접 재확인하는 습관을 들이는 것이 좋겠죠!\n  자체 AI 카나나와의 강력한 시너지 효과\n카카오가 OpenAI와의 협력을 추진하면서 동시에 자체 개발한 AI 서비스 '카나나(Kanana)'도 카카오톡에 통합된다는 점은 정말 주목할 만한 부분이에요. 특히, 카나나는 사용자 데이터의 프라이버시를 최우선으로 고려한 \"온디바이스 AI\" 기술을 적용했다고 합니다. 이 기술이 왜 중요할까요?\n\n\n온디바이스 AI로 프라이버시를 한층 강화\n온디바이스 AI는 스마트폰 내에서만 작동하는 AI 기술을 의미해요. 즉, 사용자의 민감한 대화 데이터가 외부 서버로 전송되지 않고, 오직 사용자 스마트폰 안에서만 처리된다는 것이죠. 강지훈 카카오 AI디스커버리 성과리더는 \"카카오톡 속 대화는 언제나 개인 정보라는 원칙 아래 보호되어야 한다\"며, 데이터를 외부 서버로 보내지 않는 '카나나 나노'를 직접 개발했다고 설명했습니다. 개인 정보 보호에 대한 우려가 많았던 만큼, 이런 점은 정말 환영할 만한 소식입니다.\n세계 최고 수준의 한국어 이해력\n카나나의 또 다른 강점은 바로 세계 최고 수준의 한국어 이해력입니다. 21억 파라미터 기준으로 대형 모델의 약 95% 수준 성능을 구현하면서도, 같은 크기의 글로벌 모델 대비 맥락 감지 능력에서 40% 이상 우위를 보인다고 해요. 게다가 카나나 나노 모델은 676MB라는 경량화된 크기 덕분에 와이파이 환경에서 단 18초 만에 다운로드가 가능하다고 합니다. 카카오의 목표는 올 연말까지 전체 카카오톡 사용자의 절반 이상이 온디바이스 AI를 사용할 수 있도록 하는 것이라고 해요.\n카나나는 복잡한 다자간 대화 속에서도 맥락을 정확히 파악하여 적절한 에이전트를 실행할 수 있어요. 예를 들어 대화 요약, 통화 녹음 및 요약, 숏폼 자동 생성, 그리고 기존 샵(#)검색을 대체하는 '카나나 검색' 등 정말 다양한 기능을 제공한다고 하니, 우리의 스마트폰 생활이 훨씬 더 스마트해질 것 같다는 기대감이 듭니다.\n\n\n  메신저 기능의 혁신적 개편: 더 편리하고 소셜하게!\nAI 통합 외에도 카카오톡은 기본적인 메신저 기능에서도 15년 만의 대대적인 변화를 겪습니다. 저는 개인적으로 이런 사용자 편의성 개선을 정말 오랫동안 기다려왔던 터라 이번 소식이 더욱 반가웠어요.\n사용자 편의성 대폭 향상\n가장 큰 변화 중 하나는 바로 채팅방 폴더 기능 도입입니다. 이제 사용자들은 채팅방을 '안읽음', '친구', '직장' 등 원하는 카테고리별로 분류할 수 있게 돼요. 저처럼 채팅방이 너무 많아서 중요한 메시지를 놓치기 쉬웠던 분들에게는 정말 희소식일 것 같습니다. 또한, 많은 분들이 요구했던 메시지 수정 기능이 드디어 추가된다고 합니다! 지난 8월 메시지 삭제 기능을 24시간으로 연장한 데 이어, 이번 수정 기능까지 더해지면서 사용자 편의성이 정말 크게 향상되었어요. 그리고 안읽음 폴더에서 채팅방을 아래로 당기면 안 읽은 메시지를 미리 볼 수 있는 기능도 새롭게 추가된다고 하니, 사소한 디테일까지 신경 쓴 모습이 엿보입니다.\nSNS 기능 강화로 소셜 플랫폼 진화\n친구탭은 인스타그램처럼 타임라인 피드 기능으로 개편되어, 친구들의 게시물을 확인하고 일상을 공유할 수 있는 소셜 미디어 플랫폼으로 진화합니다. 새로운 '지금탭'도 추가된다고 하니, 카카오톡이 단순한 메신저를 넘어 종합 소셜 플랫폼으로 확실히 자리매김할 것 같아요. 이제 친구들과의 소통이 더욱 다채로워지겠네요!\n  AI 시대를 앞서가는 카카오의 전략적 의미\n정신아 대표는 \"오늘을 시작으로 카카오톡 대화창은 더 많은 것이 실현되는 '가능성의 창'이 될 것\"이라며, \"'카톡해'라는 말은 이제 단순히 '메시지 보내'라는 뜻을 넘어, 카카오 AI를 통해 더 큰 세상을 경험한다는 새로운 의미로 해석될 것\"이라고 강조했습니다. 저도 그 말에 깊이 공감합니다. 생각해보면, 한국 인구의 대부분인 5천만 카카오톡 사용자가 별도 학습 없이도 일상에서 자연스럽게 최첨단 AI 기술을 경험할 수 있게 되는 것이니까요. OpenAI의 올리버 제이 총괄 역시 \"한국인의 일상에 세계적 수준의 AI를 심게 되었다\"고 평가했습니다.\n글로벌 AI 생태계에서의 차별화\n이번 카카오와 OpenAI의 협력은 단순히 기술을 도입하는 것을 넘어, 한국 시장에 최적화된 AI 경험을 제공한다는 점에서 정말 큰 의미가 있다고 봐요. 카카오가 오랜 시간 동안 쌓아온 한국 사용자 데이터와 서비스 경험이 OpenAI의 최첨단 기술과 결합하여, 글로벌 AI 서비스들과 차별화된, 현지화된 서비스를 구현했다는 점이죠. 미그다드 제퍼 OpenAI 프로덕트 매니저는 \"카카오와의 협력은 글로벌 기술과 로컬 리더십을 결합하는 의미 있는 사례\"라고 평가하며, 앞으로 AI 생태계 전반에서 협력을 확대할 계획이라고 밝혔습니다.\n  보안과 프라이버시에 대한 카카오의 깊은 고민\n아무래도 AI가 우리 일상에 깊숙이 들어오는 만큼, 보안과 프라이버시 문제는 민감할 수밖에 없죠. 카카오는 이 부분에 대해서도 명확한 가이드라인을 제시했습니다. 정신아 대표는 \"카카오톡 데이터는 ChatGPT에 학습되지 않고 서버에 저장되지 않는다\"고 강조하며, 사용자 프라이버시 보호를 위한 기술적 조치를 완료했다고 밝혔어요. 이 부분은 정말 중요하다고 생각해요.\n특히 자체 개발한 카나나의 경우, 앞서 설명드렸던 온디바이스 AI 기술을 적용해서 모든 정보가 카카오톡 내부에서만 처리되도록 설계되었어요. 클라우드 서버에 연결할 필요 없이 안전하게 AI 서비스를 위한 데이터를 처리할 수 있다는 점이 정말 안심이 됩니다. 우리가 가장 많이 사용하는 메신저 앱인 만큼, 이런 보안 조치들은 필수적이라고 할 수 있습니다.\n  향후 전망과 카카오의 야심찬 확장 계획\n카카오는 2025년 10월 챗GPT 서비스 시작을 시작으로, 연말까지 카나나 인 카카오톡의 다양한 기능들을 순차적으로 출시할 예정이라고 해요. 김병학 카나나 성과리더는 \"카카오톡뿐 아니라 다양한 카카오 서비스에서 카나나 모델을 자연스럽게 경험하게 될 것\"이라며, \"에이전틱 AI 연구를 통해 일상을 보다 편리하게 변화시키겠다\"는 포부를 밝혔습니다.\n'AI 네이티브 컴퍼니'로의 전환 가속화\n이번 OpenAI와의 협업은 카카오가 그동안 추진해온 'AI 네이티브 컴퍼니' 전환 전략의 핵심 축입니다. 카카오는 자체 개발한 AI 모델과 외부의 우수한 API를 적재적소에 활용하는 '모델 오케스트레이션' 전략을 통해 사용자에게 최상의 서비스를 제공하려 노력하고 있어요. 정신아 대표는 \"하반기를 기점으로 전 국민이 매일 AI를 카카오톡을 접점으로 경험할 수 있도록 하겠다\"며 \"카카오톡과 연결된 다양한 AI 서비스를 순차적으로 출시해 전 국민 AI 시대를 열겠다\"고 힘주어 말했습니다. 이 포부를 들으니, 앞으로 카카오가 만들어갈 AI 기반의 새로운 세상이 정말 궁금해집니다.\n  핵심 요약\n✔️ 2025년 10월, 카카오톡에 챗GPT (GPT-5 기반)와 카나나 AI 전격 통합: 5천만 사용자의 일상에 AI가 자연스럽게 스며듭니다.\n✔️ 카카오 에이전트 통한 생태계 연동: 카카오맵, 선물하기, 멜론 등 다양한 카카오 서비스와 AI가 직접 연결됩니다.\n✔️ 온디바이스 AI '카나나'로 강력한 프라이버시 보호: 사용자 데이터가 외부 서버로 전송되지 않고 스마트폰 내에서만 처리됩니다.\n✔️ 메신저 기능 대대적 개편: 채팅방 폴더, 메시지 수정, SNS형 피드 등 사용자 편의성과 소셜 기능이 크게 강화됩니다.\n이 모든 변화는 카카오톡을 단순한 메신저를 넘어, 개인화된 AI 비서이자 종합적인 소셜 플랫폼으로 진화시키려는 카카오의 큰 그림입니다. 기대해도 좋겠죠?\n❓ 자주 묻는 질문 (FAQ)\nQ1: 챗GPT가 카카오톡에 언제부터 적용되나요?\nA1: 2025년 10월부터 단계적으로 적용될 예정입니다. 카카오는 연말까지 다양한 AI 기능을 순차적으로 출시하며, 카카오톡 사용자들의 AI 경험을 확대할 계획입니다.\nQ2: 카카오톡에 적용되는 AI 모델은 무엇인가요?\nA2: OpenAI의 최신 모델인 GPT-5와 카카오가 자체 개발한 온디바이스 AI '카나나(Kanana)'가 함께 적용됩니다. GPT-5는 범용적인 대화 및 콘텐츠 생성에, 카나나는 특히 한국어 기반의 개인화된 온디바이스 AI 기능에 강점을 보입니다.\nQ3: 사용자 개인 정보는 안전하게 보호되나요?\nA3: 네, 카카오는 사용자 프라이버시 보호를 최우선으로 합니다. 카카오톡 대화 데이터는 챗GPT 학습에 사용되지 않으며, 서버에 저장되지 않습니다. 특히 자체 개발한 카나나 AI는 온디바이스 기술을 통해 모든 정보가 사용자 스마트폰 내에서만 처리되도록 설계되었습니다.\nQ4: AI 기능 외에 카카오톡 메신저 기능에도 변화가 있나요?\nA4: 네, 챗GPT 통합과 함께 채팅방 폴더 기능, 메시지 수정 기능이 추가됩니다. 또한, 친구탭이 인스타그램과 유사한 타임라인 피드 형태로 개편되어 소셜 기능이 강화되는 등 15년 만의 대대적인 메신저 기능 개편이 이루어질 예정입니다.\n카카오와 OpenAI의 이번 통합은 한국 AI 산업의 새로운 이정표가 될 것으로 전망됩니다. 5천만 사용자가 일상에서 자연스럽게 AI를 경험하게 되면서, AI 기술의 대중화와 함께 새로운 디지털 생태계의 시작을 알리는 신호탄이 될 거예요. 저는 정말 기대가 큽니다!\n\n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [\n    {\n      \"@type\": \"Question\",\n      \"name\": \"챗GPT가 카카오톡에 언제부터 적용되나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"2025년 10월부터 단계적으로 적용될 예정입니다. 카카오는 연말까지 다양한 AI 기능을 순차적으로 출시하며, 카카오톡 사용자들의 AI 경험을 확대할 계획입니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"카카오톡에 적용되는 AI 모델은 무엇인가요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"OpenAI의 최신 모델인 GPT-5와 카카오가 자체 개발한 온디바이스 AI '카나나(Kanana)'가 함께 적용됩니다. GPT-5는 범용적인 대화 및 콘텐츠 생성에, 카나나는 특히 한국어 기반의 개인화된 온디바이스 AI 기능에 강점을 보입니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"사용자 개인 정보는 안전하게 보호되나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"네, 카카오는 사용자 프라이버시 보호를 최우선으로 합니다. 카카오톡 대화 데이터는 챗GPT 학습에 사용되지 않으며, 서버에 저장되지 않습니다. 특히 자체 개발한 카나나 AI는 온디바이스 기술을 통해 모든 정보가 사용자 스마트폰 내에서만 처리되도록 설계되었습니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"AI 기능 외에 카카오톡 메신저 기능에도 변화가 있나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"네, 챗GPT 통합과 함께 채팅방 폴더 기능, 메시지 수정 기능이 추가됩니다. 또한, 친구탭이 인스타그램과 유사한 타임라인 피드 형태로 개편되어 소셜 기능이 강화되는 등 15년 만의 대대적인 메신저 기능 개편이 이루어질 예정입니다.\"\n      }\n    }\n  ]\n}",
    "reviews": [],
    "syllabus": [],
    "link": "http://muzbox.tistory.com/483659",
    "pubDate": "Tue, 23 Sep 2025 15:51:43 +0900",
    "creator": "어떤오후의 프리웨어 이야기",
    "categories": [
      "AI, 미래기술/AI 인사이트",
      "AI 네이티브 컴퍼니",
      "GPT-5 카카오톡",
      "온디바이스 AI",
      "카나나 AI",
      "카카오 AI 통합",
      "카카오 OpenAI 제휴",
      "카카오 에이전트",
      "카카오톡 ChatGPT",
      "카카오톡 메시지 수정",
      "카카오톡 업데이트 2025"
    ]
  }
]