[
  {
    "name": "C++ Team Blog",
    "category": "기업",
    "posts": [
      {
        "creator": "Zachary Johnson",
        "title": "Introducing MSVC AddressSanitizer for ARM64 targets",
        "link": "https://devblogs.microsoft.com/cppblog/introducing-msvc-addresssanitizer-for-arm64-targets/",
        "pubDate": "Mon, 17 Nov 2025 20:51:21 +0000",
        "content:encodedSnippet": "We are pleased to announce AddressSanitizer (ASan) support for the Microsoft C++ (MSVC) Build Tools for ARM64 targets. ASan is a runtime memory error detector that identifies difficult-to-find bugs with zero false positives and improves memory safety. More technical information on ASan can be found at aka.ms/asan. \nASan has long supported the x64 and x86 architectures. With the release of Visual Studio 2026 for production use, this support now extends to ARM64. The feature is currently in preview, so there may be build, runtime, or IDE integration issues. Cross-compiling for ARM64 targets from x86 or x64 hosts is supported. ARM64EC is not supported. \nTo use ASan in Visual Studio 2026: \nFrom the Visual Studio Installer: \nSelect MSVC AddressSanitizer under Desktop development with C++ \nTo support cross-compiling projects to ARM64, install MSVC Build Tools for ARM64/ARM64EC  \nTo enable ASan in your C++ project after installation: \nRight click the solution  \nClick Properties  \nClick C/C++ \nEnable AddressSanitizer > Yes (/fsanitize=address)\n \nA preview message will display when targeting ARM64 with ASan: \nARM64 support for MSVC AddressSanitizer is provided as a preview. \nWe’re eager to hear about bugs and suggestions for improvements. \nHowever, note that this feature is provided as-is without support as we’re working towards the full implementation. \nSee: https://aka.ms/asan \nBy default, the VCASan library is also used to improve the debugging experience inside Visual Studio. \nIf you’ve built your application on a host architecture other than ARM64, it must be executed on an ARM64 target machine from an ARM64 Visual Studio 2026 Developer Command Prompt or alongside the ASan binary clang_rt.asan_dynamic-aarch64.dll. Otherwise, the ASan binary must be manually copied from %VSINSTALLDIR%\\VC\\Tools\\MSVC\\<version>\\bin\\Hostarm64\\arm64 to the same directory of the executable under test. \nWe’d love for you to try it out and provide any feedback you may have! Please report any issues you find via Help > Send Feedback > Report a Problem in Visual Studio.\nThe post Introducing MSVC AddressSanitizer for ARM64 targets appeared first on C++ Team Blog.",
        "dc:creator": "Zachary Johnson",
        "comments": "https://devblogs.microsoft.com/cppblog/introducing-msvc-addresssanitizer-for-arm64-targets/#respond",
        "content": "<p>We are pleased to announce AddressSanitizer (ASan) support for the Microsoft C++ (MSVC) Build Tools for ARM64 targets. ASan is a runtime memory error detector that identifies difficult-to-find bugs with zero false positives and improves memory safety. More technical information on ASan can be found at aka.ms/asan.  ASan has long supported the x64 and x86 architectures. With the release of Visual Studio 2026 for [&#8230;]</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/cppblog/introducing-msvc-addresssanitizer-for-arm64-targets/\">Introducing MSVC AddressSanitizer for ARM64 targets</a> appeared first on <a href=\"https://devblogs.microsoft.com/cppblog\">C++ Team Blog</a>.</p>\n",
        "contentSnippet": "We are pleased to announce AddressSanitizer (ASan) support for the Microsoft C++ (MSVC) Build Tools for ARM64 targets. ASan is a runtime memory error detector that identifies difficult-to-find bugs with zero false positives and improves memory safety. More technical information on ASan can be found at aka.ms/asan.  ASan has long supported the x64 and x86 architectures. With the release of Visual Studio 2026 for […]\nThe post Introducing MSVC AddressSanitizer for ARM64 targets appeared first on C++ Team Blog.",
        "guid": "https://devblogs.microsoft.com/cppblog/?p=36111",
        "categories": [
          "AddressSanitizer",
          "Announcement",
          "C++",
          "address sanitizer"
        ],
        "isoDate": "2025-11-17T20:51:21.000Z"
      }
    ]
  },
  {
    "name": "Facebook Engineering",
    "category": "기업",
    "posts": [
      {
        "creator": "",
        "title": "Zoomer: Powering AI Performance at Meta’s Scale Through Intelligent Debugging and Optimization",
        "link": "https://engineering.fb.com/2025/11/21/data-infrastructure/zoomer-powering-ai-performance-meta-intelligent-debugging-optimization/",
        "pubDate": "Fri, 21 Nov 2025 21:00:15 +0000",
        "content:encodedSnippet": "We’re introducing Zoomer, Meta’s comprehensive, automated debugging and optimization platform for AI. \nZoomer works across all of our training and inference workloads at Meta and provides deep performance insights that enable energy savings, workflow acceleration, and efficiency gains in our AI infrastructure. \nZoomer has delivered training time reductions, and significant QPS improvements, making it the de-facto tool for AI performance optimization across Meta’s entire AI infrastructure.\nAt the scale that Meta’s AI infrastructure operates, poor performance debugging can lead to massive energy inefficiency, increased operational costs, and suboptimal hardware utilization across hundreds of thousands of GPUs. The fundamental challenge is achieving maximum computational efficiency while minimizing waste. Every percentage point of utilization improvement translates to significant capacity gains that can be redirected to innovation and growth.\nZoomer is Meta’s automated, one-stop-shop platform for performance profiling, debugging, analysis, and optimization of AI training and inference workloads. Since its inception, Zoomer has become the de-facto tool across Meta for GPU workload optimization, generating tens of thousands of profiling reports daily for teams across all of our apps. \nWhy Debugging Performance Matters\nOur AI infrastructure supports large-scale and advanced workloads across a global fleet of GPU clusters, continually evolving to meet the growing scale and complexity of generative AI.\nAt the training level it supports a diverse range of workloads, including powering models for ads ranking, content recommendations, and GenAI features.  \nAt the inference level, we serve hundreds of trillions of AI model executions per day.\nOperating at this scale means putting a high priority on eliminating GPU underutilization. Training inefficiencies delay model iterations and product launches, while inference bottlenecks limit our ability to serve user requests at scale. Removing resource waste and accelerating workflows helps us train larger models more efficiently, serve more users, and reduce our environmental footprint.\nAI Performance Optimization Using Zoomer\nZoomer is an automated debugging and optimization platform that works across all of our AI model types (ads recommendations, GenAI, computer vision, etc.) and both training and inference paradigms, providing deep performance insights that enable energy savings, workflow acceleration, and efficiency gains.  \nZoomer’s architecture consists of three essential layers that work together to deliver comprehensive AI performance insights: \nInfrastructure and Platform Layer\nThe foundation provides the enterprise-grade scalability and reliability needed to profile workloads across Meta’s massive infrastructure. This includes distributed storage systems using Manifold (Meta’s blob storage platform) for trace data, fault-tolerant processing pipelines that handle huge trace files, and low-latency data collection with automatic profiling triggers across thousands of hosts simultaneously. The platform maintains high availability and scale through redundant processing workers and can handle huge numbers of profiling requests during peak usage periods.\nAnalytics and Insights Engine\nThe core intelligence layer delivers deep analytical capabilities through multiple specialized analyzers. This includes: GPU trace analysis via Kineto integration and NVIDIA DCGM, CPU profiling through StrobeLight integration, host-level metrics analysis via dyno telemetry, communication pattern analysis for distributed training, straggler detection across distributed ranks, memory allocation profiling (including GPU memory snooping), request/response profiling for inference workloads, and much more. The engine automatically detects performance anti-patterns and also provides actionable recommendations.\nVisualization and User Interface Layer\nThe presentation layer transforms complex performance data into intuitive, actionable insights. This includes interactive timeline visualizations showing GPU activity across thousands of ranks, multi-iteration analysis for long-running training workloads, drill-down dashboards with percentile analysis across devices, trace data visualization integrated with Perfetto for kernel-level inspection, heat map visualizations for identifying outliers across GPU deployments, and automated insight summaries that highlight critical bottlenecks and optimization opportunities.\nThe three essential layers of Zoomer’s architecture.\nHow Zoomer Profiling Works: From Trigger to Insights\nUnderstanding how Zoomer conducts a complete performance analysis provides insight into its sophisticated approach to AI workload optimization.\nProfiling Trigger Mechanisms\nZoomer operates through both automatic and on-demand profiling strategies tailored to different workload types. For training workloads, which involve multiple iterations and can run for days or weeks, Zoomer automatically triggers profiling around iteration 550-555 to capture stable-state performance while avoiding startup noise. For inference workloads, profiling can be triggered on-demand for immediate debugging or through integration with automated load testing and benchmarking systems for continuous monitoring.\nComprehensive Data Capture\nDuring each profiling session, Zoomer simultaneously collects multiple data streams to build a holistic performance picture: \nGPU Performance Metrics: SM utilization, GPU memory utilization, GPU busy time, memory bandwidth, Tensor Core utilization, power consumption, clock frequencies, and power consumption data via DCGM integration.\nDetailed Execution Traces: Kernel-level GPU operations, memory transfers, CUDA API calls, and communication collectives via PyTorch Profiler and Kineto.\nHost-Level Performance Data: CPU utilization, memory usage, network I/O, storage access patterns, and system-level bottlenecks via dyno telemetry.\nApplication-Level Annotations: Training iterations, forward/backward passes, optimizer steps, data loading phases, and custom user annotations.\nInference-Specific Data: Rate of inference requests, server latency, active requests, GPU memory allocation patterns, request latency breakdowns via Strobelight’s Crochet profiler, serving parameter analysis, and thrift request-level profiling.\nCommunication Analysis: NCCL collective operations, inter-node communication patterns, and network utilization for distributed workloads\nDistributed Analysis Pipeline\nRaw profiling data flows through sophisticated processing systems that deliver multiple types of automated analysis including:\nStraggler Detection: Identifies slow ranks in distributed training through comparative analysis of execution timelines and communication patterns.\nBottleneck Analysis: Automatically detects CPU-bound, GPU-bound, memory-bound, or communication-bound performance issues.\nCritical Path Analysis: Systematically identifies the longest execution paths to focus optimization efforts on highest-impact opportunities.\nAnti-Pattern Detection: Rule-based systems that identify common efficiency issues and generate specific recommendations.\nParallelism Analysis: Deep understanding of tensor, pipeline, data, and expert parallelism interactions for large-scale distributed training.\nMemory Analysis: Comprehensive analysis of GPU memory usage patterns, allocation tracking, and leak detection.\nLoad Imbalance Analysis: Detects workload distribution issues across distributed ranks and recommendations for optimization.\nMulti-Format Output Generation\nResults are presented through multiple interfaces tailored to different user needs: interactive timeline visualizations showing activity across all ranks and hosts, comprehensive metrics dashboards with drill-down capabilities and percentile analysis, trace viewers integrated with Perfetto for detailed kernel inspection, automated insights summaries highlighting key bottlenecks and recommendations, and actionable notebooks that users can clone to rerun jobs with suggested optimizations.\nSpecialized Workload Support\nFor massive distributed training for specialized workloads, like GenAI, Zoomer contains a purpose-built platform supporting LLM workloads that offers specialized capabilities including GPU efficiency heat maps and N-dimensional parallelism visualization. For inference, specialized analysis covers everything from single GPU models, soon expanding to massive distributed inference across thousands of servers.\nA Glimpse Into Advanced Zoomer Capabilities\nZoomer offers an extensive suite of advanced capabilities designed for different AI workload types and scales. While a comprehensive overview of all features would require multiple blog posts, here’s a glimpse at some of the most compelling capabilities that demonstrate Zoomer’s depth:\nTraining Powerhouse Features:\nStraggler Analysis: Helps identify ranks in distributed training jobs that are significantly slower than others, causing overall job delays due to synchronization bottlenecks. Zoomer provides information that helps diagnose root causes like sharding imbalance or hardware issues.\nCritical Path Analysis: Identification of the longest execution paths in PyTorch applications, enabling accurate performance improvement projections. \nAdvanced Trace Manipulation: Sophisticated tools for compression, filtering, combination, and segmentation of massive trace files (2GB+ per rank), enabling analysis of previously impossible-to-process large-scale training jobs\nInference Excellence Features:\nSingle-Click QPS Optimization: A workflow that identifies bottlenecks and triggers automated load tests with one click, reducing optimization time while delivering QPS improvements of +2% to +50% across different models, depending on model characteristics. \nRequest-Level Deep Dive: Integration with Crochet profiler provides Thrift request-level analysis, enabling identification of queue time bottlenecks and serving inefficiencies that traditional metrics miss.\nRealtime Memory Profiling: GPU memory allocation tracking, providing live insights into memory leaks, allocation patterns, and optimization opportunities.\nGenAI Specialized Features:\nLLM Zoomer for Scale: A purpose-built platform supporting 100k+ GPU workloads with N-dimensional parallelism visualization, GPU efficiency heat maps across thousands of devices, and specialized analysis for tensor, pipeline, data, and expert parallelism interactions.\nPost-Training Workflow Support: Enhanced capabilities for GenAI post-training tasks including SFT, DPO, and ARPG workflows with generator and trainer profiling separation.\nUniversal Intelligence Features:\nHolistic Trace Analysis (HTA): Advanced framework for diagnosing distributed training bottlenecks across communication overhead, workload imbalance, and kernel inefficiencies, with automatic load balancing recommendations.\nZoomer Actionable Recommendations Engine (Zoomer AR): Automated detection of efficiency anti-patterns with machine learning-driven recommendation systems that generate auto-fix diffs, optimization notebooks, and one-click job re-launches with suggested improvements.\nMulti-Hardware Profiling: Native support across NVIDIA GPUs, AMD MI300X, MTIA, and CPU-only workloads with consistent analysis and optimization recommendations regardless of hardware platform.\nZoomer’s Optimization Impact: From Debugging to Energy Efficiency\nPerformance debugging with Zoomer creates a cascading effect that transforms low-level optimizations into massive efficiency gains. \nThe optimization pathway flows from: identifying bottlenecks → improving key metrics → accelerating workflows → reducing resource consumption → saving energy and costs.\nZoomer’s Training Optimization Pipeline\nZoomer’s training analysis identifies bottlenecks in GPU utilization, memory bandwidth, and communication patterns. \nExample of Training Efficiency Wins: \nAlgorithmic Optimizations: We delivered power savings through systematic efficiency improvements across the training fleet, by fixing reliability issues for low efficiency jobs.\nTraining Time Reduction Success: In 2024, we observed a 75% training time reduction for Ads relevance models, leading to 78% reduction in power consumption.\nMemory Optimizations: One-line code changes for performance issues due to inefficient memory copy identified by Zoomer, delivered 20% QPS improvements with minimal engineering effort. \nInference Optimization Pipeline:\nInference debugging focuses on latency reduction, throughput optimization, and serving efficiency. Zoomer identifies opportunities in kernel execution, memory access patterns, and serving parameter tuning to maximize requests per GPU.\nInference Efficiency Wins:\nGPU and CPU Serving parameters Improvements: Automated GPU and CPU bottleneck identification and parameter tuning, leading to 10% to 45% reduction in power consumption.\nQPS Optimization: GPU trace analysis used to boost serving QPS and optimize serving capacity.\nZoomer’s GenAI and Large-Scale Impact\nFor massive distributed workloads, even small optimizations compound dramatically. 32k GPU benchmark optimizations achieved 30% speedups through broadcast issue resolution, while 64k GPU configurations delivered 25% speedups in just one day of optimization.\nThe Future of AI Performance Debugging\nAs AI workloads expand in size and complexity, Zoomer is advancing to meet new challenges focused on several innovation fronts: broadening unified performance insights across heterogeneous hardware (including MTIA and next-gen accelerators), building advanced analyzers for proactive optimization, enabling inference performance tuning through serving param optimization, and democratizing optimization with automated, intuitive tools for all engineers. As Meta’s AI infrastructure continues its rapid growth, Zoomer plays an important role in helping us innovate efficiently and sustainably. \nThe post Zoomer: Powering AI Performance at Meta’s Scale Through Intelligent Debugging and Optimization appeared first on Engineering at Meta.",
        "dc:creator": "",
        "content": "<p>We’re introducing Zoomer, Meta’s comprehensive, automated debugging and optimization platform for AI.  Zoomer works across all of our training and inference workloads at Meta and provides deep performance insights that enable energy savings, workflow acceleration, and efficiency gains in our AI infrastructure.  Zoomer has delivered training time reductions, and significant QPS improvements, making it the [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/11/21/data-infrastructure/zoomer-powering-ai-performance-meta-intelligent-debugging-optimization/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2025/11/21/data-infrastructure/zoomer-powering-ai-performance-meta-intelligent-debugging-optimization/\">Zoomer: Powering AI Performance at Meta&#8217;s Scale Through Intelligent Debugging and Optimization</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
        "contentSnippet": "We’re introducing Zoomer, Meta’s comprehensive, automated debugging and optimization platform for AI.  Zoomer works across all of our training and inference workloads at Meta and provides deep performance insights that enable energy savings, workflow acceleration, and efficiency gains in our AI infrastructure.  Zoomer has delivered training time reductions, and significant QPS improvements, making it the [...]\nRead More...\nThe post Zoomer: Powering AI Performance at Meta’s Scale Through Intelligent Debugging and Optimization appeared first on Engineering at Meta.",
        "guid": "https://engineering.fb.com/?p=23436",
        "categories": [
          "Data Center Engineering",
          "Data Infrastructure",
          "ML Applications"
        ],
        "isoDate": "2025-11-21T21:00:15.000Z"
      },
      {
        "creator": "",
        "title": "Key Transparency Comes to Messenger",
        "link": "https://engineering.fb.com/2025/11/20/security/key-transparency-comes-to-messenger/",
        "pubDate": "Thu, 20 Nov 2025 17:00:21 +0000",
        "content:encodedSnippet": "We’re excited to share another advancement in the security of your conversations on Messenger: the launch of key transparency verification for end-to-end encrypted chats. \nThis new feature enables an additional level of assurance that only you — and the people you’re communicating with — can see or listen to what is sent, and that no one else, not even Meta, can do so.\nEnd-to-end encryption on Messenger already ensures that the content of your direct messages and calls are protected from the moment they leave your device to the moment they reach the receiver’s device. As part of our end-to-end encrypted chat platform, we believe it’s also important that anyone can verify that the public keys (used by the sender’s device for encrypting each message) belong to the intended recipients and haven’t been tampered with.\nThis launch builds upon the valuable work and experiences shared by others in the industry. WhatsApp’s implementation of key transparency in 2023 demonstrated the feasibility of this technology for large-scale encrypted messaging. We’ve extended these pioneering efforts in our Messenger implementation to deliver a robust and reliable solution with similar security properties.\nWhat Is Key Transparency?\nKey transparency provides messaging users with a verifiable and auditable record of public keys. It allows them to confirm that their conversations are indeed encrypted with the correct keys for their contacts, and that these keys haven’t been maliciously swapped by a compromised server. This means you can be more confident that your messages are only accessible to the people you intend to communicate with.\n\nYou can already check your keys for end-to-end encrypted chats on Messenger, but this can be cumbersome for people who have logged in to Messenger on multiple devices, each of which has its own key. Moreover, these keys change when new devices are added or are re-registered, which necessitates another check of the key every time this happens. \nTo address this, we’ve added a new security feature, based on key transparency, that allows users to verify these keys without having to compare them manually with their contacts. Of course, anyone who wishes to continue manually verifying their keys is free to do so.\nHow We’re Handling Messenger Keys at Scale\nOur key transparency implementation leverages the Auditable Key Directory (AKD) library, mirroring the system already in place for WhatsApp. This system allows Meta to securely distribute and verify users’ public keys. To further enhance the security of this process, we use Cloudflare’s key transparency auditor to provide an additional layer of verification, ensuring that the distribution of keys is transparent and verifiable by anyone. Cloudflare’s auditor maintains a live log of the latest entries on the Key Transparency Dashboard, for both the WhatsApp and Messenger directories.\nImplementing key transparency on the scale of Messenger presented unique engineering challenges. One significant factor was the sheer volume and frequency of key updates. Messenger indexes keys for each and every device someone has logged in on, which means that a single user often has multiple, frequently-changing keys associated with their account.\nThis increased complexity leads to a much higher frequency of key updates being sequenced into our key transparency directory. Currently, we’re observing an epoch frequency of approximately 2 minutes per publish, with hundreds of thousands of new keys added in each epoch. Since we began indexing, our database has already grown to billions of key entries. We’ve implemented a number of advancements in our infrastructure and libraries to help manage this massive and constantly growing dataset, while ensuring high availability and real-time verification:\nWe improved the algorithmic efficiency of the existing key lookup and verification operations in the AKD library by optimizing for smaller proof sizes, even as the number of updates (versions) for a single key grows. Previously, these proofs grew linearly with the height of the transparency tree, which was still difficult to manage given the number of nodes in the tree.\nWe also updated our existing infrastructure to be more resilient to temporary outages and improved the process for recovering from long delays in key sequencing. These improvements were adapted from lessons learned from running WhatsApp’s key transparency log for the past two years.\nWith key transparency now live on Messenger, users will have the ability to automatically verify the authenticity of their contacts’ encryption keys for one-on-one chats. This represents another step forward in our ongoing investment in providing a secure and private service. \nStay tuned for more updates as we continue to enhance the security and privacy of end-to-end encryption in Messenger.\nThe post Key Transparency Comes to Messenger appeared first on Engineering at Meta.",
        "dc:creator": "",
        "content": "<p>We&#8217;re excited to share another advancement in the security of your conversations on Messenger: the launch of key transparency verification for end-to-end encrypted chats.  This new feature enables an additional level of assurance that only you — and the people you&#8217;re communicating with — can see or listen to what is sent, and that no [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/11/20/security/key-transparency-comes-to-messenger/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2025/11/20/security/key-transparency-comes-to-messenger/\">Key Transparency Comes to Messenger</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
        "contentSnippet": "We’re excited to share another advancement in the security of your conversations on Messenger: the launch of key transparency verification for end-to-end encrypted chats.  This new feature enables an additional level of assurance that only you — and the people you’re communicating with — can see or listen to what is sent, and that no [...]\nRead More...\nThe post Key Transparency Comes to Messenger appeared first on Engineering at Meta.",
        "guid": "https://engineering.fb.com/?p=23382",
        "categories": [
          "Security & Privacy"
        ],
        "isoDate": "2025-11-20T17:00:21.000Z"
      },
      {
        "creator": "",
        "title": "Efficient Optimization With Ax, an Open Platform for Adaptive Experimentation",
        "link": "https://engineering.fb.com/2025/11/18/open-source/efficient-optimization-ax-open-platform-adaptive-experimentation/",
        "pubDate": "Tue, 18 Nov 2025 17:00:24 +0000",
        "content:encodedSnippet": "We’ve released Ax 1.0, an open-source platform that uses machine learning to automatically guide complex, resource-intensive experimentation.\nAx is used at scale across Meta to improve AI models, tune production infrastructure, and accelerate advances in ML and even hardware design.\nOur accompanying paper, “Ax: A Platform for Adaptive Experimentation” explains Ax’s architecture, methodology, and how it compares to other state-of-the-art black-box optimization libraries.\nHow can researchers effectively understand and optimize AI models or systems that have a vast number of possible configurations? This is a challenge that is particularly prevalent in domains characterized by complex, interacting systems, such as modern AI development and deployment. Optimizing under these settings demands experimentation, and efficiency is of the utmost importance when evaluating a single configuration is extremely resource- and/or time-intensive.\nAdaptive experimentation offers a solution to this problem by actively proposing new configurations for sequential evaluation, leveraging insights gained from previous evaluations\nThis year, we released version 1.0 of Ax, an open source adaptive experimentation platform that leverages machine learning to guide and automate the experimentation process. Ax employs Bayesian optimization to enable researchers and developers to conduct efficient experiments, identifying optimal configurations to optimize their systems and processes.\nIn conjunction with this major release, we published a paper titled, “Ax: A Platform for Adaptive Experimentation” that explores Ax’s core architecture, provides a deeper explanation of the methodology powering the optimization, and compares Ax’s performance against other black-box optimization libraries.\nAx has been successfully applied across various disciplines at Meta, including:\nTraditional machine learning tasks, such as hyperparameter optimization and architecture search.\nAddressing key challenges in GenAI, including discovering optimal data mixtures for training AI models.\nTuning infrastructure or compiler flags in production settings.\nOptimizing design parameters in physical engineering tasks, such as designing AR/VR devices.\nBy utilizing Ax, developers can employ state-of-the-art methodology to conduct complex experiments, ultimately gaining a deeper understanding and optimizing their underlying systems.\nHow to Get Started With Ax\nTo start using Ax to efficiently tune parameters in complex systems install the latest version of the library via `pip install ax-platform` and visit the Ax website for a quickstart guide, tutorials, and deep dives on the methods that Ax uses under the hood.\nAx Is for Real World Experimentation\nAdaptive experiments are incredibly useful, but can be challenging to run. Not only do these experiments require the use of sophisticated machine learning methods to drive the optimization, they also demand specialized infrastructure for managing experiment state, automating orchestration, providing useful analysis and diagnostics, and more. Additionally, the goals of any given experiment are often more complex than simply improving a single metric. In practice experimentation is usually a careful balance between multiple objective metrics subject to multiple constraints and guardrails.\nWe built Ax to empower users to easily configure and run these dynamic experiments using state-of-the-art techniques, and to provide a robust and mature platform for researchers to integrate cutting-edge methods directly into production systems.\nAx for Understanding\nIn addition to finding optimal configurations efficiently, Ax is a powerful tool for understanding the underlying system being optimized. Ax provides a suite of analyses (plots, tables, etc) which helps its users understand how the optimization is progressing over time, tradeoffs between different metrics via a Pareto frontier, visualize the effect of one or two parameters across the input space, and explain how much each input parameter contributes to the results (via sensitivity analysis). \nThese tools allow experimenters to walk away with both an optimal configuration to deploy to production and a deeper understanding of their system, which can inform decisions moving forward.\n   \nHow Ax Works\nBy default Ax uses Bayesian optimization, an effective adaptive experimentation method that excels at balancing exploration – learning how new configurations  perform, and exploitation – refining configurations previously observed to be good. Ax relies on BoTorch for its implementation of Bayesian optimization components.\n\nBayesian optimization is an iterative approach to solving the global optimization problem  which does not assume any information about the form of the function f. In practice, this means optimizing systems by evaluating some candidate configurations  (i.e., trying some configurations out and measuring their effect), building a surrogate model using this data, using that surrogate to identify the most promising configuration to evaluate next, and repeating until an optimal solution has been found or the experimental budget is exhausted.\nUnder typical settings Ax uses a Gaussian process (GP) as the  surrogate model during the Bayesian optimization loop, a flexible model which can make predictions while quantifying uncertainty and is especially effective with very few data points. Ax then uses an acquisition function from a family called expected improvement (EI) to suggest the next candidate configurations to evaluate by capturing the expected value of any new configuration compared to the best previously evaluated configuration.\nThe following animation shows this loop with a GP modeling the goal metric plotted above in blue and EI plotted below in black; the highest value of EI informs the next value of x to evaluate. Once the new value of x has been evaluated, the GP is re-fit with the new data point and we calculate the next EI value.\n\nThis 1-dimensional example can be expanded for many input and output dimensions, allowing Ax to optimize problems with many (potentially hundreds) of tunable parameters and outcomes. In fact, higher-dimensional settings, in which covering the search space becomes exponentially more costly, is where the surrogate-based approach really shines compared to other approaches.\nYou can read more about Bayesian optimization on Ax website’s Introduction to Bayesian Optimization page.\nHow We Use Ax at Meta\nAx has been deployed at scale at Meta to solve some of the company’s most challenging optimization problems. Thousands of developers at Meta use Ax for tasks like hyperparameter optimization and architecture search for AI models, tuning parameters for online recommender and ranking models, infrastructure optimizations, and simulation optimization for AR and VR hardware design.\nThese experiments optimize nuanced goals and leverage sophisticated algorithms. For instance, we’ve used multi-objective optimization to simultaneously improve a machine learning model’s accuracy while minimizing its resource usage. When researchers were tasked with shrinking natural language models to fit on the first generation of  Ray-Ban Stories they used Ax to search for models that optimally traded off size and performance. Additionally, Meta engineers use constrained optimization techniques for tuning recommender systems to optimize key metrics while avoiding regressions in others.\nRecently, Ax was used to design new faster curing, low carbon concrete mixes that were deployed at one of our data center construction sites. These new mixes are playing an important role in advancing our goal of net zero emissions in 2030.\nWe see problems across every domain where the ultimate quality of a system is affected by parameters whose interactions are complex to reason about without experimentation and where experimentation has a meaningful cost: Ax addresses these challenges by employing a data-driven approach to adapt experiments as they unfold, enabling us to solve these problems efficiently and effectively.\nThe Future of Ax\nWe are always working to improve Ax by building new features for representing innovative experiment designs, exciting new optimization methods, or integrations for using Ax with external platforms. Ax is proud to be open source (MIT license), and we invite both the practitioner and research communities to contribute to the project whether that be through improved surrogate models or acquisition  functions,  extensions used for individual research applications that may benefit the larger community, or simply bug fixes or improvements to the core capabilities. Please reach out to the team via Github Issues.\nRead the Paper\nAx: A Platform for Adaptive Experimentation\nTo learn more about Meta Open Source, visit our website, subscribe to our YouTube channel, or follow us on Facebook, Threads, X, Bluesky and LinkedIn.\nAcknowledgements\nAx was created by Meta’s Adaptive Experimentation team: Sebastian Ament, Eytan Bakshy, Max Balandat, Bernie Beckerman, Sait Cakmak, Cesar Cardoso, Ethan Che, Sam Daulton, David Eriksson, Mia Garrard, Matthew Grange, Carl Hvarfner, Paschal Igusti, Lena Kashtelyan, Cristian Lara, Ben Letham, Andy Lin, Jerry Lin, Jihao Andreas Lin, Samuel Müller, Miles Olson, Eric Onofrey, Shruti Patel, Elizabeth Santorella, Sunny Shen, Louis Tiao, and Kaiwen Wu.\nThe post Efficient Optimization With Ax, an Open Platform for Adaptive Experimentation appeared first on Engineering at Meta.",
        "dc:creator": "",
        "content": "<p>We’ve released Ax 1.0, an open-source platform that uses machine learning to automatically guide complex, resource-intensive experimentation. Ax is used at scale across Meta to improve AI models, tune production infrastructure, and accelerate advances in ML and even hardware design. Our accompanying paper, &#8220;Ax: A Platform for Adaptive Experimentation&#8221; explains Ax’s architecture, methodology, and how it [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/11/18/open-source/efficient-optimization-ax-open-platform-adaptive-experimentation/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2025/11/18/open-source/efficient-optimization-ax-open-platform-adaptive-experimentation/\">Efficient Optimization With Ax, an Open Platform for Adaptive Experimentation</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
        "contentSnippet": "We’ve released Ax 1.0, an open-source platform that uses machine learning to automatically guide complex, resource-intensive experimentation. Ax is used at scale across Meta to improve AI models, tune production infrastructure, and accelerate advances in ML and even hardware design. Our accompanying paper, “Ax: A Platform for Adaptive Experimentation” explains Ax’s architecture, methodology, and how it [...]\nRead More...\nThe post Efficient Optimization With Ax, an Open Platform for Adaptive Experimentation appeared first on Engineering at Meta.",
        "guid": "https://engineering.fb.com/?p=23315",
        "categories": [
          "Open Source"
        ],
        "isoDate": "2025-11-18T17:00:24.000Z"
      },
      {
        "creator": "",
        "title": "Announcing the Completion of the Core 2Africa System: Building the Future of Connectivity Together",
        "link": "https://engineering.fb.com/2025/11/17/connectivity/core-2africa-system-completion-future-connectivity/",
        "pubDate": "Tue, 18 Nov 2025 06:00:58 +0000",
        "content:encodedSnippet": "Connecting Africa and the World\nWe’re excited to share the completion of the core 2Africa infrastructure, the world’s longest open access subsea cable system. 2Africa is a landmark subsea cable system that sets a new standard for global connectivity. This project is the result of years of collaboration, innovation, and a shared vision to connect communities, accelerate economic growth, and enable transformative digital experiences across Africa and beyond.\ndocument.createElement('video');\nhttps://engineering.fb.com/wp-content/uploads/2025/11/2Africa_Impact_Captions_1920x1080_Stereo_MPEG-4-1.mp4\n \nUnprecedented Scale and Reach\n2Africa is the first cable to connect East and West Africa in a continuous system and link Africa to the Middle East, South Asia, and Europe. With a current reach of 33 countries and still counting, we’re enabling connectivity for 3 billion people across Africa, Europe, and Asia – more than 30% of the world’s population. This scale is unprecedented and we are proud to have partnered with stakeholders across the ecosystem to deliver new levels of connectivity at such scale.\nThe 2Africa Subsea Cable reaches 3 continents and lands in 33 countries, connecting over 3 billion people.\nBuilding 2Africa: Partnership, Scale, and Open Access\nAfrica’s digital future depends on robust, scalable infrastructure built in partnership with local communities and stakeholders. As demand for high-speed internet grows, a consortium of global partners led by Meta, including Bayobab (MTN Group), center3 (stc), CMI, Orange, Telecom Egypt, Vodafone Group, and WIOCC, came together to design and invest in what would become the world’s longest open access subsea cable system. With the Pearls extension scheduled to go live in 2026, 2Africa’s complete system length of 45,000 kilometers is longer than the equivalent of the Earth’s circumference. \nRealizing this vision required close collaboration across both private and public sectors. We managed the project and facilitated engagement with local partners for cable landing, construction, and regulatory processes. The deployment spanned 50 jurisdictions and nearly six years of work, relying on the active engagement of regulators and policymakers to navigate requirements and keep progress on track.\nThe consortium’s shared goal is to develop an open, inclusive network that fosters competition, supports innovation, and unlocks new opportunities for millions. This open-access model ensures that multiple service providers can leverage the infrastructure, accelerating digital transformation and AI adoption across the region. New partners including Bharti Airtel and MainOne (an Equinix Company) collaborated on specific segments and data center integration, further expanding the cable’s impact and reach.\nEngineering Innovation and Overcoming Challenges\nBuilding 2Africa required us to push the boundaries of what’s possible in subsea infrastructure. We deployed advanced spatial division multiplexing (SDM) technology, supporting up to 16 fiber pairs per cable. This is double the capacity of older systems. It is the first 16-fiber-pair subsea cable to fully connect Africa. We incorporated undersea optical wavelength switching, enabling flexible bandwidth management and supporting evolving demands for AI, cloud, and high-bandwidth applications.\n\nWe increased 2Africa’s burial depth by 50% over previous systems and carefully routed the cable to avoid seabed hazards such as seamounts at hot brine pools, improving resilience and network availability. The system features two independent trunk powering architectures across its West, East, and Mediterranean segments, optimizing capacity and providing additional resiliency against electrical faults. Our branching unit switching capability allowed us to optimize for trunk capacity and reliability by utilizing routes much further offshore from hazards such as the Congo Canyon turbidity currents, while efficiently serving branches to West African nations. To further ensure the integrity and reach of the cable, we engineered compatible crossing solutions for over 60 oil and gas pipelines. \n\nOver the course of construction, we deployed 35 offshore vessels, amounting to nearly 32 years of vessel operations, while dedicated shore-end operations required even more inshore vessels, locally mobilized for cable pulling, guarding, security, and dive support. In remote locations, we imported and mobilized specialist equipment such as dive decompression chambers and shore-end burial tooling to locally operated vessels.\nEconomic Impact and Community Transformation\n2Africa is delivering a step change in international bandwidth for Africa, with technical capacity that far exceeds previous systems. For example, on the West segment, stretching from England to South Africa, and landing in countries such as Senegal, Ghana, Cote d’Ivoire, Nigeria, Gabon, the Republic of Congo, DRC, and Angola, the cable supports 21 terabits per second (Tbps) per fiber pair, with 8 fiber pairs on the trunk. This results in a total trunk capacity of up to 180 Tbps. \nBut what does 180 Tbps mean for people?\nTo put in perspective:\n180 Tbps is enough to stream over 36 million HD movies simultaneously (assuming 5 megabits per second (Mbps) per stream).\nFor an individual, this means the potential to download 15,000 full-length Nollywood films (each about 1.5 GB) per second, or enable students to access a remote university’s full library in a minute.\nFor a city like Lagos, it means millions of people can video call, stream, and work online at the same time – without experiencing slowdowns or congestion.\nThis massive capacity ensures a near-limitless supply of international internet bandwidth, allowing internet service providers (ISPs) and mobile network operators (MNOs) to secure capacity at much lower wholesale prices. This creates market competition, redundancy, and supports modern digital infrastructure including cloud services, data centers, and 5G deployment. \nThe impact is profound: 2Africa is expected to contribute up to 36.9 billion US dollars to Africa’s GDP within just the first two to three years of operation. The cable’s arrival will boost job creation, entrepreneurship, and innovation hubs in connected regions. Evidence from previous cable landings shows that fast internet access increases employment rates, improves productivity, and supports shifts toward higher-skill occupations. \nMeta’s vision is to empower African entrepreneurs, creators, and businesses to innovate and collaborate. By partnering with policymakers, regulators, and stakeholders, we advance Africa’s digital transformation and support its position as an emerging major player in the global digital economy.\nBuilding Connections, Empowering Progress\nThe completion of 2Africa is a defining moment for Africa’s digital future. By leading the design, funding, and deployment of the world’s longest subsea cable system to date, we are building the infrastructure that will power transformative new experiences, drive economic growth, and connect billions of people. We are laying the foundation for the next generation of digital experiences. This subsea cable will enable faster, more reliable internet and support AI-driven services through digital access.\n2Africa is part of Meta’s mission to build the future of human connection, opening more pathways for communities across Africa to help shape and play a critical role in the next chapter of the global digital economy. \nThe post Announcing the Completion of the Core 2Africa System: Building the Future of Connectivity Together appeared first on Engineering at Meta.",
        "dc:creator": "",
        "content": "<p>Connecting Africa and the World We’re excited to share the completion of the core 2Africa infrastructure, the world&#8217;s longest open access subsea cable system. 2Africa is a landmark subsea cable system that sets a new standard for global connectivity. This project is the result of years of collaboration, innovation, and a shared vision to connect [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/11/17/connectivity/core-2africa-system-completion-future-connectivity/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2025/11/17/connectivity/core-2africa-system-completion-future-connectivity/\">Announcing the Completion of the Core 2Africa System: Building the Future of Connectivity Together</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
        "contentSnippet": "Connecting Africa and the World We’re excited to share the completion of the core 2Africa infrastructure, the world’s longest open access subsea cable system. 2Africa is a landmark subsea cable system that sets a new standard for global connectivity. This project is the result of years of collaboration, innovation, and a shared vision to connect [...]\nRead More...\nThe post Announcing the Completion of the Core 2Africa System: Building the Future of Connectivity Together appeared first on Engineering at Meta.",
        "guid": "https://engineering.fb.com/?p=23313",
        "categories": [
          "Connectivity"
        ],
        "isoDate": "2025-11-18T06:00:58.000Z"
      },
      {
        "creator": "",
        "title": "Enhancing HDR on Instagram for iOS With Dolby Vision",
        "link": "https://engineering.fb.com/2025/11/17/ios/enhancing-hdr-on-instagram-for-ios-with-dolby-vision/",
        "pubDate": "Mon, 17 Nov 2025 17:30:25 +0000",
        "content:encodedSnippet": "We’re sharing how we’ve enabled Dolby Vision and ambient viewing environment (amve) on the Instagram iOS app to enhance the video viewing experience.\nHDR videos created on iPhones contain unique Dolby Vision and amve metadata that we needed to support end-to-end\nInstagram for iOS is now the first Meta app to support Dolby Vision video, with more support coming across all of Meta’s apps coming in the future.\nEvery iPhone-produced HDR video encoding includes two additional pieces of metadata that help ensure the picture is consistent between different displays and viewing conditions:\nAmbient viewing environment (amve), which provides the characteristics of the nominal ambient viewing environment for displaying associated video content. This information enables the final device to adjust the rendering of the video if the actual ambient viewing conditions differ from those for which it was encoded.\nDolby Vision, which enhances color, brightness, and contrast to better match the video to the capabilities of the display.\nWhile the Instagram and Facebook iOS apps have supported high dynamic range (HDR) video since 2022, our initial rollout of HDR didn’t support Dolby Vision or amve delivery and playback. Our derived encodings were done with FFmpeg, which has traditionally lacked support for Dolby Vision and amve. Since our tooling was discarding this metadata, it meant that pictures were not entirely representative of the way they were meant to be viewed – something that was particularly noticeable at low screen brightness levels.\nNow, after hearing feedback from people using our iOS apps, we’ve worked with our partners to preserve the iOS-produced amve and Dolby Vision metadata from end-to-end and significantly enhanced the HDR viewing experience on iOS devices.  \nHow Meta Processes Video \nIt may first be helpful to give some background on the lifecycle of a video at Meta. \nThe majority of videos uploaded through our apps go through three main stages:\n1. Client Processing \nIn the client processing stage, the creator’s device flattens their composition into a single video file at a size appropriate for upload. For HDR videos produced by iOS devices this means encoding with HEVC using the Main 10 profile. This is the stage in which amve and Dolby Vision metadata are produced, added to the encoded bitstream, and uploaded to Meta’s servers.\n2.  Server Processing\nIn the server processing stage, our transcoding system generates different versions of the video for different consumers. As playback occurs across a variety of devices with different capabilities, we need to produce the video in a format which will be optimal for each device. In the scope of HDR uploads, this means producing an SDR version for devices that don’t support HDR, a VP9 version to satisfy the majority of players, and (for our most popular videos) an AV1 version with the highest quality at the lowest file size.\nEach of these versions is produced at a different bitrate (essentially, file size) to ensure that consumers with varying network conditions are all able to play the video without waiting for a large download to complete (the tradeoff is that lower bitrates have lower quality). All of our derived encodings are created with FFmpeg, which historically lacked support for amve and Dolby Vision. This is the stage where metadata was getting dropped.\n3. Consumption\nIn the consumption stage, the viewer’s device picks the version that will play back smoothly (without stalls), decodes it frame by frame, and draws each frame onto the screen. In the context of iOS, all HDR playback is done using Apple’s AVSampleBufferDisplayLayer (AVSBDL). This is the class that consumes amve and Dolby Vision metadata along with each decoded frame.\nHow We Added Support for amve\nWhen we first set off to support amve in 2022, we noticed something interesting. As we operate on a decoupled architecture of lower-level components rather than a typical high-level AVPlayer setup, we were able to inspect an intact video encoding and get a look at the amve metadata in between the decoder and AVSBDL. We observed that every frame of every video seemed to have exactly the same metadata. This allowed us to hold ourselves over with a quick fix and hardcode these values directly into our player pipeline.\nThis was not a great situation to be in. Even though the value seemed to be static, there was nothing enforcing this. Maybe a new iPhone or iOS version would produce different values, then we’d be using the wrong ones. amve is also not a concept on Android, which would mean that viewing an Android-produced HDR encoding on iPhone would result in an image that was not technically accurate.\nIn 2024, we worked with the community to land amve support in FFmpeg. We also built in some logging, which showed that our two-year-old assertion that the values never change still stood. But if they ever do, we will be properly set up for it. \nEnabling Dolby Vision\nDolby Vision was not as straightforward as amve to adopt.\nChallenge #1: The extant specification was for carriage of metadata within an HEVC bitstream. We don’t deliver HEVC.\niPhone-produced HDR uses Dolby Vision profile 8.4, where 8 indicates a profile using HEVC (the video codec) and .4 means cross-compatible with HLG (the standard for HDR video that players without Dolby Vision support would adhere to). \nIn order to deliver Dolby Vision metadata we needed to carry it within a codec that we do deliver. Fortunately, Dolby has created Profile 10 for carriage of Dolby Vision within AV1. As VP9 does not offer a facility for carriage of additional metadata there is no support for Dolby Vision at this time, but we are interested in exploring alternate delivery mechanisms.\nHowever, Dolby Vision Profiles 10 and 8 were not properly supported by our existing video processing tools, including FFmpeg and Shaka packager. Based on the specifications from Dolby, we collaborated with the FFmpeg developers to fully implement support for Dolby Vision Profile 8 and Profile 10. In particular, we enabled support within FFmpeg to transcode HEVC with Profile 8.4 into AV1 with Profile 10.4 using both the libaom and libsvtav1 encoders, and made fixes to other parts of the stack, including dav1d decoder and Shaka packager, to properly support Dolby Vision metadata.\nChallenge #2: Getting Dolby Vision into AVSampleBufferDisplayLayer\nWhen you feed AVSBDL an encoded bitstream in a supported format, e.g., HEVC from an iPhone camera, Dolby Vision just works for free. But we feed buffers that we decode independently, as we need to be able to decode formats that Apple does not offer out of the box (AV1 on devices before the iPhone 15 Pro, for example). Given this setup, it’s only fair that we’d have to extract Dolby Vision independently as well.\nFollowing the newly-minted specification for carriage of Profile 10 within an AV1 bitstream from Dolby, we implemented manual extraction of Dolby Vision metadata, packaged it into the same format that AVSBDL expected, and we were in business.\nTo prove that our setup was working as expected, we set up a series of identical Instagram posts with and without Dolby Vision metadata. Our partners at Dolby measured the brightness of each of these posts using a display color analyzer, at varying levels of screen brightness.\nThey captured the following:\nScreen brightness settings versus image brightness, with and without Dolby Vision.\nIn this chart, the X-axis represents the screen brightness setting and the Y-axis represents the observed image brightness. The results demonstrate that with Dolby Vision metadata present, the brightness of the content much more closely follows the brightness setting of the screen.\nIt worked!…But we were not done yet. \nTesting Our Dolby Vision Implementation\nAt Meta, we A/B test new features before shipping them to ensure they are performing as we expect. How do we A/B test metadata embedded within a video bitstream? The answer is that we produced an additional version of every video containing the new metadata. We delivered this new version to a randomly distributed test population while the randomly distributed control population continued receiving the existing experience. At our scale, we can assert that roughly an equal population will watch both flavors of each video.\nFor each flavor, we collected statistics such as how long the video was watched, how long it took to load, what type of connection it was watched on, and whether any errors were encountered during playback. Then we analyzed in aggregate to see how the flavor with metadata compared to the flavor without.\nWe hypothesized that if the metadata works as expected, videos with the new metadata would receive more watch time. But when we ran our initial test on Instagram Reels in 2024 we found that, on average, videos with Dolby Vision metadata were actually watched less than their standard counterparts.\nHow could this be possible? Isn’t Dolby Vision supposed to improve the image?\nOur First A/B Test With Dolby Vision Metadata \nOur data indicated that people were watching less Dolby Vision video because the videos were taking too long to load and people were just moving on to the next Reel in their feed.\nThere was a reasonable cause for the longer load times: The new metadata added on the order of 100 kbps to every video on average. It sounds petty, but our encodings are highly optimized for all kinds of diverse viewing conditions. Every bit counts in some situations, and a 100-kbps overhead was enough to regress engagement at the margins.\nThe answer to this was a compressed metadata format. The team at Dolby offered another specification which would lower the metadata overhead by a factor of four, to 25 kbps on average.\nWould it be enough? We had to run another test to find out. But there was more work to be done first.\nWe needed to implement support for Dolby Vision metadata compression (and decompression while we’re at it) in FFmpeg using a bitstream filter. Also, while the uncompressed format was something we could extract from the bitstream and hand off to Apple, the compressed format was not something that was supported by Apple out of the box. We had to implement client-side decompression on our own.\nAbout 2000 lines of code later, we were ready.\nOur Successful A/B Test \nThis time, we found that consumers viewing with Dolby Vision metadata were spending more time in the app. We attribute this to people spending more time watching HDR videos in lower-light environments, when their screens are set to lower brightness levels and the HDR videos with proper metadata are less taxing on the eyes.\nBecause including Dolby Vision metadata had a tangibly positive outcome, we were able to make the case for shipping it across Instagram for iOS, making it our first app to take advantage of Dolby Vision. As of June 2025, all of our delivered AV1 encodings derived from iPhone-produced HDR include Dolby Vision metadata.\nThe Future of Dolby Vision Across Meta\nThe final challenge in the scope of this post is that Dolby Vision is not widely supported within the web ecosystem across different browsers and displays. Thus, we cannot accurately show the difference that it makes on this page, and hope you will experience it on Instagram on iPhone for yourself. The support for Dolby vision and amve is now in our encoding recipes and as such it’s ready for deployment to other platforms as well as we’re currently working on extending the support to Facebook Reels.\nIn collaboration with Dolby, we’ve solved the perceptible problem of HDR metadata preservation and collaborated with the FFmpeg developers to implement its support and make it readily available to the  community to take advantage of.\nThis is just the beginning. We look forward to expanding Dolby Vision to other Meta apps and their corresponding operating systems.\nAcknowledgements\nWe’d like to thank Haixia Shi, the team at Dolby, and Niklas Haas from FFmpeg for their work supporting this effort.\nThe post Enhancing HDR on Instagram for iOS With Dolby Vision appeared first on Engineering at Meta.",
        "dc:creator": "",
        "content": "<p>We’re sharing how we’ve enabled Dolby Vision and ambient viewing environment (amve) on the Instagram iOS app to enhance the video viewing experience. HDR videos created on iPhones contain unique Dolby Vision and amve metadata that we needed to support end-to-end Instagram for iOS is now the first Meta app to support Dolby Vision video, [...]</p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https://engineering.fb.com/2025/11/17/ios/enhancing-hdr-on-instagram-for-ios-with-dolby-vision/\">Read More...</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://engineering.fb.com/2025/11/17/ios/enhancing-hdr-on-instagram-for-ios-with-dolby-vision/\">Enhancing HDR on Instagram for iOS With Dolby Vision</a> appeared first on <a rel=\"nofollow\" href=\"https://engineering.fb.com\">Engineering at Meta</a>.</p>\n",
        "contentSnippet": "We’re sharing how we’ve enabled Dolby Vision and ambient viewing environment (amve) on the Instagram iOS app to enhance the video viewing experience. HDR videos created on iPhones contain unique Dolby Vision and amve metadata that we needed to support end-to-end Instagram for iOS is now the first Meta app to support Dolby Vision video, [...]\nRead More...\nThe post Enhancing HDR on Instagram for iOS With Dolby Vision appeared first on Engineering at Meta.",
        "guid": "https://engineering.fb.com/?p=23294",
        "categories": [
          "iOS",
          "Video Engineering",
          "Instagram"
        ],
        "isoDate": "2025-11-17T17:30:25.000Z"
      }
    ]
  },
  {
    "name": "eBay Tech Blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Twitter Blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "JetBrains: Developer Tools for Professionals and Teams – Company Blog | JetBrains",
    "category": "기업",
    "posts": [
      {
        "creator": "Andrey Belyaev",
        "title": "Spring Boot 4: Leaner, Safer Apps and a New Kotlin Baseline",
        "link": "https://blog.jetbrains.com/idea/2025/11/spring-boot-4/",
        "pubDate": "Thu, 20 Nov 2025 20:11:35 +0000",
        "content:encodedSnippet": "Spring Boot 4.0 has officially landed. At JetBrains, we’ve been tracking the updates since the first milestones to ensure that IntelliJ IDEA delivers a smooth and reliable development experience.\nWhile many of the core capabilities come directly from Spring Framework 7, Spring Boot remains the adoption enabler that brings everything together: sensible defaults, consistent configuration, unified starters, and the familiar lightning-fast productivity when creating applications.\nAs the most popular framework in the Java world, Spring Boot also helps developers move from older JDK versions to newer ones that offer better performance, more efficient garbage collectors, and modern language features.\nThis major Spring Boot release introduces cleaner modularization to reduce memory usage, improved observability with Micrometer, JSpecify as the standard null-safety library, and many other small improvements that streamline daily development.\nFor JetBrains, the biggest news in Spring Boot 4 is that Kotlin 2.2 is now the official baseline version for the framework. This milestone is the result of a long-standing collaboration between the JetBrains Kotlin team and the Spring Framework team.\nLet’s take a closer look at Spring Boot 4’s new features through the lens of Kotlin 2.2. \nNullability\nThe Kotlin compiler and IntelliJ IDEA now support JSpecify annotations natively. You will receive a compiler warning if you use JSpecify-annotated Java code incorrectly. In addition, IntelliJ IDEA will warn you if you try to assign a Java variable annotated with @Nullable to a non-nullable variable in Kotlin, and vice versa. \nFor example, for the Java interface:\n@NullMarked\n\npublic interface QuoteProvider {\n\n    Quote findQuote(String text);\n\n}\nA Kotlin implementation must return a non-nullable Quote object from the overridden findQuote() method:\n\n\n\n\nYou’ll see the following error message:\n\n\n\n\nIntelliJ IDEA detects the issue and suggests changing the return type to non-nullable. JSpecify is now the default library for nullability checks across all Spring projects. This means that when you create a Spring Boot 4 project in Kotlin, you can be sure that the framework types that you use are null-aware. \nAPI versioning\nAPI versioning in Kotlin works much the same way as in Java. Thanks to Spring’s well-designed API versioning mechanism, adding a version takes only a few lines of configuration and a single annotation attribute. In Kotlin, the versioned API looks just as straightforward:\n@RestController\n\n@RequestMapping(\"/api\", produces = [MediaType.APPLICATION_JSON_VALUE])\n\nclass QuoteController(private val klient: QuoteKlient) {\n\n    @GetMapping(\"quote\", version = \"1.0\")\n\n    fun fetchRandomQuote(): ResponseEntity<Quote> = \nResponseEntity.ok(klient.fetchRandomQuote())\n\n    @GetMapping(\"quote\", version = \"2.0\")\n\n    fun fetchRandomQuotes(): ResponseEntity<List<Quote>> = \nResponseEntity.ok(klient.fetchRandomQuotes())\n\n}\nThere’s nothing fancy here, just the usual Kotlin conciseness, with IntelliJ IDEA inspections helping you configure and validate version formats. \nBean registration\nBean registration is one of the areas where Kotlin truly shines. Thanks to its expressiveness and extensibility, it provides a powerful DSL for registering beans dynamically when the regular @ConditionalOn… annotation family is insufficient.\nFor example, instead of the following Java code:\npublic class QuoteProviderRegistrar implements BeanRegistrar {\n    @Override\n\n    public void register(BeanRegistry registry, Environment env) {\n\n        registry.registerBean(\"quoteProviderDb\", QuoteProviderDb.class);\n\n        registry.registerBean(\"quoteProviderFallback\",\n\n                QuoteProviderFallback.class,\n\n                spec -> {\n\n                    spec.fallback();\n\n                    spec.order(1);\n\n                }\n\n        );\n\n    }\n\n}\nYou can write a more elegant version without all the .class calls and lambda boilerplate:\nclass KuoteProviderRegistrar : BeanRegistrarDsl({\n\n    registerBean<QuoteProviderDb>(\"quoteProviderDb\")\n\n    registerBean<QuoteProviderFallback>(\n\n        name = \"quoteProviderFallback\",\n\n        fallback = true,\n\n        order = 1\n\n    )\n\n})\nMuch cleaner, right? \nConclusion\nSpring Boot is the most popular framework for Java development – and for good reason. With Spring Boot 4 establishing Kotlin 2.2 as the baseline and offering first-class support, we expect to see even broader Kotlin adoption among backend developers who want to use the latest language features. \nYou can try Spring Boot 4 in the 2025.3 Beta release or wait for the stable version, which is expected in early December.\nAt JetBrains, we continue to work closely with the Spring Framework team to ensure Kotlin remains well-integrated and fully supported in the Spring ecosystem.",
        "dc:creator": "Andrey Belyaev",
        "content": "Spring Boot 4.0 has officially landed. At JetBrains, we’ve been tracking the updates since the first milestones to ensure that IntelliJ IDEA delivers a smooth and reliable development experience. While many of the core capabilities come directly from Spring Framework 7, Spring Boot remains the adoption enabler that brings everything together: sensible defaults, consistent configuration, [&#8230;]",
        "contentSnippet": "Spring Boot 4.0 has officially landed. At JetBrains, we’ve been tracking the updates since the first milestones to ensure that IntelliJ IDEA delivers a smooth and reliable development experience. While many of the core capabilities come directly from Spring Framework 7, Spring Boot remains the adoption enabler that brings everything together: sensible defaults, consistent configuration, […]",
        "guid": "https://blog.jetbrains.com/?post_type=idea&p=660362",
        "categories": [
          "news",
          "spring-boot",
          "spring-boot-4"
        ],
        "isoDate": "2025-11-20T20:11:35.000Z"
      },
      {
        "creator": "Julia Shashkova",
        "title": "IntelliJ IDEA 2025.2.5 Is Out!",
        "link": "https://blog.jetbrains.com/idea/2025/11/intellij-idea-2025-2-5/",
        "pubDate": "Thu, 20 Nov 2025 19:45:59 +0000",
        "content:encodedSnippet": "We’ve just released IntelliJ IDEA 2025.2.5.\nYou can update to this version from inside the IDE, using the Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our website.\nHere are the most notable updates:\nThe IDE now correctly processes API calls when the Docker Engine is updated to v29. [IJPL-217878]\nGradle 9.x projects with a Spring Boot now run as expected using the Gradle Runner. [IDEA-379009]\nResolved an issue where the IDE could hang when scanning HTTP request files containing certain JSON structures. [IJPL-212853]\nThe GitLab plugin now correctly handles large pipeline IDs. [IJPL-217571]\nTo find out more details about the issues resolved, please refer to the release notes.\nIf you encounter any bugs, please report them to our issue tracker.\nHappy developing!",
        "dc:creator": "Julia Shashkova",
        "content": "We’ve just released IntelliJ IDEA 2025.2.5. You can update to this version from inside the IDE, using the Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our website. Here are the most notable updates: To find out more details about the issues resolved, please refer to [&#8230;]",
        "contentSnippet": "We’ve just released IntelliJ IDEA 2025.2.5. You can update to this version from inside the IDE, using the Toolbox App, or using snaps if you are a Ubuntu user. You can also download it from our website. Here are the most notable updates: To find out more details about the issues resolved, please refer to […]",
        "guid": "https://blog.jetbrains.com/?post_type=idea&p=660635",
        "categories": [
          "releases",
          "bug-fix-update",
          "intellij-idea",
          "intellij-idea-2025-2"
        ],
        "isoDate": "2025-11-20T19:45:59.000Z"
      },
      {
        "creator": "Sasha Ivanova",
        "title": "More Updates and Fixes for ReSharper and Rider 2025.3",
        "link": "https://blog.jetbrains.com/dotnet/2025/11/20/resharper-rider-2025-3-0-2/",
        "pubDate": "Thu, 20 Nov 2025 16:04:23 +0000",
        "content:encodedSnippet": "A second set of updates and bug fixes for the 2025.3 release of ReSharper and Rider has just been made public. \nLet’s take a look at what’s been improved.\nReSharper 2025.3.0.2 \nVisual Studio 2026 no longer displays the warning that ReSharper uses the deprecated IQuickInfoBroker API. [RSRP-502236]\nFixed an issue where MSTest v4 tests were duplicated in the Unit Test Explorer. [RSRP-502145]\nAutomatic import of missing namespaces now works correctly again. [RSRP-502252] \nWe’ve fixed false positive analysis warnings for get-only setters in .NET projects. [RSRP-502278]\nExternal services for grammar, spelling, and SQL analysis now start correctly when multiple Visual Studio instances are open simultaneously. [RSRP-502249]\nIcons for context actions and inspection configuration are now visually distinct again in the Alt + Enter menu. [RSRP-502012]\nThe license agreement dialog for language dictionaries now displays correctly when the Windows dark theme is used. [RSRP-502248] \nFixed a crash caused by a stack overflow in C# code analysis when resolving overloaded operators. [RSRP-502244]\nFor the full list of issues resolved in this build, please refer to our issue tracker.\nDownload ReSharper 2025.3.0.2\n                                                    \nRider 2025.3.0.2 \nAuthentication for private Azure DevOps NuGet feeds now works correctly again. [RIDER-132336]\nRider now correctly uses the user’s installed .NET SDK instead of its own bundled one when compiling projects. [RIDER-131155]\nAutomatic import of missing namespaces now works correctly again. [RSRP-502252] \nWe’ve fixed false positive analysis warnings for get-only setters in .NET projects. [RSRP-502278]\nFixed a crash caused by a stack overflow in C# code analysis when resolving overloaded operators. [RSRP-502244]\nErrors caused by missing or incomplete results from source generators have been resolved. Projects using .NET source generators or libraries like Vogen now load and analyze correctly without showing false red code. [RIDER-132269]\nQuick-fixes that rely on Roslyn analyzers now work correctly with the Microsoft.CodeAnalysis.CodeStyle package. [RIDER-132263]\nWe’ve also resolved a couple of issues that used to cause long freezes. [RIDER-132136, RIDER-130284]\nFor the full list of issues we’ve resolved in this build, please refer to our issue tracker.\nDownload Rider 2025.3.0.2",
        "dc:creator": "Sasha Ivanova",
        "content": "A second set of updates and bug fixes for the 2025.3 release of&#160;ReSharper&#160;and&#160;Rider&#160;has just been made public.&#160; Let’s take a look at what’s been improved. ReSharper 2025.3.0.2&#160; For the full list of issues resolved in this build, please refer to our issue tracker. Rider 2025.3.0.2 For the full list of issues we’ve resolved in this [&#8230;]",
        "contentSnippet": "A second set of updates and bug fixes for the 2025.3 release of ReSharper and Rider has just been made public.  Let’s take a look at what’s been improved. ReSharper 2025.3.0.2  For the full list of issues resolved in this build, please refer to our issue tracker. Rider 2025.3.0.2 For the full list of issues we’ve resolved in this […]",
        "guid": "https://blog.jetbrains.com/?post_type=dotnet&p=660447",
        "categories": [
          "net-tools",
          "resharper",
          "rider",
          "junie"
        ],
        "isoDate": "2025-11-20T16:04:23.000Z"
      },
      {
        "creator": "Regina Muradova",
        "title": "Learn AI-Assisted Programming With Junie: Free Courses From JetBrains Academy and Nebius",
        "link": "https://blog.jetbrains.com/education/2025/11/20/learn-ai-assisted-programming-with-junie-free-courses-from-jetbrains-academy-and-nebius/",
        "pubDate": "Thu, 20 Nov 2025 12:09:26 +0000",
        "content:encodedSnippet": "For over 25 years, JetBrains has been driven by a desire to make developers more productive and enhance the developer experience by providing smarter, more efficient tools. JetBrains Academy advances this mission by empowering learners to study computer science and gain hands-on experience with the professional tools they’ll use in their future careers.\nAI is becoming a standard in software development. At JetBrains, we design AI to empower developers. Take Junie, our smart coding agent, for example. It’s a reliable collaborator that fits into developers’ IDE and adapts to their workflow to support the way they build and enhance the full development experience. \nTogether with our partner Nebius, an AI cloud platform known for its expertise in high-performance and AI-first workloads, we’re distilling this expertise into a course series demonstrating how to work with AI effectively.\nSTART FOR FREE\n                                                    \nThis course series on AI-assisted programming includes two free courses focused on Junie, each exploring a different side of AI-assisted programming:\nCoding With Junie – a practical course where you’ll build and test projects directly inside JetBrains IDEs.\nAI Agents as Your Team – a deeper look into how AI agents work and how to collaborate with them in real-life projects.\n\n\n\n\n\nWe’re not just teaching developers how to use new tools, we’re helping them understand how AI fits into their everyday work, so they can stay creative, confident, and in control.\nCourse #1: Coding With Junie\nBuild, test, and debug with AI in JetBrains IDEs\nIn our new free Coding With Junie course, you’ll explore how to work with the AI coding agent inside JetBrains IDEs. You’ll install Junie, explore its built-in tools, and complete hands-on tasks that show how AI can help you build, test, and maintain real projects.\nSTART FOR FREE\n                                                    \nWhat you’ll learn\nBuild your first real project with Junie. Install Junie in your IDE, and use it to build your own project from scratch. See how it generates and runs code step by step.\nEffective prompting. Learn how to write prompts that get better results. Build an AI-powered web app that analyzes food images using Nebius vision models and discover how context improves accuracy.\nPlan and document features. Guide AI with advanced planning: set project guidelines, break feature design down into smaller steps with Ask mode, and generate documentation to improve performance and consistency.\nDebug, test, and automate with AI. Use Junie for debugging and creating tests. You’ll see how AI can simplify testing and maintenance while keeping you in control of your code.\nEach chapter includes short videos, examples, and practical exercises that focus on real development workflows.\n\n\n\n\nCourse #2: AI Agents as Your Team\nUnderstand how AI agents actually work and how to collaborate with them\nIf you’ve explored Coding With Junie, you’ve already seen how AI can empower you directly inside your IDE. The next step is to understand what’s happening behind the scenes.AI Agents as Your Team explores how agents actually work, how they make decisions, and how you can use them safely and effectively.\nGET STARTED\n                                                    \nWhat you’ll learn\nHow AI agents are built. Understand the architecture behind LLM-powered agents and how they operate under the hood.\nHow to increase productivity. Apply practical playbooks to achieve significant gains with today’s agent technologies.\nHow to navigate risks. Identify and mitigate challenges like bias, hallucination, or poor observability.\nHow to stay ahead. Build confidence as AI agents evolve and integrate more deeply into modern stacks.\n\n\n\n\nContinue learning with our AI-Assisted Programming series\nThese are just two of the courses in the 10-part free AI-Assisted Programming series, created by JetBrains Academy and Nebius Academy. Together, these courses help you understand how AI enhances every stage of software development – from coding and refactoring to DevOps and automation.\nThe full program includes:\n10 courses on AI coding and DevOps\n25 hands-on tasks\n1 capstone project\nAround 20 hours of self-paced learning\n\n\n\n\nWho is it for?\nThis course series is ideal for:\nSoftware developers looking to future-proof their skills and explore the practical side of AI.\nJunior engineers who want to learn how to build with AI tools.\nTeam leads and managers seeking ways to safely and effectively introduce AI into their development workflows.\nAll you need to get started is a junior-level understanding of any programming language.\nGET STARTED\n                                                    \nHappy learning!\nJetBrains Academy team",
        "dc:creator": "Regina Muradova",
        "content": "For over 25 years, JetBrains has been driven by a desire to make developers more productive and enhance the developer experience by providing smarter, more efficient tools. JetBrains Academy advances this mission by empowering learners to study computer science and gain hands-on experience with the professional tools they’ll use in their future careers. AI is [&#8230;]",
        "contentSnippet": "For over 25 years, JetBrains has been driven by a desire to make developers more productive and enhance the developer experience by providing smarter, more efficient tools. JetBrains Academy advances this mission by empowering learners to study computer science and gain hands-on experience with the professional tools they’ll use in their future careers. AI is […]",
        "guid": "https://blog.jetbrains.com/?post_type=education&p=660502",
        "categories": [
          "ai-assistant",
          "coding",
          "education",
          "jetbrains-academy",
          "learning-courses",
          "news",
          "ai-agents",
          "ai-code-completion",
          "ai-assisted-programming",
          "junie",
          "online-learning"
        ],
        "isoDate": "2025-11-20T12:09:26.000Z"
      },
      {
        "creator": "Anna Maltseva",
        "title": "Gemini 3 Pro Is Now Available in JetBrains IDEs",
        "link": "https://blog.jetbrains.com/ai/2025/11/gemini-3-pro-is-now-available-in-jetbrains-ides/",
        "pubDate": "Tue, 18 Nov 2025 16:12:47 +0000",
        "content:encodedSnippet": "The latest AI model from Google, Gemini 3 Pro, is now live in JetBrains IDEs. From day one, it powers AI Chat and Junie, our coding agent, giving you smarter reasoning, stronger instruction following, and seamless integration into your workflow.\n\n\n\n\n\n\nWhat’s new\nGemini 3 Pro shows clear improvements that matter in day-to-day development:\nUnderstands your codebase and adapts to your style. Gemini 3 Pro learns from your code to replicate your project’s conventions, so changes feel native to your repository and pass review with fewer edits.\nFollows instructions precisely. Built to reason across text, code, and visuals, Gemini 3 Pro understands complex prompts and long documents and delivers more accurate results.\nExcels at frontend development. Gemini 3 Pro shows major progress in multimodal frontend generation and complex UI work.\nOverall, it’s strong at planning and executing multi-step tasks, handling complex instructions, and reasoning across multiple contexts – helping you move from idea to production-ready code faster.\nSee Gemini 3 Pro and Junie in action\nTo demonstrate how Gemini 3 Pro and Junie handle real creative workflows, we built a full landing page experience starting from nothing but a sketch. We uploaded the sketch, provided a detailed prompt, and let Gemini 3 Pro interpret the structure, layout, and visual hierarchy.\nUsing these instructions, Junie, our coding agent, generated the first functional version of the landing page. The output included a clean layout, responsive sections, and components directly inferred from the sketch.\nNext, we asked Gemini 3 Pro and Junie to refine the page and “make it fancy”, transforming the rough structure into a polished, interactive design inspired by modern AI product websites like Adaline.ai. The agent applied animations, smooth transitions, and an elevated visual style while keeping the original structure intact. This clearly shows Gemini 3 Pro’s strong multimodal understanding and Junie’s ability to turn raw ideas into production-ready interfaces. See the result below:\n\n\n\n\nHow to try Gemini 3 Pro in your IDE\nTo access Gemini 3 Pro, you’ll need an active JetBrains AI subscription. If you don’t have one, you can start a free trial directly from your IDE – open the JetBrains AI widget in your IDE, start the installation, and follow the on-screen instructions. Once activated, you can try it in:\nAI Chat: Simply start a new chat – the model is set to Auto.\nJunie: Open Junie’s settings (Settings | Junie | Models) and choose Gemini 3 Pro. (Make sure you have the latest version of the Junie plugin installed.)\n\n\n\n\nGive it a try and let us know what you think in the comments!",
        "dc:creator": "Anna Maltseva",
        "content": "The latest AI model from Google, Gemini 3 Pro, is now live in JetBrains IDEs. From day one, it powers AI Chat and Junie, our coding agent, giving you smarter reasoning, stronger instruction following, and seamless integration into your workflow. What’s new Gemini 3 Pro shows clear improvements that matter in day-to-day development: Overall, it’s [&#8230;]",
        "contentSnippet": "The latest AI model from Google, Gemini 3 Pro, is now live in JetBrains IDEs. From day one, it powers AI Chat and Junie, our coding agent, giving you smarter reasoning, stronger instruction following, and seamless integration into your workflow. What’s new Gemini 3 Pro shows clear improvements that matter in day-to-day development: Overall, it’s […]",
        "guid": "https://blog.jetbrains.com/?post_type=ai&p=659908",
        "categories": [
          "news",
          "ai-in-ides",
          "gemini"
        ],
        "isoDate": "2025-11-18T16:12:47.000Z"
      },
      {
        "creator": "Vaclav Pech",
        "title": "The Second Release of MPS 2025.3 Early Access Program",
        "link": "https://blog.jetbrains.com/mps/2025/11/the-mps-2025-3-eap2/",
        "pubDate": "Tue, 18 Nov 2025 15:45:59 +0000",
        "content:encodedSnippet": "Starting today, you can download the second EAP release for MPS 2025.3 and try all the latest updates.\nDOWNLOAD MPS 2025.3 EAP 2\nThis release includes several noteworthy improvements:\nJavaDoc language overhaul\nThe JavaDoc language has been completely migrated to use the jetbrains.mps.lang.text language for text representation and editing. This change should have minimal impact on the overall user experience. However, it fixes numerous problems:\nThe editing experience is now consistent with other MPS languages that use jetbrains.mps.lang.text, such as BaseLanguage comments or structure language documentation. Find more information about editing text on the documentation facet page.\nText can be copied and pasted between JavaDoc, BaseLanguage comments, language documentation comments, and other places where jetbrains.mps.lang.text is used. Copy/pasting a piece of plain text also works.\nText can now include styling like bold or italics. This styling gets generated as HTML tags in the resulting Java source files.\nAlong the way, several problems associated with the JavaDoc language have been resolved:\nThe description for block tags was changed to use jetbrains.mps.lang.text instead of string properties, so the same edit/copy/paste/style functionality is available inside block tags.\nBlock tags now support multiple lines of description.\nBoth block tags and inline tags are now correctly parsed from Java sources.\nA new {@literal …} inline tag was added as mandated by the Java language specification.\nCode inside CodeSnippet correctly resolves local variables.\nNodeWrapper correctly textgens the contained nodes.\n\nPaste as JavaDoc action available in BaseLanguage\nIn addition to the existing Paste as Java Statement and Paste as Class Content actions, the redesigned JavaDoc language supports a new action that enables easy pasting of textual JavaDoc code into BaseLanguage. Most importantly, this new action ensures that your JavaDoc code is properly parsed into JavaDoc text lines, block tags, and inline tags, including potential reference resolutions (e.g. for the @param or {@link } tags).\n\nThis new Paste as JavaDoc action parses the text from the clipboard and pastes it into a JavaDoc comment at the current position of the cursor. If the cursor is not positioned within an existing JavaDoc comment, the action attaches the parsed JavaDoc elements to the following field/method/class definition’s JavaDoc, creating a new JavaDoc file for them, if needed.\n\nContributions to generator plans\nWe’ve made some major improvements to generator plans, enhancing the user’s experience with complex model transformations. A new notion of PlanContribution supersedes and completely replaces the experimental fork as functionality that we introduced back in 2024.1.\ntargetFacet (see jetbrains.mps.generator.extensions.common model), which tells <mps.make> which GenerationTargetFacet/ModuleFacet to consult when determining an appropriate output location for a model.\n\nConditional forks with generator plans\nBoth the fork step and a PlanContribution in a generator plan support conditional activation. It’s now possible to activate certain branches of a plan only when certain criteria are met. At the moment, MPS comes with a conditional statement that checks the values of specified plan parameters. We intend to eventually extend statements to support logical operations (and/or), as well as other potential operations, while maintaining a strict interpretation of generator plans (i.e. no BaseLanguage code in plans).\nParameterDeclaration classes. Values for these parameters can be contributed using a PlanParameterContributor extension point. MPS comes with a few predefined parameters that are usable straight out of the box – see the jetbrains.mps.generator.extensions.common model for full details of these.\n\nUsing keyboard shortcuts in the Project view\nThe process of creating new elements in the Logical pane of the Project view using keyboard shortcuts has been significantly improved. New modules, models, and nodes can now be introduced without the use of a mouse.\nYou can also check out the blog post announcing the previous 2025.3 EAP 1 version to find out more about the improvements brought to you by that release.\nYou can find the full list of issues we’ve fixed here.\nYour JetBrains MPS team",
        "dc:creator": "Vaclav Pech",
        "content": "Starting today, you can download the second EAP release for MPS 2025.3 and try all the latest updates. DOWNLOAD MPS 2025.3 EAP 2 This release includes several noteworthy improvements: JavaDoc language overhaul The JavaDoc language has been completely migrated to use the jetbrains.mps.lang.text language for text representation and editing. This change should have minimal impact [&#8230;]",
        "contentSnippet": "Starting today, you can download the second EAP release for MPS 2025.3 and try all the latest updates. DOWNLOAD MPS 2025.3 EAP 2 This release includes several noteworthy improvements: JavaDoc language overhaul The JavaDoc language has been completely migrated to use the jetbrains.mps.lang.text language for text representation and editing. This change should have minimal impact […]",
        "guid": "https://blog.jetbrains.com/?post_type=mps&p=658766",
        "categories": [
          "releases",
          "eap",
          "release"
        ],
        "isoDate": "2025-11-18T15:45:59.000Z"
      },
      {
        "creator": "Alyona Chernyaeva",
        "title": "Helping Decision‑Makers Say Yes to Kotlin",
        "link": "https://blog.jetbrains.com/kotlin/2025/11/helping-decision-makers-say-yes-to-kotlin/",
        "pubDate": "Tue, 18 Nov 2025 12:11:19 +0000",
        "content:encodedSnippet": "Guest post by Urs Peter, Senior Software Engineer and JetBrains-certified Kotlin Trainer. For readers who’d like a more structured way to build Kotlin skills, Urs also leads the Kotlin Upskill Program at Xebia Academy.\nThis is the fourth post in The Ultimate Guide to Successfully Adopting Kotlin in a Java-Dominated Environment, a series that follows how Kotlin adoption grows among real teams, from a single developer’s curiosity to company-wide transformation.\nAll parts in the series:\nGetting Started With Kotlin for Java Developers\nEvaluating Kotlin in Real Projects\nGrowing Kotlin Adoption in Your Company\nPersuading Management: Building the Business Case for Kotlin\nOnce you have achieved a critical mass of Kotlin supporters, presenting a compelling business case to management requires moving beyond code demonstrations to hard data and strategic considerations.\nMarket momentum and industry validation\nKotlin has demonstrated remarkable growth, with 2.5 million developers worldwide now using the language. This represents sustained adoption since Google’s pivotal 2017 announcement declaring Kotlin the official language for Android development, followed by Spring Boot’s embrace of Kotlin as a first-class citizen.\nSource: Keynote KotlinConf 2025\nThe momentum has accelerated significantly. Spring Boot, which commands approximately 90% of the backend market share, formalized a strategic partnership with JetBrains in 2025 – a clear signal of Kotlin’s enterprise viability and long-term trajectory.\nFraming the strategic decision\nWhile these adoption metrics demonstrate Kotlin’s market validation, management decisions require a comprehensive cost-benefit analysis. Technology adoption at scale involves significant investments in training, tooling, and potential migration efforts. The key is presenting both the tangible benefits and realistic implementation costs, allowing leadership to make an informed strategic decision rather than a purely technical one.\nThe business gains unlocked by embracing Kotlin\nThese are the business gains when choosing Kotlin:\n\nAdvantageDetailsBusiness/Team impact\n~30% less code. Better code clarity.~30% less to write, read, fix, and maintain.➜ Increased productivity.\n➜ Improved maintainability.\n25% fewer bugs thanks to safety featuresKotlin reduces defects out of the box – no extra skills required – through features like null safety, safe APIs, and sensible defaults.➜ Better quality – happier customers and developers.\n➜ More time for new features.\n➜ Faster time-to-market.\nInvest in just one new language: KotlinKeep existing frameworks (e.g. SpringBoot, Micronaut, Quarkus).➜ Framework knowledge is preserved.\nBetter choice for AIKotlin is more AI-friendly due to noise reduction, clarity, fluency, and more, which aligns with how LLMs process code.➜ Better productivity with AI, which is increasingly influencing coding.\nFully interoperable with JavaKotlin is fully interoperable with Java; no rewrite of libraries required.➜ Investments based on Java are preserved.\nWell supportedBacked by strong players: JetBrains, Google, and Meta.➜ Future-proof choice.\nGradual adoptionKotlin supports incremental migration paths.➜ No “Big Bang” needed.\nIncrease in developer happinessIn surveys and studies, Kotlin developers consistently report better developer experience and higher job satisfaction.➜ Attract new developers.\n➜ Better retention 😃😃😃.\nFaster audit, safer complianceKotlin’s type safety, immutability, and clear data structures make systems easier to trace, validate, and certify. These qualities support transparent and reliable software processes across regulated domains. For a real-world example, see Kotlin in Payment Gateways and Fintech: A Strategic Fit for 2026 Architectures.➜ Easier internal and external audits.  \n➜ Lower compliance effort and risk. \n➜ Greater organizational transparency.\n\n\n\n\n\nSome words on developer happiness\nLooking at my career, I was greatly rewarded for letting go of my attachment to the seemingly safe career choice of Java. Daily, I’m empowered with a language that is a joy to work with and helps me express what I want to achieve in the best possible way, concisely, safely, and productively. \nIt’s a fact that, personally, I’ve become a happier developer (human ;-)?) using Kotlin. Though this is subjective, developer satisfaction data tells the same unmistakable story:\nBackend developers who migrate from Java to Kotlin report dramatically higher happiness levels across every major industry survey. \nStack Overflow’s Developer Survey data shows Kotlin consistently ranking among the top five most loved languages at ~63% satisfaction, significantly outpacing Java’s ~54% rating.\nThe Mercedes-Benz.io backend team documented “significantly more concise code than Java, reducing boilerplate and improving readability” while achieving measurable productivity gains in their microservices architecture.\nTyler Russell, a backend developer with 15 years of Java experience, reports after four years with Kotlin: “I really like Kotlin… it feels like it enables productivity significantly more than it hinders it”, and never wants to return to Java.\nCorporate Kotlin to Java backend migrations demonstrate that these happiness improvements scale effectively across enterprise environments. \nN26’s backend engineering team converted 60% of their microservices to Kotlin within two years, reporting enhanced developer satisfaction and reduced production issues.\nING’s five-year backend adoption journey shows sustained organic growth, with 8% of their 20,000+ technical staff repositories now using Kotlin, demonstrating that developers voluntarily choose Kotlin when given the option.\nThe cost / return on investment of embracing Kotlin:\nThese are the investments required for choosing Kotlin. \n\nInvestment DescriptionExpected Return / Impact\nDeveloper trainingTraining sessions, workshops, and onboarding materials.➜ Experienced developers new to Kotlin are productive in 2–3 weeks.\n➜ ROI in ~1–4 months.\nCodebase migration (if applicable)A gradual rewrite or a mixed Kotlin/Java code setup strategy is required.➜ No need for big bang rewrite\n➜ Maintains delivery speed.\nKnowledge sharingInternal Kotlin champions, brown bag sessions, shared repos with examples.➜ Faster team-wide adoption.\n➜ Reuse of best practices.\nHiring / upskillingHire Kotlin-experienced devs or upskill existing Java devs.➜ Higher retention.\n➜ Broader talent pool.\n\n\n\n\n\nOne of the most common concerns when considering Kotlin adoption is the perceived shortage of experienced Kotlin developers. But rather than a roadblock, this can be a strategic advantage:\n✅ Fast upskilling for Java developers\nKotlin is designed to be intuitive for Java developers. With the right guidance, most can become productive in just 2–3 weeks.\n✅ Kotlin attracts high-quality developers\nThose who actively pursue Kotlin are often curious, modern, and quality-driven – traits you want in your engineering team.\n✅ Kotlin enhances your company image\nAdopting Kotlin signals that you embrace modern, forward-looking technology, which helps attract top-tier talent.\n✅ Kotlin boosts developer happiness and retention\nKotlin developers consistently report higher job satisfaction, making it easier to retain engaged and motivated team members.\nIn short: Kotlin isn’t just a smart tech choice – it’s a strategic people decision.\nUp next in the series\nWe shift focus from convincing developers to persuading decision-makers. The next post shows how to build a compelling business case for Kotlin adoption, grounded in real data and measurable outcomes. You’ll learn how to translate developer wins into management arguments, link productivity gains to cost savings, and demonstrate why Kotlin is more than a technical upgrade – it’s a strategic move for teams and companies alike.\nUrs Peter\nUrs is a seasoned software engineer, solution architect, conference speaker, and trainer with over 20 years of experience in building resilient, scalable, and mission-critical systems, mostly involving Kotlin and Scala.\nBesides his job as a consultant, he is also a passionate trainer and author of a great variety of courses ranging from language courses for Kotlin and Scala to architectural trainings such as Microservices and Event-Driven Architectures.\nAs a people person by nature, he loves to share knowledge and inspire and get inspired by peers on meetups and conferences. Urs is a JetBrains certified Kotlin trainer.",
        "dc:creator": "Alyona Chernyaeva",
        "content": "Guest post by Urs Peter, Senior Software Engineer and JetBrains-certified Kotlin Trainer. For readers who’d like a more structured way to build Kotlin skills, Urs also leads the&#160;Kotlin Upskill Program at Xebia Academy. This is the fourth post in The Ultimate Guide to Successfully Adopting Kotlin in a Java-Dominated Environment, a series that follows how [&#8230;]",
        "contentSnippet": "Guest post by Urs Peter, Senior Software Engineer and JetBrains-certified Kotlin Trainer. For readers who’d like a more structured way to build Kotlin skills, Urs also leads the Kotlin Upskill Program at Xebia Academy. This is the fourth post in The Ultimate Guide to Successfully Adopting Kotlin in a Java-Dominated Environment, a series that follows how […]",
        "guid": "https://blog.jetbrains.com/?post_type=kotlin&p=655947",
        "isoDate": "2025-11-18T12:11:19.000Z"
      },
      {
        "creator": "Lena Morozova",
        "title": "Open Source in Focus: Projects We’re Proud to Support",
        "link": "https://blog.jetbrains.com/blog/2025/11/18/open-source-in-focus-projects-we-re-proud-to-support/",
        "pubDate": "Tue, 18 Nov 2025 12:07:29 +0000",
        "content:encodedSnippet": "At JetBrains, we love seeing the developer community grow and thrive. That’s why we support open-source projects that make a real difference — the ones that help developers learn, build, and create better software together. We’re proud to back open-source maintainers with free licenses and to contribute to initiatives that strengthen the ecosystem and the people behind it.\nIn this post, we highlight five open‑source projects from different ecosystems, written in established languages like Python and JavaScript or fast‑growing ones like Rust. Different as they are, each shares the same goal: elevating the developer experience. Together, they show how the right tools boost productivity and make workflows more enjoyable.\nRatatui\nBorn as the community-driven successor to the discontinued tui-rs library, Ratatui brings elegance to terminal UIs. It’s modular, ergonomic, and designed to help developers build interactive dashboards, widgets, and even embedded interfaces that go beyond the terminal.\nJetBrains IDEs help me focus on the code rather than the tooling. They’re self-contained, so I don’t need to configure much to get started – they just work. With powerful code highlighting, automatic fixes, refactorings, and structural search, I can easily jump around the codebase and make edits.\n— Orhun Parmaksız, Ratatui Core Maintainer\nThe upcoming 0.30.0 release focuses on modularity, splitting the main crate into smaller, independently usable packages. This change simplifies maintenance and makes it easier to use widgets in other contexts. And with new no_std support, Ratatui is expanding to power a wide range of use cases beyond the terminal.\nDjango\nIf Ratatui brings usability to the terminal, Django brings it to the web. Originally created in 2003 to meet both fast-paced newsroom deadlines and the demands of experienced developers, Django remains the go-to framework for “perfectionists with deadlines”. It eliminates repetitive tasks, enforces clean, pragmatic design, and provides built-in solutions for security, scalability, and database management – helping developers write less code and achieve more.\nJetBrains IDEs, especially PyCharm, boost productivity with built-in Django support – including project templates, automatic settings detection, and model-to-database migrations – as well as integrated debugging and testing tools that simplify finding and fixing issues. The version control integration also makes it easier for contributors to refine and polish their work.\n— Sarah Boyce, Django Fellow\nBacked by a thriving global community, Django’s roadmap includes composite primary key support, built-in CSP integration, and a focus on making Django accessible by default. Every eight-month release delivers incremental improvements while maintaining backward compatibility – clear proof that long-term stability and innovation can coexist.\nJHipster\nBoth Django and JHipster help developers move fast, but they take different paths. JHipster began as the “anti-mullet stack” – serious in the back, party in the front – created to help developers quickly bootstrap full-stack applications with Spring on the backend and Angular.js on the frontend. Today, it’s still one of the most comprehensive open-source generators, offering a complete full-stack solution with built-in security, performance, and best practices.\nJHipster has always been about great productivity and great tooling, so naturally, we’ve always been IntelliJ IDEA fans – we even have our own JHipster IntelliJ IDEA plugin! What I love most is the clean UI, the performance, and all the plugins that make my life so much easier. I use Maven and Docker support all the time, and they’re both absolutely top-notch.\n— Julien Dubois, JHipster Creator\nThe project is now split into two teams – JHipster Classic, which focuses on the original full-stack generator written in JavaScript, and JHipster Lite, which develops a modernized, DDD-oriented version written in Java and targeted primarily at the backend. This structure allows the community to experiment more freely and attract new contributors.\nAs AI-assisted generation evolves, JHipster’s mission remains the same: empowering developers with the latest cutting-edge technology and a true full-stack approach.\nBiome\nOnce the structure is in place, consistency becomes the next challenge. That’s where Biome, a modern, all-in-one toolchain for maintaining web projects, comes in. It supports every major web language and maintains a consistent experience between the CLI and the editor. The goal of its creators was simple: make a tool that can handle everything from development to production, with fewer dependencies, less setup time, faster CI runs, and clear, helpful diagnostics.\nI’m a long-term user of JetBrains IDEs! RustRover has greatly improved since launch – its debugging features and new JavaScript module mean I can maintain all Biome projects, even our Astro-based website, in a single IDE. It’s great that JetBrains really listens to users and their feedback.\n— Emanuele Stoppa, Biome Creator\nBiome’s roadmap includes adding Markdown support, type inference, .d.ts file generation, JSDoc support, and embedded-language support. As a community-led project, Biome welcomes contributions of all kinds – every bit of help makes a difference.\nVuestic UI\nWhen it’s time to polish the frontend, Vuestic UI takes over. This open-source project focuses on accessibility, theming, and a delightful developer experience. Built for Vue 3, it offers a flexible, easy-to-use component library that scales effortlessly from quick prototypes to enterprise-grade dashboards.\nThe right development environment makes a huge difference when building complex open-source tools like Vuestic UI and Vuestic Admin. Our team relies on JetBrains IDEs every day for their best-in-class refactoring tools that let us make bold changes with confidence, fast and reliable code navigation, and rock-solid performance. Most of what we need works right out of the box – no extra plugins or setup required. For us, JetBrains isn’t just a preference – it’s a productivity multiplier.\n— Maxim Kobetz, Senior Vue.js Developer\nAfter 12 years in frontend development, WebStorm – along with IntelliJ IDEA and PyCharm – has always been my trusted toolkit. Even now, when I’m not coding every day, I know I can rely on WebStorm for quick tweaks – every update feels smooth and never disrupts my workflow. It’s intuitive, beautiful, and just works the way I expect it to. I know switching IDEs is always a time sink, but with JetBrains, it’s absolutely worth it – you’ll never want to switch again.\n— Anastasiia Zvenigorodskaia, Community Manager at Vuestic UI & Viuestic Admin\nThese projects showcase a common truth: Great developer experience happens when tools get out of your way. With JetBrains IDEs enhancing everything from code navigation to collaboration, these teams turn ideas into usable, elegant tools.\nExplore these projects, contribute if you can, or start your own! RustRover, WebStorm, and PyCharm are free for open-source development and ready to help you code, collaborate, and contribute.\nDownload RustRover\n                                                                Download WebStorm\n                                                                Download PyCharm",
        "dc:creator": "Lena Morozova",
        "content": "At JetBrains, we love seeing the developer community grow and thrive. That’s why we support open-source projects that make a real difference — the ones that help developers learn, build, and create better software together. We’re proud to back open-source maintainers with free licenses and to contribute to initiatives that strengthen the ecosystem and the [&#8230;]",
        "contentSnippet": "At JetBrains, we love seeing the developer community grow and thrive. That’s why we support open-source projects that make a real difference — the ones that help developers learn, build, and create better software together. We’re proud to back open-source maintainers with free licenses and to contribute to initiatives that strengthen the ecosystem and the […]",
        "guid": "https://blog.jetbrains.com/?post_type=blog&p=659334",
        "categories": [
          "community",
          "rustrover",
          "community-support",
          "intellij-idea",
          "open-source-program",
          "oss-projects",
          "pycharm",
          "webstorm"
        ],
        "isoDate": "2025-11-18T12:07:29.000Z"
      },
      {
        "creator": "Rachel Appel",
        "title": "Database Features in Rider",
        "link": "https://blog.jetbrains.com/dotnet/2025/11/17/database-features-in-rider/",
        "pubDate": "Mon, 17 Nov 2025 14:08:01 +0000",
        "content:encodedSnippet": "Rider provides robust support for working with databases directly within the IDE – powered by DataGrip! Rider and DataGrip smooth development workflows by allowing you to manage and interact with a variety of database systems. This integration enhances productivity for developers who frequently work with data. \nDatabase projects and connectivity\nThere has long been support for connecting and working with databases in development projects in Rider. But what if you want to work with data and just data? Rider now supports Database Projects (.sqlproj). Just use the File -> New Solution | Database to open the New Solution dialog. Choose Database and from here you can customize which database environment you want to initially target. You can add other database environments to the project after creation.\n\n\n\n\nOnce Rider creates the project, the familiar Solution tool window displays an empty solution including a node for viewing and creating SQLCMD variables.\n\n\n\n\nYou can connect to a database in a database project just the same as you would in any other type of project. Use the Databases tool window to make a connection to the database of your choosing. All the industry favorites are there – PostgreSQL, MySQL, SQL Server, Oracle, SQLite, and many more. And let’s not forget NoSQL! Rider has wide support for NoSQL, including MongoDB, Apache Cassandra, Redis, DocumentDB, Couchbase Query, and others. Connect to as many as needed for your scenario.\n\n\n\n\nOnce connected, you can manage and create database objects visually or using SQL.\nManage database objects\nRider enables you to manage database objects through its intuitive interface. Developers can visually create, alter, and delete tables, views, stored procedures, and other schema elements by using the Database tool window. \n\n\n\n\nCreate and run SQL scripts\nIf you prefer, you can write the SQL yourself, or even use our built-in AI Assistant to create queries. In the query editor, you can enjoy features like code completion, syntax highlighting, and immediate feedback on schema changes. This visual approach, coupled with the ability to execute SQL scripts directly, streamlines the process of maintaining and evolving database schemas.\n\n\n\n\nConclusion\nJetBrains Rider’s integrated database tools provide a comprehensive environment for developers to interact with and manage various database systems. By enabling database operations into the IDE, Rider significantly enhances productivity and simplifies the development and debugging of data-driven applications. Download your copy of Rider today!",
        "dc:creator": "Rachel Appel",
        "content": "Rider provides robust support for working with databases directly within the IDE &#8211; powered by DataGrip! Rider and DataGrip smooth development workflows by allowing you to manage and interact with a variety of database systems. This integration enhances productivity for developers who frequently work with data.&#160; Database projects and connectivity There has long been support [&#8230;]",
        "contentSnippet": "Rider provides robust support for working with databases directly within the IDE – powered by DataGrip! Rider and DataGrip smooth development workflows by allowing you to manage and interact with a variety of database systems. This integration enhances productivity for developers who frequently work with data.  Database projects and connectivity There has long been support […]",
        "guid": "https://blog.jetbrains.com/?post_type=dotnet&p=653393",
        "categories": [
          "net-tools",
          "data",
          "database",
          "nosql",
          "rider",
          "sql"
        ],
        "isoDate": "2025-11-17T14:08:01.000Z"
      },
      {
        "creator": "Clara Maine",
        "title": "How to Prepare for the Future of Programming",
        "link": "https://blog.jetbrains.com/education/2025/11/17/how-to-prepare-for-the-future-of-programming/",
        "pubDate": "Mon, 17 Nov 2025 11:17:09 +0000",
        "content:encodedSnippet": "Start a start-up? Scratch that. Call your mom. Go back to school? Don’t go back to school. Learn to code? Don’t learn to code. Forget coding. Only prompt engineering matters now. Actually, I heard it’s overrated. You think we’re gonna be prompting in 5 years? 2 years? Nonsense. All this hype is being blown so out of proportion. Have some healthy skepticism. Have a lot of healthy skepticism. Doubt. Believe. Move to the woods. Bury your laptop in the back yard. Get bored. Dig it up again. Coding is back, baby! Start another course, work on it for a few days. Lose motivation. Panic. Repeat.\nYou’re not alone. As a writer, I’m also panicking. Why read this when you could ask the same question to your LLM of choice and have a lively discussion perfectly tuned to be as broad or technical, long or short, playful or serious, as you want it to be? This thought has tormented me for days and this post remained a blank document. The only thing that saved me was remembering why I made this series in the first place.\n\n\n\n\nI wanted to create a resource for learners to better understand programming within the context of our new AI world. I made a case for why it’s still worth learning to code, explored the psychology of beginner programmers, and discussed whether you should use AI at all. So, now what? \nWe know that programming will change – that programming has changed. But how exactly? And how much? What knowledge can we be sure will remain fundamental? What should we learn to prepare for the worlds to come?\nThere are a variety of answers depending on where you as the answerer stand. Is your net worth positively correlated with AI hype? Is your job too complicated, social, or important for AI? How is your relationship with risk? How do you feel about change? What do you believe about what the future needs? \n\n\n\n\nThese are not questions anyone can answer for you. Not me, not a tech CEO, not your mom, and certainly not a chatbot. We live in a world with platforms and educational institutions jumping to answer “What can I learn?” (a small reminder to check out our catalog of free courses), but there are very few resources that will give good answers to questions like “What should I learn?”, “Can you really justify why?”, and “Can you promise me it will remain useful?”.\nI can’t guarantee that anything you learn will remain useful in the years to come, but I am certain that learning will. On that subject, here are a few short recommendations on how to prepare for the future of programming.\nUnderstand the flaws of your education\nAre you in a large institution that is slow to adapt? Is AI use being discussed openly or banned from the classroom? Are you self-studying at your own pace, but lack any network of peers or mentors? Is your education giving you a broad overview of a field (a Bachelor’s degree) or is it leading you toward specialization and a specific job (bootcamp/internship)? \nBoth of these approaches are useful, they’re just working on different timelines. A broad overview can give you more options when the field changes, while a specialization can help you in the short term. Either way, try to compensate in the direction of your weaknesses so you’re not left either overqualified and underemployed, or unemployable when your only skill becomes redundant.\n\n\n\n\n📚 An exercise: Take 10 to 20 minutes to reflect on your education from a zoomed-out perspective. Think about what it did or is doing well and what gaps you might be left with at the end of it. Below you’ll find a few recommendations on how to fill those gaps, but feel free to brainstorm your own as well.\nHow to broaden your knowledge\nIf you’ve got practical skills but worry about their shelf life, now is the time to foster curiosity about the wider scope of your field. This will feel different than learning a practical skill, since there are fewer concrete ways to assess your progress. Instead, pay attention to the moments when ideas from different domains click together. This is a sign that you’re starting to expand your general knowledge and get a clearer view of the big picture.\nHere are some practical ways to do this:\n🧑‍🎓 Follow short courses in other domains. Our knowledge map can help you visualize what subjects you might find interesting to explore, or you can even consider departing from computing altogether. Bringing technical expertise to a writing course might lead to great science fiction, or an interesting exercise in applied philosophy.\n🧰 Work on projects that use a broad skillset but don’t require professional excellence. Make a silly app that needs a little bit of frontend, a little bit of backend, knowledge of APIs, and even graphic design. It might be ugly and inefficient, the point is that you did it.\n\nSince motivation might be difficult to maintain on your own, find someone with a different skillset and swap roles.\n👯 If you consider yourself a “technical person”, focus especially on communication skills and critical thinking. These are particularly important in navigating the uncertain future we’re facing, since purely technical jobs are in many ways the easiest to automate away.\nHow to deepen your knowledge\nPersonally, I find it really hard to specialize. I jump between interests, rarely sticking with anything long enough to achieve mastery. This used to stress me out – how could I be good at my job if I couldn’t commit to one thing? But I’ve learned that the pressure to specialize is often about legibility, not capability. We like people who are easy to categorize. In practice, though, proficiency in one skill lends itself to an easier time with others.\nDepth is what makes you adaptable. Surface-level knowledge can get outdated quickly. Understanding underlying principles like how systems actually work, not just how to use them, means you can transfer what you know to new tools and frameworks. When the landscape shifts, you’re not starting from scratch.\n\n\n\n\nYou’ll have to choose your approach depending on the specific skill you want to master. Here’s how to do this:\n🧑‍🏫 Get advice from someone who’s done it before, ideally someone who can personally mentor you. To get started, there are plenty of “Things I wish I’d known before becoming x” videos, which might help you wade through what’s necessary and what’s not. \n💻 Regarding coding, our specializations courses provide very comprehensive and practical assignments in various domains.\n💯 If you, like me, quickly lose interest once the novelty wears off, I can recommend tailoring your media diet toward your target subject. Reading books and listening to stories of people talking about your subject on a high level helps you remember what sparked your interest in the first place. To start, you could check out our video essay on the history of Git!\nGoodbye, AI world\nYou don’t need to understand tech to do things with it anymore. Now you can build apps, write code, or generate designs without understanding the underlying systems. There’s real value in that accessibility, but as a writer and coder, I worry about what we lose. If we go all-in on doing things, we might forget that developing deep knowledge and understanding can be fun and good for us. It might even be a requirement for our mental health and self-esteem. To not only be able to make an app, but to take pride in the fact that you learned how to.\nGet a free student license\n                                                                Explore our course catalog\n                                    \nThis is the fourth and final post in our series How to Learn to Program in an AI World. If you missed it, check out the previous posts, Is It Still Worth Learning to Code?, Learning to Think in an AI World: 5 Lessons for Novice Programmers, and Should You use AI to Learn to Code?\nClara Maine is a technical content creator for JetBrains Academy. She has a formal background in Artificial Intelligence but finds herself most comfortable exploring its overlaps with education, philosophy, and creativity. She writes, produces, and performs videos about learning to code on the JetBrains Academy YouTube channel.",
        "dc:creator": "Clara Maine",
        "content": "Start a start-up? Scratch that. Call your mom. Go back to school? Don’t go back to school. Learn to code? Don’t learn to code. Forget coding. Only prompt engineering matters now. Actually, I heard it’s overrated. You think we’re gonna be prompting in 5 years? 2 years? Nonsense. All this hype is being blown so [&#8230;]",
        "contentSnippet": "Start a start-up? Scratch that. Call your mom. Go back to school? Don’t go back to school. Learn to code? Don’t learn to code. Forget coding. Only prompt engineering matters now. Actually, I heard it’s overrated. You think we’re gonna be prompting in 5 years? 2 years? Nonsense. All this hype is being blown so […]",
        "guid": "https://blog.jetbrains.com/?post_type=education&p=659255",
        "categories": [
          "jetbrains-academy",
          "ai",
          "ai-assistance",
          "ai-code-completion",
          "ai-assisted-programming",
          "career",
          "developers",
          "education",
          "for-learners",
          "jetbrains-research",
          "jetbrainsacademy-2",
          "learn",
          "learn-programming"
        ],
        "isoDate": "2025-11-17T11:17:09.000Z"
      },
      {
        "creator": "Kerry Beetge",
        "title": "Mark Your Calendars! Qodana Events in November",
        "link": "https://blog.jetbrains.com/qodana/2025/11/mark-your-calendars-qodana-events-in-november/",
        "pubDate": "Mon, 17 Nov 2025 10:29:46 +0000",
        "content:encodedSnippet": "As 2025 starts racing to a close, the JetBrains Qodana team is ending the year with a series of events dedicated to what matters most in modern software development: secure workflows, high-quality code, and practical tooling that empowers developers to ship with confidence.\nWhether you’re working in security engineering, backend development, DevOps, or AI-powered applications, these sessions will give you concrete techniques to strengthen your engineering practices going into 2026.\nHere’s what’s coming up:\nGrigorii Liullin on JRush Episode 6\n\n\n\n\nGrigorii Luillin, Security Tooling Team Lead at JetBrains – 18 November 2025\nCatch Grigorii Liullin episode 6 of JRush, where he walks through how developers can integrate security directly into their IDE and uncover issues long before they reach production.\nHe explores shift-left approaches designed for real developer workflows, including:\n• Detecting security flaws through taint analysis, inspections, and pattern matching\n• Identifying vulnerable and malicious dependencies\n• Applying security tooling to Java, Kotlin, and their major frameworks\n• Reducing noisy CVEs and making IDE-integrated security practical day to day\nThis session is ideal for developers and security engineers who want hands-on guidance and workflow-level improvements.\nClick the button below to find out who else will be there and exactly what to expect.\nCheck Out JRush Ep.6\nQodana livestream: The Modern Enterprise Toolkit for Secure, High-Quality Code\n\n\n\n\nNovember 19, 2025\nJoin Product Specialist Kai Schmithuesen for a live walkthrough of Qodana’s newest capabilities and the practices modern enterprises are using to build secure, resilient codebases.\nIn this session, you’ll learn how to:\n• Integrate Qodana into your end-to-end DevOps ecosystem\n• Detect vulnerabilities, license issues, and compliance risks early\n• Use Native Mode for fast, scalable code analysis without external dependencies\n• Deploy Qodana Self-Hosted Lite for teams needing privacy, control, and performance\n• Onboard developers securely with enhanced SSO and access control\n• Leverage our new Insights dashboard for organization-wide visibility\n• Bring Qodana reporting into agile workflows for sprint-ready transparency\n• Reduce technical debt and strengthen governance at scale\nThis session will be facilitated by Alex Costa, and attendees can look forward to spot prizes throughout the livestream.\nRegister for the Livestream\nCode Nomads & JetBrains Meetup in Utrecht\n\n\n\n\nNovember 26, 2025\nTractieweg 41n, Utrecht\nJoin the Code Nomads community and JetBrains for an evening focused on AI applications for Java developers.\nRadmir Baembitov from JetBrains will present how to use automated checks to ensure the safety and quality of AI-generated code. After a short break, Benja Jansen from Code Nomads Utrecht will cover practical AI integrations for Java development.\nAgenda\n17:30 Walk-in\n18:00 Food\n18:30 Talk 1 by Radmir Baembitov\n19:30 Break\n19:45 Talk 2 by Benja Jansen\n20:45 Drinks\nRSVP for an evening of learning, connection, and practical insights. \nJoin CodeNomads Meetup\nLooking ahead\nWhether you join us in a livestream, at a meetup, or in JRush, each of these sessions is designed to help you embed quality and security into your development process. We’re excited to connect with the community, answer your questions, and share what the team has been building throughout the year.\nLet’s finish 2025 strong – and set up 2026 for even better engineering.",
        "dc:creator": "Kerry Beetge",
        "content": "As 2025 starts racing to a close, the JetBrains Qodana team is ending the year with a series of events dedicated to what matters most in modern software development: secure workflows, high-quality code, and practical tooling that empowers developers to ship with confidence. Whether you&#8217;re working in security engineering, backend development, DevOps, or AI-powered applications, [&#8230;]",
        "contentSnippet": "As 2025 starts racing to a close, the JetBrains Qodana team is ending the year with a series of events dedicated to what matters most in modern software development: secure workflows, high-quality code, and practical tooling that empowers developers to ship with confidence. Whether you’re working in security engineering, backend development, DevOps, or AI-powered applications, […]",
        "guid": "https://blog.jetbrains.com/?post_type=qodana&p=659570",
        "categories": [
          "events",
          "codesecurity",
          "intellij-idea",
          "qodana",
          "webinars"
        ],
        "isoDate": "2025-11-17T10:29:46.000Z"
      },
      {
        "creator": "Damian Bogunowicz",
        "title": "Why Diffusion Models Could Change Developer Workflows in 2026",
        "link": "https://blog.jetbrains.com/ai/2025/11/why-diffusion-models-could-change-developer-workflows-in-2026/",
        "pubDate": "Mon, 17 Nov 2025 07:23:13 +0000",
        "content:encodedSnippet": "Developers spend much of their time editing, refactoring, and debugging rather than producing entirely new code. Code creation tends to involve non-sequential back-and-forth refinement rather than typing out a complete function in one uninterrupted sequence. You might sketch a part, adjust parameters, skip ahead, then revisit earlier sections to refine them. \nDiffusion models, and in particular diffusion large language models (d-LLMs), operate differently from current coding assistants. Unlike autoregressive models, which generate token by token in a strict left-to-right sequence, d-LLMs condition on both past and future context. This enables them to model edits and refinements more directly, reflecting how developers iteratively construct and adjust code. As shown by Gong et al. (2025): “the [d-LLM] model often plans token generation more globally, much like a programmer jumping back and forth through code to refine a code implementation.” This matches the reality of code authorship, which is non-linear: you sketch a bit, revise earlier parts, jump ahead, and keep iterating.\nOut-of-order generation feels more human\nOne of the most striking demos of diffusion-based models like DiffuCoder showed exactly this: the model skipped a parameter mid-function, continued writing later parts, then circled back to fill in what was missing.\n\n\n\n\n(The prompt used here is: “Write a Python function to implement binary search together with docstrings and type hints.” The example is generated using the apple/DiffuCoder-7B-Instruct model, configured to produce one token per forward pass with a limit of 256 new tokens. The blue slots illustrate positions that the model later revisits and refines during the diffusion process.)\nThis structure may mirror how many developers think. You may not know every detail upfront, but you can scaffold a function and refine as you go. A model that generates in a sequential way is better suited to support this process.\nBi-directional context improves reasoning\nAutoregressive models can be prompted to consider bidirectional context by providing both prefix and suffix in the prompt, but this remains a workaround rather than a native capability. Diffusion models, particularly diffusion large language models (d-LLMs), are designed from the ground up to condition on both past and future context during generation.\nThis design proves valuable for tasks requiring reversal reasoning, where coherence must hold in both directions, and for code generation, where a variable’s usage downstream should inform its earlier definition. As shown by Nie at al. (2025), d-LLMs exhibit “consistent zero-shot performance across both forward and reversal tasks.”\nFor developers, this translates into improved handling of structured logic, long-range dependencies, and code constraints that depend on order-sensitive relationships.\nFlexibility in editing and refactoring\nBecause diffusion models mask and unmask tokens gradually at any random position, they are naturally suited to infilling. If you ask a diffusion model to rewrite a block of code with a different parameter or to refactor a loop into a comprehension, it can directly operate on masked sections. \nThe distinction with autoregressive LLMs is subtle here, since both require the relevant code region to appear in the prompt. Where diffusion models add value is in integration with deterministic tooling such as IDEs. An IDE could highlight several problematic or incomplete regions, mask them, and allow the diffusion model to unmask and regenerate all affected parts in a single coherent pass. This distinguishes diffusion models from FIM-enabled autoregressive models, which can handle isolated infilling but struggle to maintain global consistency across multiple edits.\nExample: coordinated multi-region updates\nConsider adding a field to a class that must be initialised in the constructor, used in a method, and serialised elsewhere. Rather than orchestrating multiple FIM calls or regenerating entire methods, a diffusion model can mask the relevant locations and generate all necessary updates at once. \nThis makes diffusion models well-suited to refactoring tasks where changes must satisfy global constraints, such as ensuring a new parameter appears consistently in a function signature, its documentation, call sites, and test cases.\nFor example, an IDE might flag a type mismatch in a function signature. Instead of regenerating the entire function, a diffusion model could unmask just the problematic parameter declaration and rewrite it to match the expected type, leaving the rest of the code untouched. This localised editing process mirrors how developers typically fix errors and refactor code incrementally.\nPotential speed improvements\nAutoregressive models operate sequentially, generating one token per forward pass. Diffusion models, by contrast, can produce multiple tokens in a single forward pass. Benchmarks reveal a current practical shortcoming: increasing the number of tokens per step often reduces quality. The underlying mechanism, however, allows faster inference and is likely to improve in future.\nResearchers have proposed semi-autoregressive approaches to bridge the gap between autoregressive and diffusion-based generation – most notably Block Diffusion – Arriola et al. (2025). This method generates blocks of tokens from left to right while allowing diffusion models to unmask flexibly within each block. In principle, this allows reuse of the KV cache, which plays a key role in the efficiency of autoregressive models. In practice, however, unmasking too many tokens in parallel creates a trade-off. Throughput increases, but quality often drops sharply, especially if the KV cache is not reused carefully.\nSemi-autoregressive generation represents an intermediate step between autoregressive and truly out-of-order inference. Diffusion-based language models work fundamentally out of sequence, yet current methods still borrow ideas from autoregressive design, such as KV cache reuse, because the optimisation tools for autoregressive generation remain highly developed and effective. Ironically, these mature autoregressive mechanisms improve generation speed even as research moves towards models that can generate fully out of order.\nCurrent limitations\nFor now, developers should temper expectations. Our internal experimentations with latest open-source models show that:\nThe best quality comes when unmasking one token per step, which slows things down and makes these models not differ much from AR models in practice.\nDiffusion models can repeat prefixes or suffixes, or even output incoherent text when pushed too far.\n\nRepetition: model re-outputs entire prefix blocks multiple times.\ndef factorial(n):\n    if n == 0:\n        return 1\n    else:\n        return n * factorial(n - 1)\n\ndef factorial(n):   # repeated\n    if n == 0:\n        return 1\n    else:\n        return n * factorial(n - 1)\n\ndef factorial(n):   # repeated again\n    if n == 0:\n        return 1\n    else:\n        return n * factorial(n - 1)\nEarly termination: incomplete function bodies or truncated expressions.\n\n\n\n\n\ndef factorial(n):\n    if n == 0:\n        return 1\n    else:\n        return n * factorial(   # truncated, no argument\nMalformed syntax: unmatched brackets, dangling commas, or gibberish tokens.\ndef factorial(n):\n    if (n == 0:\n        return 1,\n    else:\n        return n ** factorial[n - 1))\nBenchmarking current state-of-the-art d-LLMs – open source (DiffuCoder, Seed-Diffusion) and closed-source (Mercury, Gemini-Diffusion) – shows mixed performance when compared against strong autoregressive baselines such as Qwen2.5-Coder. See Gong et al. (2025) and Song, Yuxuan et al. (2025).\nDespite these issues, diffusion models still introduce valuable new possibilities for code generation and editing. At the same time, their ecosystem is very immature compared to autoregressive LLMs. \nTraining and inference techniques that help mitigate sequential bottlenecks in LLMs, such as chunked prefill, speculative decoding, or prefix caching, have no direct equivalents yet for diffusion models. \nDiffusion also requires defining output length in advance, which often leads to inefficiency compared to the <eos> termination signal in LLMs. \nFinally, the open-source diffusion models for code makes it harder for developers to experiment and refine these methods.\nWhere they can be useful today\nCode completion with context editing – filling in missing parts of a function rather than only extending text.\nRefactoring support – restructuring code blocks where order is less rigid.\nStructured text tasks – mathematical reasoning or reversal problems where bi-directional context matters.\n\n\n\n\nThese niches give developers a reason to experiment, even if production-ready tools remain a little way off. Beyond these early applications, the major promise of d-LLMs lies in their potential for much faster generation, since they can produce N tokens per forward pass rather than one. \nThis capability could eventually reshape performance expectations for coding assistants once the quality–efficiency trade-offs are better understood.\nLooking ahead\nDiffusion models won’t replace autoregressive models overnight. But they represent a new paradigm that better reflects how developers think and work. Their ability to edit flexibly, consider context in both directions, and potentially accelerate inference sets them apart.\nFor developers, the practical benefit is clear: more snappy generation, and more support for the unstructured, iterative way you actually write code.\nAs research continues, diffusion models could become the backbone of coding assistants that feels less like next token generators and more like principled, code structure-aware, programming collaborators.",
        "dc:creator": "Damian Bogunowicz",
        "content": "Developers spend much of their time editing, refactoring, and debugging rather than producing entirely new code. Code creation tends to involve non-sequential back-and-forth refinement rather than typing out a complete function in one uninterrupted sequence. You might sketch a part, adjust parameters, skip ahead, then revisit earlier sections to refine them.&#160; Diffusion models, and in [&#8230;]",
        "contentSnippet": "Developers spend much of their time editing, refactoring, and debugging rather than producing entirely new code. Code creation tends to involve non-sequential back-and-forth refinement rather than typing out a complete function in one uninterrupted sequence. You might sketch a part, adjust parameters, skip ahead, then revisit earlier sections to refine them.  Diffusion models, and in […]",
        "guid": "https://blog.jetbrains.com/?post_type=ai&p=659223",
        "categories": [
          "coding",
          "plugin-development",
          "jetbrains-ai",
          "research",
          "ai",
          "python"
        ],
        "isoDate": "2025-11-17T07:23:13.000Z"
      }
    ]
  },
  {
    "name": "Visual Studio Blog",
    "category": "기업",
    "posts": [
      {
        "creator": "Jason Chlus",
        "title": "Spend Less Time Upgrading, More Time Coding in Visual Studio 2026",
        "link": "https://devblogs.microsoft.com/visualstudio/spend-less-time-upgrading-more-time-coding-in-visual-studio-2026/",
        "pubDate": "Tue, 18 Nov 2025 17:00:27 +0000",
        "content:encodedSnippet": "In the past, moving to the next major version of Visual Studio could take hours, sometimes days, to recreate your dev environment the way you like it. Visual Studio 2026 makes it easier than ever to stay current with the latest productivity features, performance improvements, and security fixes all without disrupting your flow. With the new Visual Studio install experience, you can effortlessly recreate your previous Visual Studio 2022 environment. Your workloads, SDKs, toolsets, extensions and settings are automatically copied and configured, so everything you need to build and continue developing your project is ready the moment you open Visual Studio 2026.\nWith support for multiple toolsets and SDK versions, Visual Studio 2026 lets you update the IDE independently from your project dependencies. Keep your environment modern and secure, while maintaining full compatibility with your existing builds.\nInstall Visual Studio 2026 from the installer Available tab or download the bootstrapper.\n\nThe new install experience\nThe new Visual Studio Installer is built to make upgrading seamless. It detects your existing Visual Studio 2022 setup and can rebuild it in Visual Studio 2026, including workloads, toolsets, SDKs, extensions, and settings. You’ll spend less time setting up and more time writing code.\nIf you’re setting up on a new machine, simply import your .vsconfig file (which captures your favorite workloads, toolsets, SDKs and extensions) and pair it with your .vssettings file to recreate your previous Visual Studio environment exactly the way you like it.\n\nSetup Assistant (in-IDE dependency acquisition)\nWhen you load a project in Visual Studio 2026, the new Setup Assistant automatically detects the dependencies your project targets. With support for multiple toolsets and SDKs, you can quickly retarget your project to the latest version, or, if needed, install any specific missing dependencies with just a few clicks.\nFor C++ developers – the Setup Assistant identifies MSVC Build Tools and Windows SDKs your project targets. You can retarget your project to the latest version or install any missing components with a single click directly in the Visual Studio Installer.\n\nFor more details check out the C++ blog post: Blog Post – Upgrading Your Projects.docx\nFor .NET developers (based on your feedback) – If your project uses a pinned global.json, Setup Assistant provides a link matching the pinned .NET SDK, for quick installation in your browser.\n\nGitHub Copilot app modernization now built into Visual Studio\nThe GitHub Copilot app modernization agent is an AI-powered tool in Visual Studio that helps you upgrade your projects to newer versions and migrate them to Azure. It automatically detects outdated dependencies and target frameworks, provides guided recommendations, and makes real-time code changes, so you can modernize your code without interruptions. Migrating to Azure unlocks scalability, security, and operational efficiency for your projects.\nHow to get started:\nOpen your project or solution in Visual Studio, then launch the Modernization Agent by right-clicking your project or solution and selecting Modernize, or type @modernize in Copilot Chat with your upgrade or migration request.\nWhen new SDKs or toolsets become available, you can easily retarget your entire solution or specific projects with the Setup Assistant. Simply reopen this tab via Project > Retarget solution, or right click your solution/project and select Retarget solution. This makes it simple to modernize projects.\nSee live examples\nC++ modernization by Michael Price\n.NET modernization video by Brady Gaster and Cathy Sulivan\nVisual Studio is shipping faster\nVisual Studio 2026 will get updates on the Stable channel every month, bringing new features, performance improvements, security and bug fixes to you faster than ever.\nInstall Visual Studio 2026 Stable\n\nVisual Studio Insiders will get updates even faster, helping us iterate with you in real time. With this new cadence and rapid iteration speed you’ll always have the latest.\nInstall Visual Studio Insiders\n\nAlways current with Visual Studio 2026\nTo make updating effortless, Visual Studio 2026 introduces Update on Close. When you finish your session, Visual Studio will download and install updates after you close the IDE, so you’ll always start your next session with the latest features, fixes, and improvements.\nThis is enabled by default for Community and Team Explorer and on the Insiders Channel. For Enterprise and Professional editions on the Stable Channel, you can turn it on by navigating to Tools > Options > Environment > More Settings > Product Updates and select the “Always update on close” checkbox.\n\nYou are always in control\nIf something doesn’t go as planned, Visual Studio 2026 keeps you in control:\nImproved repair detects and resolves incomplete installations automatically.\nA quick rollback returns you to your previous environment in minutes.\nSide-by-side installs let you keep Visual Studio 2022 and 2026 on the same machine.\nYou’re always in control, knowing your productivity and stability are protected. Visual Studio provides options to move forward or revert with minimal risk.\nWhen Should You Upgrade?\nThe best time is now. Visual Studio 2026 is our most performant, reliable, and productive IDE yet with the easiest upgrade experience we’ve ever delivered.\nGet faster installs, monthly feature updates, smarter dependency management, and an environment built to keep you focused on writing great code, not maintaining your setup.\nTry Visual Studio 2026 today and see how seamless upgrading can be.\nInstall Visual Studio 2026 Stable from the Installer Available tab or download the bootstrapper.\nThe post Spend Less Time Upgrading, More Time Coding in Visual Studio 2026 appeared first on Visual Studio Blog.",
        "dc:creator": "Jason Chlus",
        "comments": "https://devblogs.microsoft.com/visualstudio/spend-less-time-upgrading-more-time-coding-in-visual-studio-2026/#comments",
        "content": "<p>In the past, moving to the next major version of Visual Studio could take hours, sometimes days, to recreate your dev environment the way you like it. Visual Studio 2026 makes it easier than ever to stay current with the latest productivity features, performance improvements, and security fixes all without disrupting your flow. With the [&#8230;]</p>\n<p>The post <a href=\"https://devblogs.microsoft.com/visualstudio/spend-less-time-upgrading-more-time-coding-in-visual-studio-2026/\">Spend Less Time Upgrading, More Time Coding in Visual Studio 2026</a> appeared first on <a href=\"https://devblogs.microsoft.com/visualstudio\">Visual Studio Blog</a>.</p>\n",
        "contentSnippet": "In the past, moving to the next major version of Visual Studio could take hours, sometimes days, to recreate your dev environment the way you like it. Visual Studio 2026 makes it easier than ever to stay current with the latest productivity features, performance improvements, and security fixes all without disrupting your flow. With the […]\nThe post Spend Less Time Upgrading, More Time Coding in Visual Studio 2026 appeared first on Visual Studio Blog.",
        "guid": "https://devblogs.microsoft.com/visualstudio/?p=254942",
        "categories": [
          "Copilot",
          "Installation and Updates",
          "Productivity",
          "Visual Studio",
          "Modernization",
          "Setup",
          "Updates",
          "Visual Studio 2026"
        ],
        "isoDate": "2025-11-18T17:00:27.000Z"
      }
    ]
  },
  {
    "name": "Joshua",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권재명",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김석기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김선영",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강대명",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권정혁",
    "category": "개인",
    "posts": []
  },
  {
    "name": "줌구",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김수보",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김시은",
    "category": "개인",
    "posts": []
  },
  {
    "name": "곽민수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민서",
    "category": "개인",
    "posts": []
  },
  {
    "name": "I am not Okay",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권창현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권기호",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김수민",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강태욱",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권용진",
    "category": "개인",
    "posts": [
      {
        "creator": "권용진",
        "title": "11/20 삼성전자 사내 강연 - 그래서 스테이블코인이 뭔데 저자 강연",
        "link": "https://brunch.co.kr/@@H9i/92",
        "pubDate": "Sun, 23 Nov 2025 19:20:50 GMT",
        "author": "권용진",
        "content": "감사하게도 국내 최고의 IT 기업인 삼성전자의 모바일 사업부에서 &lt;그래서 스테이블코인이 뭔데&gt;와 관련한 강연을 하게 되었습니다.  무려 200명 이상의 임직원 분들이 참여해주셨습니다. 사내 방송국에서 온라인 강연을 하였는데, 이렇게 많은 분들이 참여할줄 몰랐어서 당황하였습니다.     확실히 엔지니어분들과 테크 현업에 계신 분들이다보니 질문의 수준이 굉장하<img src= \"https://img1.daumcdn.net/thumb/R1280x0.fjpg/?fname=http%3A%2F%2Ft1.daumcdn.net%2Fbrunch%2Fservice%2Fuser%2FH9i%2Fimage%2FCm5FNwa7kicKwvRPFQNoIqMb2kE.HEIC\" width=\"500\" />",
        "contentSnippet": "감사하게도 국내 최고의 IT 기업인 삼성전자의 모바일 사업부에서 <그래서 스테이블코인이 뭔데>와 관련한 강연을 하게 되었습니다.  무려 200명 이상의 임직원 분들이 참여해주셨습니다. 사내 방송국에서 온라인 강연을 하였는데, 이렇게 많은 분들이 참여할줄 몰랐어서 당황하였습니다.     확실히 엔지니어분들과 테크 현업에 계신 분들이다보니 질문의 수준이 굉장하",
        "guid": "https://brunch.co.kr/@@H9i/92",
        "isoDate": "2025-11-23T19:20:50.000Z"
      }
    ]
  },
  {
    "name": "김민수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김승호",
    "category": "개인",
    "posts": []
  },
  {
    "name": "RSS feed for boyism Blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성준의 린스타트업과 디자인씽킹",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강동혁",
    "category": "개인",
    "posts": []
  },
  {
    "name": "고종범",
    "category": "개인",
    "posts": []
  },
  {
    "name": "cheese10yun",
    "category": "개인",
    "posts": []
  },
  {
    "name": "구자철",
    "category": "개인",
    "posts": []
  },
  {
    "name": "FSS",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권동준",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김용일",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김도균",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민석",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김동우",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권윤학",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민준",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김만수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "엘키",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권태환",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김슬기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김광현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성빈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강명훈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김민장",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성중",
    "category": "개인",
    "posts": []
  },
  {
    "name": "구교준",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김덕기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "고명환",
    "category": "개인",
    "posts": [
      {
        "creator": "고명환",
        "title": "테슬라 FSD v14 출시 임박, 자율주행의 새 시대",
        "link": "https://brunch.co.kr/@@LOc/315",
        "pubDate": "Fri, 21 Nov 2025 03:26:09 GMT",
        "author": "고명환",
        "content": "테슬라 FSD v14, 왜 중요한가? 테슬라가 곧 출시 할 테슬라 FSD v14는 단순한 업데이트를 넘어 자율주행 상용화의 분수령으로 평가받고 있습니다. 일론 머스크는 &nbsp;&quot;14.2 버전부터는 차양이 마치 감각을 가진 존재처럼 느껴질 것&quot; 이라고 강조했습니다. 이는 단순한 마케팅 문구가 아니라, 실제 AI모델의 성능이 이전 세대와 비교할 수 없을 만큼 향상되<img src= \"https://img1.daumcdn.net/thumb/R1280x0.fjpg/?fname=http%3A%2F%2Ft1.daumcdn.net%2Fbrunch%2Fservice%2Fuser%2FLOc%2Fimage%2FA4teChF_g3vNrWnvZr500twxupw\" width=\"500\" />",
        "contentSnippet": "테슬라 FSD v14, 왜 중요한가? 테슬라가 곧 출시 할 테슬라 FSD v14는 단순한 업데이트를 넘어 자율주행 상용화의 분수령으로 평가받고 있습니다. 일론 머스크는  \"14.2 버전부터는 차양이 마치 감각을 가진 존재처럼 느껴질 것\" 이라고 강조했습니다. 이는 단순한 마케팅 문구가 아니라, 실제 AI모델의 성능이 이전 세대와 비교할 수 없을 만큼 향상되",
        "guid": "https://brunch.co.kr/@@LOc/315",
        "isoDate": "2025-11-21T03:26:09.000Z"
      }
    ]
  },
  {
    "name": "강병수",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김봉현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강형석",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김수로",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강미경",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김성현",
    "category": "개인",
    "posts": []
  },
  {
    "name": "강진우",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권민재",
    "category": "개인",
    "posts": []
  },
  {
    "name": "권태관",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김도곤",
    "category": "개인",
    "posts": []
  },
  {
    "name": "칡토스의 게임 개발",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김선철",
    "category": "개인",
    "posts": []
  },
  {
    "name": "프리웨어 이야기",
    "category": "개인",
    "posts": [
      {
        "creator": "어떤오후의 프리웨어 이야기",
        "title": "코딩 없이 5분 만에 전문가급 웹사이트? AI 랜딩페이지 아키텍트가 답!",
        "link": "https://muzbox.tistory.com/483683",
        "pubDate": "Sun, 23 Nov 2025 21:19:50 +0900",
        "author": "어떤오후의 프리웨어 이야기",
        "comments": "https://muzbox.tistory.com/483683#entry483683comment",
        "content": "<div style=\"font-family: 'Noto Sans KR', sans-serif; line-height: 1.6; max-width: 800px; margin: 0 auto; font-size: 16px; box-sizing: border-box; color: #3c4043;\">\n<div style=\"background-color: #e8f4fd; padding: 15px; border-radius: 8px; font-style: italic; margin-bottom: 25px; font-size: 15px;\">\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">복잡한 웹사이트 기획부터 코딩, 배포까지 단 5분 만에 끝낼 수 있다면 어떠세요? 2025년, AI 기술의 발전은 더 이상 꿈이 아닙니다. 비개발자도 전문가급 랜딩페이지를 만들고 싶은 분들을 위해, AI 랜딩페이지 아키텍트가 어떻게 이 모든 과정을 혁신하는지 자세히 알아보겠습니다. 이제 여러분의 상상이 현실이 되는 시대가 도래했습니다.</p>\n</div>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>  왜 랜딩페이지가 필요할까요?</b></h2>\n<figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-filename=\"download.jpg\" data-origin-width=\"1200\" data-origin-height=\"1200\"><span data-url=\"https://blog.kakaocdn.net/dn/cgpuZL/dJMcaaX0Wip/xPXDGWdJOvh9NpUhSc1SkK/img.jpg\" data-phocus=\"https://blog.kakaocdn.net/dn/cgpuZL/dJMcaaX0Wip/xPXDGWdJOvh9NpUhSc1SkK/img.jpg\"><img src=\"https://blog.kakaocdn.net/dn/cgpuZL/dJMcaaX0Wip/xPXDGWdJOvh9NpUhSc1SkK/img.jpg\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FcgpuZL%2FdJMcaaX0Wip%2FxPXDGWdJOvh9NpUhSc1SkK%2Fimg.jpg\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" alt=\"코딩 없이 AI가 5분 만에 랜딩페이지를 만드는 미래형 웹 개발 환경.\" loading=\"lazy\" width=\"600\" height=\"600\" data-filename=\"download.jpg\" data-origin-width=\"1200\" data-origin-height=\"1200\"/></span></figure>\n\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">음, 생각해 보면 많은 분들이 거창한 웹 애플리케이션보다는 자신을 소개하거나 특정 서비스를 홍보할 수 있는 간단하면서도 전문적인 랜딩페이지 하나를 더 필요로 하시는 것 같아요. 특히 개발 취업을 준비 중인 분들이나, 개인 사업을 시작하려는 분들에게는 명함처럼 내밀 수 있는 포트폴리오 사이트나 회사 홍보 페이지가 정말 필수적이죠.</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">그런데 막상 만들려고 하면 어디서부터 시작해야 할지 막막할 때가 많습니다. 코딩 지식이 없어서 못 만드는 것보다, 사실은 <b>'어떤 내용을 담아야 할까?', '디자인은 어떻게 해야 촌스럽지 않을까?'</b> 같은 기획 단계에서부터 좌절하는 경우가 태반이에요. 저도 주변에서 그런 어려움을 자주 접하곤 했습니다.</p>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>  '랜딩페이지 메이커' 젬 지침의 탄생과 한계</b></h2>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">이런 문제를 해결하고자 제가 처음 시도했던 것이 바로 '랜딩페이지 메이커' 젬(GEM) 지침입니다. 이 지침은 AI에게 랜딩페이지 제작에 필요한 모든 단계를 아주 구체적으로 알려주는 매뉴얼이라고 할 수 있죠. 크게 세 부분으로 나뉩니다.</p>\n<ul style=\"list-style-type: disc; margin-left: 20px; margin-bottom: 20px; color: #3c4043;\" data-ke-list-type=\"disc\">\n<li style=\"margin-bottom: 10px;\"><b>Role (역할)</b>: AI에게 구글의 수석 UX/UI 디자이너이자 전문 카피라이터라는 정체성을 부여합니다. 단순히 구조만 설계하는 것을 넘어, 사용자의 심리를 꿰뚫는 매력적인 문구와 실제 개발 가능한 수준의 디테일한 기획력을 갖추도록 명시했죠.</li>\n<li style=\"margin-bottom: 10px;\"><b>Context (맥락)</b>: 최종 목표를 '메인 페이지와 4개의 서브 페이지가 완벽하게 연결된 고품질 웹사이트 제작'으로 설정하고, 웹사이트 주제, 타겟 고객, 핵심 목표를 입력받도록 했습니다.</li>\n<li style=\"margin-bottom: 10px;\"><b>Task &amp; Process (작업 절차)</b>: 이 부분이 핵심인데요. 총 3단계로 구성됩니다.\n<ul style=\"list-style-type: circle; margin-left: 20px; margin-top: 5px; color: #3c4043;\" data-ke-list-type=\"disc\">\n<li style=\"margin-bottom: 5px;\"><b>스텝 1. 브랜드 아이덴티티</b>: 사이트맵, Primary Color(Hex Code와 선택 이유), Typography, Mood Board(형용사 3가지)를 구체적으로 지시합니다.</li>\n<li style=\"margin-bottom: 5px;\"><b>스텝 2. 메인 페이지 상세 기획</b>: Hero Section (헤드라인, 서브 텍스트, CTA 버튼 2개), Problem &amp; Solution, Key Features 3개, Social Proof까지 실제 들어갈 문구를 모두 작성하도록 합니다.</li>\n<li style=\"margin-bottom: 5px;\"><b>스텝 3. 서브 페이지 4종</b>: 각 페이지의 제목, 목표, 헤더 카피, 핵심 바디 콘텐츠, CTA를 상세하게 작성하도록 지시합니다.</li>\n</ul>\n</li>\n</ul>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">이 젬 지침을 활용하면, '열린 입 치과 의원 홈페이지'처럼 간단한 입력만으로도 브랜드 아이덴티티부터 아주 구체적인 UX/UI 방법론이 포함된 랜딩페이지 생성 지침을 바로 받아볼 수 있었습니다. 심지어 이 기획안을 기반으로 실제 코드를 짜서 프로토타입을 미리 확인하는 것도 가능했죠.</p>\n<div style=\"background-color: #fce8e6; border-left: 4px solid #d93025; padding: 15px; margin: 20px 0; border-radius: 0 8px 8px 0;\">\n<p style=\"margin-bottom: 0; color: #3c4043;\" data-ke-size=\"size16\">⚠️ 하지만 젬 지침은 한 번 등록하면 제미나이에서 바로 사용 가능하고 응답도 빠르다는 장점이 있지만, 때로는 출력물의 내용이 많거나 복잡할 때 우리가 원하는 만큼 일관성 있는 결과를 제공하지 못하는 한계가 있었습니다. <br />*GEM지침원본은 본문 하단에 있습니다.</p>\n</div>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>  2025년의 해결책: AI 랜딩페이지 아키텍트</b></h2>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">이러한 한계를 극복하고 더 일관성 있고 강력한 결과물을 얻기 위해 앱으로 구현한 것이 바로 오늘 여러분께 소개해 드릴 <b>'AI 랜딩페이지 아키텍트'</b>입니다. 2025년 현재, 이 앱은 랜딩페이지 제작 과정을 완전히 새로운 차원으로 끌어올렸다고 자신 있게 말씀드릴 수 있어요. 이제 앱을 사용해 보는 과정을 함께 살펴보시죠.</p>\n<h3 style=\"font-size: 19px; color: #1a73e8; margin: 25px 0 10px; border-bottom: 2px solid #e8f0fe; padding-bottom: 5px;\" data-ke-size=\"size23\"><b>간편한 웹사이트 기획안 생성</b></h3>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">메인 화면에서 웹사이트 주제, 타겟 고객, 핵심 목표만 입력하면, AI가 이 정보를 바탕으로 랜딩페이지 기획안을 생성합니다. 만약 주제를 어떤 걸로 해야 할지 고민된다면, 우측 상단의 '주제 예시 선택' 버튼을 눌러보세요. 개인 홈페이지, 포트폴리오, 회사 홍보 페이지 등 자주 사용되는 20가지 유형이 미리 준비되어 있습니다.</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">예를 들어, 저는 '이력서/경력소개'를 선택하고 '20년 경력 공인중개사 박동산'이라고 입력해 보았습니다. 타겟 고객이나 핵심 목표 설정도 귀찮다면, 주제 입력칸 아래 '타겟과 목표 자동 완성' 버튼을 누르세요. AI가 주제를 분석해서 가장 적절한 타겟과 목표를 자동으로 채워줍니다. 물론, 이 내용은 언제든 자신의 상황에 맞게 수정할 수 있습니다.</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">모든 입력이 완료되면 '기획안 생성 시작' 버튼만 누르면 됩니다. 잠시만 기다리면 전문가가 작성한 듯한 기획안이 순식간에 나옵니다! 젬 지침에서 구현했던 브랜드 아이덴티티, 전체 구조 전략, 메인 및 서브페이지 기획, 심지어 폴더 구조와 기타 가이드까지 랜딩페이지 기획안의 모든 것이 생성되는 것을 볼 수 있었어요. 정말 놀라웠습니다.</p>\n<h3 style=\"font-size: 19px; color: #1a73e8; margin: 25px 0 10px; border-bottom: 2px solid #e8f0fe; padding-bottom: 5px;\" data-ke-size=\"size23\"><b>기획안 기반 웹사이트 제작 및 프로토타입 확인</b></h3>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">생성된 기획안 내용을 복사하여 AI 스튜디오 빌드에 붙여넣기만 하면, AI가 이 기획안을 바탕으로 웹사이트를 만들어줍니다. 동시에, 'AI 랜딩페이지 아키텍트' 앱 자체에서도 프로토타입을 미리 볼 수 있는 기능을 제공합니다. 기획안 생성 후 우측 상단의 'PROTO TYPE 만들기'를 클릭하면 잠시 후 프로토타입이 완성되죠.</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">이 HTML 파일은 간단한 테스트나 클라이언트 시안 확인용으로 정말 유용합니다. 다운로드한 HTML 파일을 더블클릭만 해도 브라우저에서 바로 열리기 때문에, 시안을 빠르게 확인할 수 있어 효율적이죠. AI 스튜디오 빌드에서 최종 완성된 랜딩페이지를 확인하면, 20년 경력 공인중개사의 아이덴티티가 잘 반영된 브랜드 페이지가 생성되어 있을 겁니다. 사용자는 이제 이 기본 틀에 자신에게 맞는 내용을 추가하거나 수정하며 현실화할 수 있습니다.</p>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>  완성된 랜딩페이지, Vercel로 배포하기</b></h2>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\"><b>AI 랜딩페이지 아키텍트</b>로 생성한 랜딩페이지를 세상에 공개하는 방법은 매우 간단합니다. Vercel을 활용하면 되는데, 그 방법을 다시 한번 자세히 알려드릴게요.</p>\n<figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"1353\" data-origin-height=\"804\"><span data-url=\"https://blog.kakaocdn.net/dn/byFPFP/dJMb995Suz6/k4QL0xyPrYNdPKhUBDMMD1/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/byFPFP/dJMb995Suz6/k4QL0xyPrYNdPKhUBDMMD1/img.png\"><img src=\"https://blog.kakaocdn.net/dn/byFPFP/dJMb995Suz6/k4QL0xyPrYNdPKhUBDMMD1/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FbyFPFP%2FdJMb995Suz6%2Fk4QL0xyPrYNdPKhUBDMMD1%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" alt=\"AI 랜딩페이지 아키텍트 앱에서 웹사이트 기획안을 생성하는 직관적인 UI.\" loading=\"lazy\" width=\"1353\" height=\"804\" data-origin-width=\"1353\" data-origin-height=\"804\"/></span></figure>\n\n<ol style=\"list-style-type: decimal; margin-left: 20px; margin-bottom: 20px; color: #3c4043;\" data-ke-list-type=\"decimal\">\n<li style=\"margin-bottom: 10px;\"><b>GitHub 저장소 생성</b>: 먼저 '깃허브 저장' 버튼을 클릭하고, 사이트명과 설명을 입력한 후 '공개'로 변경합니다. 그리고 하단의 'Create Git Repo' 버튼을 클릭하면 잠시 후 업로드 파일 목록이 보이고, 그 아래 'Change' 버튼을 클릭하면 GitHub에 업로드가 완료됩니다.</li>\n<li style=\"margin-bottom: 10px;\"><b>Vercel로 Import</b>: 이제 Vercel로 이동하여 우측의 'Add New' &gt; 'Project'를 클릭합니다. 저장소 목록에서 방금 GitHub에 업로드한 프로젝트 옆의 'Import' 버튼을 클릭한 후, 화면이 바뀌면 'Deploy'를 클릭합니다.</li>\n<li style=\"margin-bottom: 10px;\"><b>배포 완료 및 공개 설정</b>: 잠시 기다리면 배포가 완료되고, 대시보드 화면에 배포된 주소가 나타납니다. 이 사이트를 공개하려면 대시보드 위 메뉴의 'Settings'에서 'Deployment Protection' 탭을 선택하고 'Vercel Authentication'에 있는 슬라이드 스위치를 '비활성화'해야 합니다.</li>\n</ol>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">이 과정을 거치면 기본적인 웹사이트가 완성되어 누구나 접근할 수 있게 됩니다. 정말 간단하죠? 이전에는 상상하기 어려웠던 전문가급 웹사이트 배포가 이제는 몇 번의 클릭만으로 가능해진 셈입니다.</p>\n<h4 style=\"margin-bottom: 20px;\" data-ke-size=\"size20\"><span style=\"color: #ee2323;\"><b>[ <span style=\"text-align: start;\">AI 랜딩페이지 아키텍트로 만들어 배포된 페이지 예시]</span></b></span></h4>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\"><a href=\"https://visual-impact-portfolio.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://visual-impact-portfolio.vercel.app/</a><br /><a href=\"https://park-dong-san-real-estate-portfolio.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://park-dong-san-real-estate-portfolio.vercel.app/</a><br /><a href=\"https://insight-flow-zeta.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://insight-flow-zeta.vercel.app/</a><br /><a href=\"https://cheonhataepyeong-super.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://cheonhataepyeong-super.vercel.app/</a><br /><a href=\"https://career-momentum.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://career-momentum.vercel.app/</a><br /><a href=\"https://creator-profile-card.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://creator-profile-card.vercel.app/</a><br /><a href=\"https://digital-goods-store.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://digital-goods-store.vercel.app/</a><br /><a href=\"https://kim-sang-dam-portfolio.vercel.app/\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://kim-sang-dam-portfolio.vercel.app/</a></p>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b> ️ 이미지 관리: 시각적 매력을 더하는 마무리</b></h2>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">생성된 기획안에는 이미지 링크가 loremflickr로 되어있는 경우가 있습니다. 이는 임시 플레이스홀더 이미지인데요, 사이트 서비스 자체는 무료이고 무료 이미지가 많지만, 실제 배포를 위해서는 저작권 문제가 없는 무료 이미지나 자신만의 이미지로 교체하는 것이 중요합니다. 이 점은 꼭 주의하셔야 합니다.</p>\n<div style=\"background-color: #e8f4fd; border-left: 4px solid #1a73e8; padding: 15px; margin: 20px 0; border-radius: 0 8px 8px 0;\">\n<p style=\"margin-bottom: 0; color: #3c4043;\" data-ke-size=\"size16\">  <b>팁</b>: '이 페이지에 이미지의 위치와 이미지를 교체하기 위해 적합한 이미지 생성 프롬프트를 알려줘. 앱 수정이 아니야. 응답만 해.'라고 입력하면, AI가 해당 사이트에 포함된 모든 이미지와 대체할 이미지의 생성 프롬프트를 상세하게 보여줍니다. 여기서 AI로 생성한 이미지나 보유 중인 이미지를 클라우드 등에 공유한 후, 이미지 주소와 함께 '메인 프로필 이미지를 이 주소로 변경해달라'고 요청하면 됩니다.</p>\n</div>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>✨ 이제 당신도 전문가급 웹사이트 오너!</b></h2>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">지금까지 'AI 랜딩페이지 아키텍트'를 활용하여 코딩 지식 없이도 전문가 수준의 웹사이트를 기획하고, 제작하고, 배포하는 모든 과정을 살펴보았습니다. 솔직히 저도 처음에는 이렇게까지 쉽고 빠르게 구현될 줄 몰랐습니다. 물론, 코딩 지식이 있다면 더 세밀하게 커스터마이징하고 자신만의 개성을 더할 수 있겠지만, 없어도 충분히 훌륭한 결과물을 만들 수 있다는 점이 가장 큰 매력이라고 생각해요.</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">2025년, AI 기술은 정말 우리 삶의 많은 부분을 변화시키고 있습니다. 특히 웹 개발 분야에서는 비전문가도 창작자가 될 수 있는 강력한 도구를 제공하고 있죠. 이제 복잡한 개발 과정에 발목 잡히지 말고, 여러분의 아이디어를 마음껏 펼쳐보세요. 'AI 랜딩페이지 아키텍트'가 그 여정에 든든한 조력자가 되어줄 것입니다. 여러분의 웹사이트가 세상에 공개될 날을 기대하며, 오늘 글을 마치겠습니다.</p>\n<div style=\"background-color: #f8f9fa; border: 1px solid #dadce0; border-radius: 8px; box-shadow: 0 4px 12px rgba(0,0,0,0.1); padding: 25px; margin: 40px 0;\">\n<div style=\"font-size: 26px; color: #1a73e8; font-weight: bold; margin-bottom: 15px; padding-bottom: 10px; border-bottom: 2px solid #1a73e8;\">  핵심 요약</div>\n<p style=\"font-size: 17px; margin-bottom: 15px; color: #3c4043;\" data-ke-size=\"size16\"><b>1. 기획부터 배포까지 5분 만에 가능:</b> AI 랜딩페이지 아키텍트는 복잡한 웹사이트 제작 과정을 대폭 단축합니다.</p>\n<p style=\"font-size: 17px; margin-bottom: 15px; color: #3c4043;\" data-ke-size=\"size16\"><b>2. AI가 전문 디자이너 역할 수행:</b> 젬 지침을 기반으로 AI가 UX/UI 및 카피라이팅까지 기획해줍니다.</p>\n<p style=\"font-size: 17px; margin-bottom: 15px; color: #3c4043;\" data-ke-size=\"size16\"><b>3. 비개발자도 전문가급 결과물:</b> 코딩 지식 없이도 개인, 포트폴리오, 회사 홍보 페이지 등을 손쉽게 제작할 수 있습니다.</p>\n<p style=\"font-size: 17px; margin-bottom: 0; color: #3c4043;\" data-ke-size=\"size16\"><b>4. Vercel 연동으로 즉시 배포:</b> 생성된 페이지는 GitHub를 통해 Vercel로 연동, 클릭 몇 번으로 실제 웹에 공개됩니다.</p>\n<div style=\"font-size: 14px; color: #5f6368; margin-top: 25px; border-top: 1px solid #dadce0; padding-top: 15px;\"><i>AI 기술은 끊임없이 발전하고 있습니다. 최신 정보를 참고하여 더 효율적인 웹사이트 제작을 경험해보세요.</i></div>\n</div>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>❓ 자주 묻는 질문 (FAQ)</b></h2>\n<div style=\"margin-bottom: 15px;\">\n<h3 style=\"font-size: 18px; color: #1a73e8; margin-bottom: 5px;\" data-ke-size=\"size23\">Q1: 'AI 랜딩페이지 아키텍트'는 정말 코딩 지식이 없어도 사용할 수 있나요?</h3>\n<p style=\"margin-bottom: 20px; color: #3c4043;\" data-ke-size=\"size16\">네, 물론입니다. 이 앱은 복잡한 코딩 과정 없이, 웹사이트 주제, 타겟 고객, 핵심 목표만 입력하면 AI가 기획부터 디자인, 그리고 기본적인 HTML 코드까지 생성해줍니다. 비개발자도 전문가 수준의 랜딩페이지를 만들 수 있도록 설계되었습니다.</p>\n</div>\n<div style=\"margin-bottom: 15px;\">\n<h3 style=\"font-size: 18px; color: #1a73e8; margin-bottom: 5px;\" data-ke-size=\"size23\">Q2: 생성된 랜딩페이지의 디자인이나 콘텐츠를 수정할 수 있나요?</h3>\n<p style=\"margin-bottom: 20px; color: #3c4043;\" data-ke-size=\"size16\">네, 생성된 기획안과 HTML 코드는 얼마든지 수정할 수 있습니다. AI가 제공하는 기본 틀은 훌륭한 출발점이 되며, 사용자의 필요에 따라 텍스트, 이미지, 색상 등을 자유롭게 변경하여 자신만의 개성을 더할 수 있습니다. 코딩 지식이 있다면 더욱 세밀한 커스터마이징도 가능합니다.</p>\n</div>\n<div style=\"margin-bottom: 15px;\">\n<h3 style=\"font-size: 18px; color: #1a73e8; margin-bottom: 5px;\" data-ke-size=\"size23\">Q3: 웹사이트를 배포하는 과정이 어렵지는 않나요?</h3>\n<p style=\"margin-bottom: 20px; color: #3c4043;\" data-ke-size=\"size16\">전혀 어렵지 않습니다. 'AI 랜딩페이지 아키텍트'는 GitHub 연동 기능을 제공하며, 생성된 코드를 GitHub에 업로드한 후 Vercel과 같은 호스팅 서비스를 이용하면 몇 번의 클릭만으로 손쉽게 웹사이트를 배포할 수 있습니다. 자세한 과정은 본문에서 단계별로 설명해 드리고 있습니다.</p>\n</div>\n</div>\n<h2 style=\"font-size: 22px; color: white; background: linear-gradient(to right, #1a73e8, #004d99); margin: 30px 0 15px; border-radius: 10px; padding: 10px 25px; text-shadow: 1px 1px 2px rgba(0,0,0,0.2); font-weight: bold; box-shadow: 0 4px 8px rgba(0,0,0,0.1);\" data-ke-size=\"size26\"><b>GEM 지침과 &nbsp;AI 랜딩페이지 아키텍트</b></h2>\n<p><figure class=\"fileblock\" data-ke-align=\"alignCenter\"><a href=\"https://blog.kakaocdn.net/dn/nXhpk/dJMcabP9tlg/NZ4bNqMDfZfJZ2KHnaljkk/%EB%9E%9C%EB%94%A9%ED%8E%98%EC%9D%B4%EC%A7%80GEM%20%EC%A7%80%EC%B9%A8.txt?attach=1&amp;knm=tfile.txt\" class=\"\">\n    <div class=\"image\"></div>\n    <div class=\"desc\"><div class=\"filename\"><span class=\"name\">랜딩페이지GEM 지침.txt</span></div>\n<div class=\"size\">0.00MB</div>\n</div>\n  </a></figure>\n</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">&nbsp;</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">[ <span style=\"color: #3c4043; text-align: start;\">AI 랜딩페이지 아키텍트 사용하기]</span></p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">&nbsp;</p>\n<figure id=\"og_1763900347683\" contenteditable=\"false\" data-ke-type=\"opengraph\" data-ke-align=\"alignCenter\" data-og-type=\"website\" data-og-title=\"로그인 - Google 계정\" data-og-description=\"이메일 또는 휴대전화\" data-og-host=\"accounts.google.com\" data-og-source-url=\"https://ai.studio/apps/drive/1nxnPJS3BQRw8GwHg_Z-SiKU5lNDwHvXU\" data-og-url=\"https://accounts.google.com/v3/signin/identifier?continue=https%3A%2F%2Faistudio.google.com%2Fapps%2Fdrive%2F1nxnPJS3BQRw8GwHg_Z-SiKU5lNDwHvXU&amp;dsh=S-1271764577%3A1763900340701750&amp;followup=https%3A%2F%2Faistudio.google.com%2Fapps%2Fdrive%2F1nxnPJS3BQRw8GwHg_Z-SiKU5lNDwHvXU&amp;ifkv=ARESoU1xbK9V4oznYifFRpl1ISGp-7BQacHjg7OlhXroiJpBPRNpUE4YcPk4SUOS8Bj3W7iabcQO9A&amp;passive=1209600&amp;flowName=WebLiteSignIn&amp;flowEntry=ServiceLogin\" data-og-image=\"\"><a href=\"https://ai.studio/apps/drive/1nxnPJS3BQRw8GwHg_Z-SiKU5lNDwHvXU\" target=\"_blank\" rel=\"noopener\" data-source-url=\"https://ai.studio/apps/drive/1nxnPJS3BQRw8GwHg_Z-SiKU5lNDwHvXU\">\n<div class=\"og-image\" style=\"background-image: url();\">&nbsp;</div>\n<div class=\"og-text\">\n<p class=\"og-title\" data-ke-size=\"size16\">로그인 - Google 계정</p>\n<p class=\"og-desc\" data-ke-size=\"size16\">이메일 또는 휴대전화</p>\n<p class=\"og-host\" data-ke-size=\"size16\">accounts.google.com</p>\n</div>\n</a></figure>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">&nbsp;</p>\n<p style=\"margin-bottom: 20px;\" data-ke-size=\"size16\">생성된 기획안에는 이미지 링크가 loremflickr로 되어있는 경우가 있습니다. 이는 임시 플레이스홀더 이미지인데요, 사이트 서비스 자체는 무료이고 무료 이미지가 많지만, 실제 배포를 위해서는 저작권 문제가 없는 무료 이미지나 자신만의 이미지로 교체하는 것이 중요합니다. 이 점은 꼭 주의하셔야 합니다.</p>\n<script type=\"application/ld+json\">\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [\n    {\n      \"@type\": \"Question\",\n      \"name\": \"'AI 랜딩페이지 아키텍트'는 정말 코딩 지식이 없어도 사용할 수 있나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"네, 물론입니다. 이 앱은 복잡한 코딩 과정 없이, 웹사이트 주제, 타겟 고객, 핵심 목표만 입력하면 AI가 기획부터 디자인, 그리고 기본적인 HTML 코드까지 생성해줍니다. 비개발자도 전문가 수준의 랜딩페이지를 만들 수 있도록 설계되었습니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"생성된 랜딩페이지의 디자인이나 콘텐츠를 수정할 수 있나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"네, 생성된 기획안과 HTML 코드는 얼마든지 수정할 수 있습니다. AI가 제공하는 기본 틀은 훌륭한 출발점이 되며, 사용자의 필요에 따라 텍스트, 이미지, 색상 등을 자유롭게 변경하여 자신만의 개성을 더할 수 있습니다. 코딩 지식이 있다면 더욱 세밀한 커스터마이징도 가능합니다.\"\n      }\n    },\n    {\n      \"@type\": \"Question\",\n      \"name\": \"웹사이트를 배포하는 과정이 어렵지는 않나요?\",\n      \"acceptedAnswer\": {\n        \"@type\": \"Answer\",\n        \"text\": \"전혀 어렵지 않습니다. 'AI 랜딩페이지 아키텍트'는 GitHub 연동 기능을 제공하며, 생성된 코드를 GitHub에 업로드한 후 Vercel과 같은 호스팅 서비스를 이용하면 몇 번의 클릭만으로 손쉽게 웹사이트를 배포할 수 있습니다. 자세한 과정은 본문에서 단계별로 설명해 드리고 있습니다.\"\n      }\n    }\n  ]\n}\n</script>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=oq5lxxHm5-Y\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/bguXu3/hyZOlhIPpd/7XWeEsDKyp5p0eKsFZR071/img.jpg?width=1280&amp;height=720&amp;face=760_164_880_296,https://scrap.kakaocdn.net/dn/UwMDJ/hyZOtUmzFQ/Hd3UJegUBatcjBbJ9kFIp1/img.jpg?width=1280&amp;height=720&amp;face=760_164_880_296\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"코딩 몰라도 웹사이트 바로 배포하는 법! 무료 생성기 포함!\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/oq5lxxHm5-Y\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "복잡한 웹사이트 기획부터 코딩, 배포까지 단 5분 만에 끝낼 수 있다면 어떠세요? 2025년, AI 기술의 발전은 더 이상 꿈이 아닙니다. 비개발자도 전문가급 랜딩페이지를 만들고 싶은 분들을 위해, AI 랜딩페이지 아키텍트가 어떻게 이 모든 과정을 혁신하는지 자세히 알아보겠습니다. 이제 여러분의 상상이 현실이 되는 시대가 도래했습니다.\n  왜 랜딩페이지가 필요할까요?\n\n\n음, 생각해 보면 많은 분들이 거창한 웹 애플리케이션보다는 자신을 소개하거나 특정 서비스를 홍보할 수 있는 간단하면서도 전문적인 랜딩페이지 하나를 더 필요로 하시는 것 같아요. 특히 개발 취업을 준비 중인 분들이나, 개인 사업을 시작하려는 분들에게는 명함처럼 내밀 수 있는 포트폴리오 사이트나 회사 홍보 페이지가 정말 필수적이죠.\n그런데 막상 만들려고 하면 어디서부터 시작해야 할지 막막할 때가 많습니다. 코딩 지식이 없어서 못 만드는 것보다, 사실은 '어떤 내용을 담아야 할까?', '디자인은 어떻게 해야 촌스럽지 않을까?' 같은 기획 단계에서부터 좌절하는 경우가 태반이에요. 저도 주변에서 그런 어려움을 자주 접하곤 했습니다.\n  '랜딩페이지 메이커' 젬 지침의 탄생과 한계\n이런 문제를 해결하고자 제가 처음 시도했던 것이 바로 '랜딩페이지 메이커' 젬(GEM) 지침입니다. 이 지침은 AI에게 랜딩페이지 제작에 필요한 모든 단계를 아주 구체적으로 알려주는 매뉴얼이라고 할 수 있죠. 크게 세 부분으로 나뉩니다.\nRole (역할): AI에게 구글의 수석 UX/UI 디자이너이자 전문 카피라이터라는 정체성을 부여합니다. 단순히 구조만 설계하는 것을 넘어, 사용자의 심리를 꿰뚫는 매력적인 문구와 실제 개발 가능한 수준의 디테일한 기획력을 갖추도록 명시했죠.\nContext (맥락): 최종 목표를 '메인 페이지와 4개의 서브 페이지가 완벽하게 연결된 고품질 웹사이트 제작'으로 설정하고, 웹사이트 주제, 타겟 고객, 핵심 목표를 입력받도록 했습니다.\nTask & Process (작업 절차): 이 부분이 핵심인데요. 총 3단계로 구성됩니다.\n\n스텝 1. 브랜드 아이덴티티: 사이트맵, Primary Color(Hex Code와 선택 이유), Typography, Mood Board(형용사 3가지)를 구체적으로 지시합니다.\n스텝 2. 메인 페이지 상세 기획: Hero Section (헤드라인, 서브 텍스트, CTA 버튼 2개), Problem & Solution, Key Features 3개, Social Proof까지 실제 들어갈 문구를 모두 작성하도록 합니다.\n스텝 3. 서브 페이지 4종: 각 페이지의 제목, 목표, 헤더 카피, 핵심 바디 콘텐츠, CTA를 상세하게 작성하도록 지시합니다.\n이 젬 지침을 활용하면, '열린 입 치과 의원 홈페이지'처럼 간단한 입력만으로도 브랜드 아이덴티티부터 아주 구체적인 UX/UI 방법론이 포함된 랜딩페이지 생성 지침을 바로 받아볼 수 있었습니다. 심지어 이 기획안을 기반으로 실제 코드를 짜서 프로토타입을 미리 확인하는 것도 가능했죠.\n⚠️ 하지만 젬 지침은 한 번 등록하면 제미나이에서 바로 사용 가능하고 응답도 빠르다는 장점이 있지만, 때로는 출력물의 내용이 많거나 복잡할 때 우리가 원하는 만큼 일관성 있는 결과를 제공하지 못하는 한계가 있었습니다. \n*GEM지침원본은 본문 하단에 있습니다.\n  2025년의 해결책: AI 랜딩페이지 아키텍트\n이러한 한계를 극복하고 더 일관성 있고 강력한 결과물을 얻기 위해 앱으로 구현한 것이 바로 오늘 여러분께 소개해 드릴 'AI 랜딩페이지 아키텍트'입니다. 2025년 현재, 이 앱은 랜딩페이지 제작 과정을 완전히 새로운 차원으로 끌어올렸다고 자신 있게 말씀드릴 수 있어요. 이제 앱을 사용해 보는 과정을 함께 살펴보시죠.\n간편한 웹사이트 기획안 생성\n메인 화면에서 웹사이트 주제, 타겟 고객, 핵심 목표만 입력하면, AI가 이 정보를 바탕으로 랜딩페이지 기획안을 생성합니다. 만약 주제를 어떤 걸로 해야 할지 고민된다면, 우측 상단의 '주제 예시 선택' 버튼을 눌러보세요. 개인 홈페이지, 포트폴리오, 회사 홍보 페이지 등 자주 사용되는 20가지 유형이 미리 준비되어 있습니다.\n예를 들어, 저는 '이력서/경력소개'를 선택하고 '20년 경력 공인중개사 박동산'이라고 입력해 보았습니다. 타겟 고객이나 핵심 목표 설정도 귀찮다면, 주제 입력칸 아래 '타겟과 목표 자동 완성' 버튼을 누르세요. AI가 주제를 분석해서 가장 적절한 타겟과 목표를 자동으로 채워줍니다. 물론, 이 내용은 언제든 자신의 상황에 맞게 수정할 수 있습니다.\n모든 입력이 완료되면 '기획안 생성 시작' 버튼만 누르면 됩니다. 잠시만 기다리면 전문가가 작성한 듯한 기획안이 순식간에 나옵니다! 젬 지침에서 구현했던 브랜드 아이덴티티, 전체 구조 전략, 메인 및 서브페이지 기획, 심지어 폴더 구조와 기타 가이드까지 랜딩페이지 기획안의 모든 것이 생성되는 것을 볼 수 있었어요. 정말 놀라웠습니다.\n기획안 기반 웹사이트 제작 및 프로토타입 확인\n생성된 기획안 내용을 복사하여 AI 스튜디오 빌드에 붙여넣기만 하면, AI가 이 기획안을 바탕으로 웹사이트를 만들어줍니다. 동시에, 'AI 랜딩페이지 아키텍트' 앱 자체에서도 프로토타입을 미리 볼 수 있는 기능을 제공합니다. 기획안 생성 후 우측 상단의 'PROTO TYPE 만들기'를 클릭하면 잠시 후 프로토타입이 완성되죠.\n이 HTML 파일은 간단한 테스트나 클라이언트 시안 확인용으로 정말 유용합니다. 다운로드한 HTML 파일을 더블클릭만 해도 브라우저에서 바로 열리기 때문에, 시안을 빠르게 확인할 수 있어 효율적이죠. AI 스튜디오 빌드에서 최종 완성된 랜딩페이지를 확인하면, 20년 경력 공인중개사의 아이덴티티가 잘 반영된 브랜드 페이지가 생성되어 있을 겁니다. 사용자는 이제 이 기본 틀에 자신에게 맞는 내용을 추가하거나 수정하며 현실화할 수 있습니다.\n  완성된 랜딩페이지, Vercel로 배포하기\nAI 랜딩페이지 아키텍트로 생성한 랜딩페이지를 세상에 공개하는 방법은 매우 간단합니다. Vercel을 활용하면 되는데, 그 방법을 다시 한번 자세히 알려드릴게요.\n\n\n\nGitHub 저장소 생성: 먼저 '깃허브 저장' 버튼을 클릭하고, 사이트명과 설명을 입력한 후 '공개'로 변경합니다. 그리고 하단의 'Create Git Repo' 버튼을 클릭하면 잠시 후 업로드 파일 목록이 보이고, 그 아래 'Change' 버튼을 클릭하면 GitHub에 업로드가 완료됩니다.\nVercel로 Import: 이제 Vercel로 이동하여 우측의 'Add New' > 'Project'를 클릭합니다. 저장소 목록에서 방금 GitHub에 업로드한 프로젝트 옆의 'Import' 버튼을 클릭한 후, 화면이 바뀌면 'Deploy'를 클릭합니다.\n배포 완료 및 공개 설정: 잠시 기다리면 배포가 완료되고, 대시보드 화면에 배포된 주소가 나타납니다. 이 사이트를 공개하려면 대시보드 위 메뉴의 'Settings'에서 'Deployment Protection' 탭을 선택하고 'Vercel Authentication'에 있는 슬라이드 스위치를 '비활성화'해야 합니다.\n이 과정을 거치면 기본적인 웹사이트가 완성되어 누구나 접근할 수 있게 됩니다. 정말 간단하죠? 이전에는 상상하기 어려웠던 전문가급 웹사이트 배포가 이제는 몇 번의 클릭만으로 가능해진 셈입니다.\n[ AI 랜딩페이지 아키텍트로 만들어 배포된 페이지 예시]\nhttps://visual-impact-portfolio.vercel.app/\nhttps://park-dong-san-real-estate-portfolio.vercel.app/\nhttps://insight-flow-zeta.vercel.app/\nhttps://cheonhataepyeong-super.vercel.app/\nhttps://career-momentum.vercel.app/\nhttps://creator-profile-card.vercel.app/\nhttps://digital-goods-store.vercel.app/\nhttps://kim-sang-dam-portfolio.vercel.app/\n ️ 이미지 관리: 시각적 매력을 더하는 마무리\n생성된 기획안에는 이미지 링크가 loremflickr로 되어있는 경우가 있습니다. 이는 임시 플레이스홀더 이미지인데요, 사이트 서비스 자체는 무료이고 무료 이미지가 많지만, 실제 배포를 위해서는 저작권 문제가 없는 무료 이미지나 자신만의 이미지로 교체하는 것이 중요합니다. 이 점은 꼭 주의하셔야 합니다.\n  팁: '이 페이지에 이미지의 위치와 이미지를 교체하기 위해 적합한 이미지 생성 프롬프트를 알려줘. 앱 수정이 아니야. 응답만 해.'라고 입력하면, AI가 해당 사이트에 포함된 모든 이미지와 대체할 이미지의 생성 프롬프트를 상세하게 보여줍니다. 여기서 AI로 생성한 이미지나 보유 중인 이미지를 클라우드 등에 공유한 후, 이미지 주소와 함께 '메인 프로필 이미지를 이 주소로 변경해달라'고 요청하면 됩니다.\n✨ 이제 당신도 전문가급 웹사이트 오너!\n지금까지 'AI 랜딩페이지 아키텍트'를 활용하여 코딩 지식 없이도 전문가 수준의 웹사이트를 기획하고, 제작하고, 배포하는 모든 과정을 살펴보았습니다. 솔직히 저도 처음에는 이렇게까지 쉽고 빠르게 구현될 줄 몰랐습니다. 물론, 코딩 지식이 있다면 더 세밀하게 커스터마이징하고 자신만의 개성을 더할 수 있겠지만, 없어도 충분히 훌륭한 결과물을 만들 수 있다는 점이 가장 큰 매력이라고 생각해요.\n2025년, AI 기술은 정말 우리 삶의 많은 부분을 변화시키고 있습니다. 특히 웹 개발 분야에서는 비전문가도 창작자가 될 수 있는 강력한 도구를 제공하고 있죠. 이제 복잡한 개발 과정에 발목 잡히지 말고, 여러분의 아이디어를 마음껏 펼쳐보세요. 'AI 랜딩페이지 아키텍트'가 그 여정에 든든한 조력자가 되어줄 것입니다. 여러분의 웹사이트가 세상에 공개될 날을 기대하며, 오늘 글을 마치겠습니다.\n  핵심 요약\n1. 기획부터 배포까지 5분 만에 가능: AI 랜딩페이지 아키텍트는 복잡한 웹사이트 제작 과정을 대폭 단축합니다.\n2. AI가 전문 디자이너 역할 수행: 젬 지침을 기반으로 AI가 UX/UI 및 카피라이팅까지 기획해줍니다.\n3. 비개발자도 전문가급 결과물: 코딩 지식 없이도 개인, 포트폴리오, 회사 홍보 페이지 등을 손쉽게 제작할 수 있습니다.\n4. Vercel 연동으로 즉시 배포: 생성된 페이지는 GitHub를 통해 Vercel로 연동, 클릭 몇 번으로 실제 웹에 공개됩니다.\nAI 기술은 끊임없이 발전하고 있습니다. 최신 정보를 참고하여 더 효율적인 웹사이트 제작을 경험해보세요.\n❓ 자주 묻는 질문 (FAQ)\nQ1: 'AI 랜딩페이지 아키텍트'는 정말 코딩 지식이 없어도 사용할 수 있나요?\n네, 물론입니다. 이 앱은 복잡한 코딩 과정 없이, 웹사이트 주제, 타겟 고객, 핵심 목표만 입력하면 AI가 기획부터 디자인, 그리고 기본적인 HTML 코드까지 생성해줍니다. 비개발자도 전문가 수준의 랜딩페이지를 만들 수 있도록 설계되었습니다.\nQ2: 생성된 랜딩페이지의 디자인이나 콘텐츠를 수정할 수 있나요?\n네, 생성된 기획안과 HTML 코드는 얼마든지 수정할 수 있습니다. AI가 제공하는 기본 틀은 훌륭한 출발점이 되며, 사용자의 필요에 따라 텍스트, 이미지, 색상 등을 자유롭게 변경하여 자신만의 개성을 더할 수 있습니다. 코딩 지식이 있다면 더욱 세밀한 커스터마이징도 가능합니다.\nQ3: 웹사이트를 배포하는 과정이 어렵지는 않나요?\n전혀 어렵지 않습니다. 'AI 랜딩페이지 아키텍트'는 GitHub 연동 기능을 제공하며, 생성된 코드를 GitHub에 업로드한 후 Vercel과 같은 호스팅 서비스를 이용하면 몇 번의 클릭만으로 손쉽게 웹사이트를 배포할 수 있습니다. 자세한 과정은 본문에서 단계별로 설명해 드리고 있습니다.\nGEM 지침과  AI 랜딩페이지 아키텍트\n\n    \n\n    \n랜딩페이지GEM 지침.txt\n0.00MB\n\n\n \n[ AI 랜딩페이지 아키텍트 사용하기]\n \n\n \n로그인 - Google 계정\n이메일 또는 휴대전화\naccounts.google.com\n\n \n \n생성된 기획안에는 이미지 링크가 loremflickr로 되어있는 경우가 있습니다. 이는 임시 플레이스홀더 이미지인데요, 사이트 서비스 자체는 무료이고 무료 이미지가 많지만, 실제 배포를 위해서는 저작권 문제가 없는 무료 이미지나 자신만의 이미지로 교체하는 것이 중요합니다. 이 점은 꼭 주의하셔야 합니다.",
        "guid": "https://muzbox.tistory.com/483683",
        "categories": [
          "AI, 미래기술/AI 챗봇 및 지침 무료 배포",
          "2025년 AI 기술",
          "AI 랜딩페이지",
          "AI 웹디자인",
          "vercel 배포",
          "랜딩페이지 아키텍트",
          "비개발자 웹사이트",
          "웹사이트 제작",
          "자동 웹사이트 생성",
          "코딩 없이 웹사이트",
          "포트폴리오 사이트"
        ],
        "isoDate": "2025-11-23T12:19:50.000Z"
      }
    ]
  },
  {
    "name": "동우리의 블로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "하테나",
    "category": "개인",
    "posts": []
  },
  {
    "name": "늑돌이네 라지온",
    "category": "개인",
    "posts": []
  },
  {
    "name": "루리웹 - 루리웹 리뷰 게시판",
    "category": "게임",
    "posts": [
      {
        "creator": "｜RULIWEB｜",
        "title": "악역영애 4컷 만화 - 27화, 위기인데스와 ②",
        "link": "https://bbs.ruliweb.com/news/board/11/read/2390",
        "pubDate": "Wed, 19 Nov 2025 20:22:29 +0900",
        "author": "｜RULIWEB｜",
        "content": "<img width=\"236\" height=\"177\" src=\"https://i3.ruliweb.com/thumb/25/11/19/19a9bd95a4051ad6b.jpg\">",
        "contentSnippet": "",
        "categories": [
          "웹툰"
        ],
        "isoDate": "2025-11-19T11:22:29.000Z"
      },
      {
        "creator": "｜RULIWEB｜",
        "title": "익숙하고도 새로운 모습, 포켓몬 레전즈 Z-A",
        "link": "https://bbs.ruliweb.com/news/board/11/read/2389",
        "pubDate": "Tue, 18 Nov 2025 16:39:03 +0900",
        "author": "｜RULIWEB｜",
        "content": "<img width=\"236\" height=\"177\" src=\"https://i3.ruliweb.com/thumb/25/11/18/19a95e01d5c51ad6b.jpg\">",
        "contentSnippet": "",
        "categories": [
          "게임툰"
        ],
        "isoDate": "2025-11-18T07:39:03.000Z"
      }
    ]
  },
  {
    "name": "Reasontobe",
    "category": "개인",
    "posts": []
  },
  {
    "name": "에스티마의 인터넷이야기 EstimaStory.com",
    "category": "개인",
    "posts": []
  },
  {
    "name": "나긋한 개발 - 데비안 리눅스와 프로그램 언어",
    "category": "개인",
    "posts": []
  },
  {
    "name": "일상을 여행처럼...",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Just hack'em",
    "category": "개인",
    "posts": []
  },
  {
    "name": "C++ Truths",
    "category": "개인",
    "posts": []
  },
  {
    "name": "jacking75",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Joel on Software",
    "category": "개인",
    "posts": []
  },
  {
    "name": "벤자민로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "악보쓰는 프로그래머",
    "category": "개인",
    "posts": []
  },
  {
    "name": "쭌안아빠",
    "category": "개인",
    "posts": []
  },
  {
    "name": "A Gangster World",
    "category": "개인",
    "posts": []
  },
  {
    "name": "요우의 내맘대로 블로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "개발자스럽다",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "Against All Odds.",
    "category": "개인",
    "posts": []
  },
  {
    "name": "움직이는 게임서버",
    "category": "개인",
    "posts": []
  },
  {
    "name": "이상욱",
    "category": "개인",
    "posts": []
  },
  {
    "name": "임철재",
    "category": "개인",
    "posts": []
  },
  {
    "name": "어쩐지 오늘은",
    "category": "개인",
    "posts": []
  },
  {
    "name": "oddpoet’s étude",
    "category": "개인",
    "posts": []
  },
  {
    "name": "0x00 - NULL",
    "category": "개인",
    "posts": []
  },
  {
    "name": "퇴근 후 서버다운",
    "category": "개인",
    "posts": [
      {
        "creator": "SIDNFT",
        "title": "요리: 계란 고추장 조림 / 콜라 찜닭",
        "link": "https://serverdown.tistory.com/1491",
        "pubDate": "Sun, 23 Nov 2025 22:18:30 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1491#entry1491comment",
        "content": "<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">달걀 고추장 조림</h2>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/shorts/0fuQKMVWEuA\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/shorts/0fuQKMVWEuA</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/shorts/0fuQKMVWEuA\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/b2Jw8n/hyZOyOUPE7/ytdcLLpyVPd7MLnpEYbMhK/img.jpg?width=405&amp;height=720&amp;face=0_0_405_720,https://scrap.kakaocdn.net/dn/gmm0N/hyZNHT86bD/lqX4D8XqD9rFlhz9YXOgZK/img.jpg?width=405&amp;height=720&amp;face=0_0_405_720,https://scrap.kakaocdn.net/dn/yoYJN/hyZOmOtUoN/S0zhHy2xZHKbmqjYdV1Ij0/img.jpg?width=405&amp;height=720&amp;face=0_0_405_720\" data-video-width=\"405\" data-video-height=\"720\" data-video-origin-width=\"405\" data-video-origin-height=\"720\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"류수영 님이 추천하는 고추장 소스로 계란 볶이 요리 레시피를 만들었는데 이거 진짜 맛있어요 #\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/0fuQKMVWEuA\" width=\"405\" height=\"720\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\"><span style=\"text-align: start;\">콜라 닭찜</span></h2>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=gtsKoQofPIc\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=gtsKoQofPIc</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=gtsKoQofPIc\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/bINNob/hyZOwp1WzT/H6voPkxnCEh9i02kjepfu1/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/wGG5P/hyZOp5v1fJ/AqkXkmn87Ff2zMKUKsxGCK/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"닭다리 굽지 말고 콜라만 부으세요.\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/gtsKoQofPIc\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "달걀 고추장 조림\n영상: https://www.youtube.com/shorts/0fuQKMVWEuA\n\n\n\n \n \n콜라 닭찜\n영상: https://www.youtube.com/watch?v=gtsKoQofPIc",
        "guid": "https://serverdown.tistory.com/1491",
        "categories": [
          "요리"
        ],
        "isoDate": "2025-11-23T13:18:30.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "유니티 오래된 Input 설정하기 / Active Input Handling / Input.GetKeyDown",
        "link": "https://serverdown.tistory.com/1490",
        "pubDate": "Sat, 22 Nov 2025 21:11:32 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1490#entry1490comment",
        "content": "<p data-ke-size=\"size16\">&nbsp;</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"247\" data-origin-height=\"154\"><span data-url=\"https://blog.kakaocdn.net/dn/THEvK/dJMcagDVJ3a/KCRPm4kiw6r7z44ksZ2BT1/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/THEvK/dJMcagDVJ3a/KCRPm4kiw6r7z44ksZ2BT1/img.png\"><img src=\"https://blog.kakaocdn.net/dn/THEvK/dJMcagDVJ3a/KCRPm4kiw6r7z44ksZ2BT1/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FTHEvK%2FdJMcagDVJ3a%2FKCRPm4kiw6r7z44ksZ2BT1%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"247\" height=\"154\" data-origin-width=\"247\" data-origin-height=\"154\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">Input.GetKeyDown(KeyCode.Alpha1)</p>\n<p data-ke-size=\"size16\">요런식의 구버전 코드는 그냥은 안되고 옵션을 건드려줘야한다.</p>\n<p data-ke-size=\"size16\">Project Settings 에 Other ~~ 쪽에 가면 있다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">Active Input Handling &lt; -이거다</h2>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">여기 설정을</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"941\" data-origin-height=\"892\"><span data-url=\"https://blog.kakaocdn.net/dn/dtDfUQ/dJMcacarXPQ/lPpk1ftzoANocLLy6DO771/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/dtDfUQ/dJMcacarXPQ/lPpk1ftzoANocLLy6DO771/img.png\"><img src=\"https://blog.kakaocdn.net/dn/dtDfUQ/dJMcacarXPQ/lPpk1ftzoANocLLy6DO771/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FdtDfUQ%2FdJMcacarXPQ%2FlPpk1ftzoANocLLy6DO771%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"941\" height=\"892\" data-origin-width=\"941\" data-origin-height=\"892\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">눌러보면</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"369\" data-origin-height=\"154\"><span data-url=\"https://blog.kakaocdn.net/dn/Q4pHY/dJMb99Y58C8/i3tE5e0Dew5R56UlG0tO10/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/Q4pHY/dJMb99Y58C8/i3tE5e0Dew5R56UlG0tO10/img.png\"><img src=\"https://blog.kakaocdn.net/dn/Q4pHY/dJMb99Y58C8/i3tE5e0Dew5R56UlG0tO10/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FQ4pHY%2FdJMb99Y58C8%2Fi3tE5e0Dew5R56UlG0tO10%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"369\" height=\"154\" data-origin-width=\"369\" data-origin-height=\"154\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">Both 눌러서 둘다 설치해버리자</p>\n<p data-ke-size=\"size16\">어차피 신버전 Input 도 적응해야한다.</p>\n<p data-ke-size=\"size16\">설정하면 유니티가 재시작한다.</p>\n<p data-ke-size=\"size16\">작업 잘 정리해서 누르도록</p>",
        "contentSnippet": "Input.GetKeyDown(KeyCode.Alpha1)\n요런식의 구버전 코드는 그냥은 안되고 옵션을 건드려줘야한다.\nProject Settings 에 Other ~~ 쪽에 가면 있다.\n \nActive Input Handling < -이거다\n \n여기 설정을\n\n\n \n눌러보면\n\n\nBoth 눌러서 둘다 설치해버리자\n어차피 신버전 Input 도 적응해야한다.\n설정하면 유니티가 재시작한다.\n작업 잘 정리해서 누르도록",
        "guid": "https://serverdown.tistory.com/1490",
        "categories": [
          "프로그래밍/개발메모",
          "유니티"
        ],
        "isoDate": "2025-11-22T12:11:32.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "338일차 - 간단한게임제작기4일차",
        "link": "https://serverdown.tistory.com/1489",
        "pubDate": "Sat, 22 Nov 2025 01:32:20 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1489#entry1489comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"508\" data-origin-height=\"309\"><span data-url=\"https://blog.kakaocdn.net/dn/uovZa/dJMcagKGvSO/qgsaQ9Ong8lIzTn77gkhQ0/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/uovZa/dJMcagKGvSO/qgsaQ9Ong8lIzTn77gkhQ0/img.png\"><img src=\"https://blog.kakaocdn.net/dn/uovZa/dJMcagKGvSO/qgsaQ9Ong8lIzTn77gkhQ0/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FuovZa%2FdJMcagKGvSO%2FqgsaQ9Ong8lIzTn77gkhQ0%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"508\" height=\"309\" data-origin-width=\"508\" data-origin-height=\"309\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=qng5Ckfg82w\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=qng5Ckfg82w</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=qng5Ckfg82w\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/2hNLV/hyZNEpjaq1/ybe8uSwgdrnf1RNsetKLm1/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/pNyXc/hyZNCruPnV/t2V6ko8U1117jj6IXx1Yg1/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"338일차 - 간단한게임제작기4일차\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/qng5Ckfg82w\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">간단한 게임이라 그런지 2주일쯤 해서 완성되고 있습니다.</p>\n<p data-ke-size=\"size16\">내일은 출시 가능할꺼 같습니다.</p>",
        "contentSnippet": "영상: https://www.youtube.com/watch?v=qng5Ckfg82w\n\n\n\n간단한 게임이라 그런지 2주일쯤 해서 완성되고 있습니다.\n내일은 출시 가능할꺼 같습니다.",
        "guid": "https://serverdown.tistory.com/1489",
        "categories": [
          "프로그래밍/자작",
          "유니티",
          "인디게임",
          "자작게임"
        ],
        "isoDate": "2025-11-21T16:32:20.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "AI 활용 GEMINI 3 PRO 코딩툴 관련 영상 모음",
        "link": "https://serverdown.tistory.com/1488",
        "pubDate": "Thu, 20 Nov 2025 19:41:55 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1488#entry1488comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"251\" data-origin-height=\"174\"><span data-url=\"https://blog.kakaocdn.net/dn/JY8ct/dJMcagw8Kyl/636HEBGrqHoxLLD6TVinA1/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/JY8ct/dJMcagw8Kyl/636HEBGrqHoxLLD6TVinA1/img.png\"><img src=\"https://blog.kakaocdn.net/dn/JY8ct/dJMcagw8Kyl/636HEBGrqHoxLLD6TVinA1/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FJY8ct%2FdJMcagw8Kyl%2F636HEBGrqHoxLLD6TVinA1%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"251\" height=\"174\" data-origin-width=\"251\" data-origin-height=\"174\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">GEMINI 3 PRO 설명 영상</h2>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=YIV_URly8g0\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=YIV_URly8g0</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=YIV_URly8g0\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/CadQP/hyZNKJGN51/foslwJJDGBYnxV01CMTFyk/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/cp3nNq/hyZNDX47Uu/vMft1h2H8zxvPue0OK6pK0/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"제미나이 3 프로 출시! 챗GPT와 기존모델 압살한 현존 지구 최강모델\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/YIV_URly8g0\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">제미나이3 전반적인 설명이 있습니다.</p>\n<p data-ke-size=\"size16\">그후에</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 style=\"background-color: #000000; color: #000000; text-align: start;\" data-ke-size=\"size26\">GEMINI 3 PRO 코딩툴영상</h2>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=JvKo0WvwVEg&amp;t=386s\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=JvKo0WvwVEg&amp;t=386s</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=JvKo0WvwVEg\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/xBx2Z/hyZNxDypOl/tlIfxV0zZC7pPuY1gsiC8K/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/dJfz9n/hyZNJ44K40/IXwgK9xUMkDCmp21fNQ040/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"(상위1%툴) 구글러들이 쓰는 바이브코딩 툴 &quot;안티그래비티&quot; 출시! AI 에이전트 성능이 미쳤습니다\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/JvKo0WvwVEg\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">코딩툴만 보여주는 여상입니다.</p>\n<p data-ke-size=\"size16\">공짜일떄 빨리 사용해봅시다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "GEMINI 3 PRO 설명 영상\n영상: https://www.youtube.com/watch?v=YIV_URly8g0\n\n\n\n제미나이3 전반적인 설명이 있습니다.\n그후에\n \nGEMINI 3 PRO 코딩툴영상\n영상: https://www.youtube.com/watch?v=JvKo0WvwVEg&t=386s\n\n\n\n코딩툴만 보여주는 여상입니다.\n공짜일떄 빨리 사용해봅시다.",
        "guid": "https://serverdown.tistory.com/1488",
        "categories": [
          "유튜브",
          "Ai",
          "gemini",
          "제미나이"
        ],
        "isoDate": "2025-11-20T10:41:55.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "AI 업무에 활용하기 / 프롬프트 생성을 해보자 / 마스카라",
        "link": "https://serverdown.tistory.com/1487",
        "pubDate": "Thu, 20 Nov 2025 14:28:18 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1487#entry1487comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"445\" data-origin-height=\"264\"><span data-url=\"https://blog.kakaocdn.net/dn/CRKkM/dJMcaaDGM8k/dQYoENkMK6x7kUz4n48O41/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/CRKkM/dJMcaaDGM8k/dQYoENkMK6x7kUz4n48O41/img.png\"><img src=\"https://blog.kakaocdn.net/dn/CRKkM/dJMcaaDGM8k/dQYoENkMK6x7kUz4n48O41/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FCRKkM%2FdJMcaaDGM8k%2FdQYoENkMK6x7kUz4n48O41%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"445\" height=\"264\" data-origin-width=\"445\" data-origin-height=\"264\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">마스카라 프롬프트 생성 AI&nbsp; 써보자~</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=Mpk4LNZ_P4c\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=Mpk4LNZ_P4c</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=Mpk4LNZ_P4c\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/cfPmt2/hyZOgVwzpo/YS3FOR1PjiRdNXsUKT5tBk/img.jpg?width=1280&amp;height=720&amp;face=936_202_1076_354,https://scrap.kakaocdn.net/dn/KMCgz/hyZN8b70li/BlVhpOKfICfKmlGEJo0HU0/img.jpg?width=1280&amp;height=720&amp;face=936_202_1076_354\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"&lsquo;나는 왜 AI를 써도 좋은 보고서가 안 나올까?&rsquo; (김덕중 Firb AI연구소장)\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/Mpk4LNZ_P4c\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">엄청 길게 만들어준다고 합니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "마스카라 프롬프트 생성 AI  써보자~\n \n \n \n영상: https://www.youtube.com/watch?v=Mpk4LNZ_P4c\n\n\n\n엄청 길게 만들어준다고 합니다.",
        "guid": "https://serverdown.tistory.com/1487",
        "categories": [
          "유튜브",
          "Ai",
          "마스카라"
        ],
        "isoDate": "2025-11-20T05:28:18.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "AI 활용해 1인 기업에 도전하는 유튜버",
        "link": "https://serverdown.tistory.com/1486",
        "pubDate": "Thu, 20 Nov 2025 10:58:22 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1486#entry1486comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"195\" data-origin-height=\"190\"><span data-url=\"https://blog.kakaocdn.net/dn/bqtQOP/dJMcahCOAoX/ijgAoHLk3VxmkkPXn70zKK/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/bqtQOP/dJMcahCOAoX/ijgAoHLk3VxmkkPXn70zKK/img.png\"><img src=\"https://blog.kakaocdn.net/dn/bqtQOP/dJMcahCOAoX/ijgAoHLk3VxmkkPXn70zKK/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FbqtQOP%2FdJMcahCOAoX%2FijgAoHLk3VxmkkPXn70zKK%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"195\" height=\"190\" data-origin-width=\"195\" data-origin-height=\"190\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"708\" data-origin-height=\"194\"><span data-url=\"https://blog.kakaocdn.net/dn/Wras6/dJMcafyeq7S/rqCLb8x57Msnc4YZQda8l1/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/Wras6/dJMcafyeq7S/rqCLb8x57Msnc4YZQda8l1/img.png\"><img src=\"https://blog.kakaocdn.net/dn/Wras6/dJMcafyeq7S/rqCLb8x57Msnc4YZQda8l1/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FWras6%2FdJMcafyeq7S%2FrqCLb8x57Msnc4YZQda8l1%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"708\" height=\"194\" data-origin-width=\"708\" data-origin-height=\"194\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">용기 !</p>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=spb0p1p1C9k\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=spb0p1p1C9k</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=spb0p1p1C9k\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/reY0c/hyZNTHAx48/qiBZEd6aQYKt4CFsBy0SMk/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/jxHMw/hyZNPyqLCW/kxvShglJKqox0Xi8CU09RK/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"100일 동안 총 22개의 AI를 써봤습니다 | AI로 기획 분석 마케팅 디자인 자동화 개발까지\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/spb0p1p1C9k\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">모티브는 이것인가봅니다.</p>\n<p data-ke-size=\"size16\">\"샘 알트먼의 1인기업 유니콘 가능하다\"&nbsp;</p>\n<p data-ke-size=\"size16\">도전해봅시다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">AI 로 직원을 늘리는 방법</h2>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=Rn-35uzYBvI&amp;t=8s\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=Rn-35uzYBvI&amp;t=8s</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=Rn-35uzYBvI\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/bHNysr/hyZN6SY2qv/O6GKdgE7XTuH2LJAK5t0Rk/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/EgCz0/hyZNz2rdVg/rza7hXkKnwGlrr0O3pY0Gk/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"(코딩지식X) AI 에이전트팀 밤새 일시키고 돈되는 아이디어 해킹하게 만드는 법\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/Rn-35uzYBvI\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">이것은 다른 사람 영상입니다.</p>\n<p data-ke-size=\"size16\">AI 에이전트를 통해 특정 영역의 직원을 뽑을 수 있고 그들의 조언이나 관리를 받을 수 있습니다.</p>\n<p data-ke-size=\"size16\">이러면 사람 직원을 덜 뽑을 수 있겠죠</p>",
        "contentSnippet": "용기 !\n영상: https://www.youtube.com/watch?v=spb0p1p1C9k\n\n\n\n모티브는 이것인가봅니다.\n\"샘 알트먼의 1인기업 유니콘 가능하다\" \n도전해봅시다.\n \n \n \n \n \n \n \nAI 로 직원을 늘리는 방법\n영상: https://www.youtube.com/watch?v=Rn-35uzYBvI&t=8s\n\n\n\n이것은 다른 사람 영상입니다.\nAI 에이전트를 통해 특정 영역의 직원을 뽑을 수 있고 그들의 조언이나 관리를 받을 수 있습니다.\n이러면 사람 직원을 덜 뽑을 수 있겠죠",
        "guid": "https://serverdown.tistory.com/1486",
        "categories": [
          "유튜브",
          "Ai",
          "창업"
        ],
        "isoDate": "2025-11-20T01:58:22.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "(작성중) 원스토어에 게임 올려보자",
        "link": "https://serverdown.tistory.com/1485",
        "pubDate": "Wed, 19 Nov 2025 19:46:19 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1485#entry1485comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"327\" data-origin-height=\"248\"><span data-url=\"https://blog.kakaocdn.net/dn/ei8O2Z/dJMcahphmHf/VV3MMUBxRrggnHlOFf1s01/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/ei8O2Z/dJMcahphmHf/VV3MMUBxRrggnHlOFf1s01/img.png\"><img src=\"https://blog.kakaocdn.net/dn/ei8O2Z/dJMcahphmHf/VV3MMUBxRrggnHlOFf1s01/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2Fei8O2Z%2FdJMcahphmHf%2FVV3MMUBxRrggnHlOFf1s01%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"327\" height=\"248\" data-origin-width=\"327\" data-origin-height=\"248\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">어떻게 돌아가는지 알기위해 간단한 게임을 올려보겠습니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">가입</h2>\n<p data-ke-size=\"size16\">쉽습니다. 그냥 가입하면 되네요</p>\n<p data-ke-size=\"size16\">사업자등록증이 필요합니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">앱 추가</h2>\n<p data-ke-size=\"size16\">콘솔 링크:&nbsp;</p>\n<p data-ke-size=\"size16\">앱추가 버튼이 있습니다. 누르면 간단히 됩니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">앱 출시전 설정</h2>\n<p data-ke-size=\"size16\">상단에 [검증 요청] 메뉴가 있는데 여기 누란된 정보들이 표시 됩니다.</p>\n<p data-ke-size=\"size16\">요구사항을 보면서 하나씩 완료 하시면 됩니다.</p>\n<p data-ke-size=\"size16\">원스토어는 조건이 매우 덜 까다롭습니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">앱 업데이트</h2>\n<p data-ke-size=\"size16\">[신규 바이너리 업데이트] 라는 메뉴에 업로드 버튼이 있습니다.</p>\n<p data-ke-size=\"size16\">올리면 검증 시간이 걸린다고 합니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">앱 검증</h2>\n<p data-ke-size=\"size16\">검증을 진짜로 하나봅니다.</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"973\" data-origin-height=\"294\"><span data-url=\"https://blog.kakaocdn.net/dn/bdr5Ad/dJMcacIg09Z/t1ZRdcDA6FkzeO4uvCslhK/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/bdr5Ad/dJMcacIg09Z/t1ZRdcDA6FkzeO4uvCslhK/img.png\"><img src=\"https://blog.kakaocdn.net/dn/bdr5Ad/dJMcacIg09Z/t1ZRdcDA6FkzeO4uvCslhK/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2Fbdr5Ad%2FdJMcacIg09Z%2Ft1ZRdcDA6FkzeO4uvCslhK%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"973\" height=\"294\" data-origin-width=\"973\" data-origin-height=\"294\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">요류가 떻고 사유로 \"게임 플레이 불가능\" 이 라고 적혀있군요 ㄷㄷㄷ</p>\n<p data-ke-size=\"size16\">사람이 해보나봅니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">검증 성공</h2>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"800\" data-origin-height=\"254\"><span data-url=\"https://blog.kakaocdn.net/dn/zCxtS/dJMcadtBlEd/kDNcdu2asXLkUSSoPBTeOk/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/zCxtS/dJMcadtBlEd/kDNcdu2asXLkUSSoPBTeOk/img.png\"><img src=\"https://blog.kakaocdn.net/dn/zCxtS/dJMcadtBlEd/kDNcdu2asXLkUSSoPBTeOk/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FzCxtS%2FdJMcadtBlEd%2FkDNcdu2asXLkUSSoPBTeOk%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"800\" height=\"254\" data-origin-width=\"800\" data-origin-height=\"254\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">검증이 완료 되면 이메일로도 오고</p>\n<p data-ke-size=\"size16\">콘솔 페이지에서도 보입니다.</p>\n<p data-ke-size=\"size16\">근무시간이 되면 처리해주나봅니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">배포하기</h2>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"309\" data-origin-height=\"264\"><span data-url=\"https://blog.kakaocdn.net/dn/l4x4i/dJMcabP8cF0/fVq02GCqZlVhEeZXwOfook/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/l4x4i/dJMcabP8cF0/fVq02GCqZlVhEeZXwOfook/img.png\"><img src=\"https://blog.kakaocdn.net/dn/l4x4i/dJMcabP8cF0/fVq02GCqZlVhEeZXwOfook/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2Fl4x4i%2FdJMcabP8cF0%2FfVq02GCqZlVhEeZXwOfook%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"309\" height=\"264\" data-origin-width=\"309\" data-origin-height=\"264\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">콘솔에서 앱을 고르면 죄측에 [검증 요청] -&gt; [배포 관리] 로 바껴있군요</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"1032\" data-origin-height=\"79\"><span data-url=\"https://blog.kakaocdn.net/dn/dwM1RP/dJMcafdVH5b/lkZ5xHNAdbmsYx3SdKZj5k/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/dwM1RP/dJMcafdVH5b/lkZ5xHNAdbmsYx3SdKZj5k/img.png\"><img src=\"https://blog.kakaocdn.net/dn/dwM1RP/dJMcafdVH5b/lkZ5xHNAdbmsYx3SdKZj5k/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FdwM1RP%2FdJMcafdVH5b%2FlkZ5xHNAdbmsYx3SdKZj5k%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"1032\" height=\"79\" data-origin-width=\"1032\" data-origin-height=\"79\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">우측 상단에 [판매&nbsp; 대기] 였나를 [판매중] 으로 바꿔주면 출시됩니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"981\" data-origin-height=\"356\"><span data-url=\"https://blog.kakaocdn.net/dn/COHg7/dJMcahQlNkL/KRUTCHSXyfCk9d7NmhAm10/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/COHg7/dJMcahQlNkL/KRUTCHSXyfCk9d7NmhAm10/img.png\"><img src=\"https://blog.kakaocdn.net/dn/COHg7/dJMcahQlNkL/KRUTCHSXyfCk9d7NmhAm10/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FCOHg7%2FdJMcahQlNkL%2FKRUTCHSXyfCk9d7NmhAm10%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"981\" height=\"356\" data-origin-width=\"981\" data-origin-height=\"356\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">배포 정보에 가면 출시 국가가 있는데 잘몰라서 모든 국가에 다 출시 눌렀습니다.<br />(용기 보소)</p>\n<p data-ke-size=\"size16\">바꾸고 나면 다시 [검증 요청] 보내야하나는거 같습니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">원스토어 링크: <a href=\"https://m.onestore.co.kr/v2/ko-kr/app/0001002923\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://m.onestore.co.kr/v2/ko-kr/app/0001002923</a></p>\n<figure id=\"og_1763603532203\" contenteditable=\"false\" data-ke-type=\"opengraph\" data-ke-align=\"alignCenter\" data-og-type=\"website\" data-og-title=\"122 쉬운게임 - 원스토어\" data-og-description=\"간단히 플레이 하는 플록 게임\" data-og-host=\"m.onestore.co.kr\" data-og-source-url=\"https://m.onestore.co.kr/v2/ko-kr/app/0001002923\" data-og-url=\"https://m.onestore.co.kr/v2/ko-kr/app/0001002923\" data-og-image=\"https://scrap.kakaocdn.net/dn/bbmuHe/hyZNYISf3w/F8WUZ9Q1BJxQcAgkDCC8jK/img.png?width=1024&amp;height=578&amp;face=0_0_1024_578,https://scrap.kakaocdn.net/dn/kQr1a/hyZNLuZd1s/UurE6ec9a2LRA6nw2tCIo1/img.png?width=1024&amp;height=578&amp;face=0_0_1024_578\"><a href=\"https://m.onestore.co.kr/v2/ko-kr/app/0001002923\" target=\"_blank\" rel=\"noopener\" data-source-url=\"https://m.onestore.co.kr/v2/ko-kr/app/0001002923\">\n<div class=\"og-image\" style=\"background-image: url('https://scrap.kakaocdn.net/dn/bbmuHe/hyZNYISf3w/F8WUZ9Q1BJxQcAgkDCC8jK/img.png?width=1024&amp;height=578&amp;face=0_0_1024_578,https://scrap.kakaocdn.net/dn/kQr1a/hyZNLuZd1s/UurE6ec9a2LRA6nw2tCIo1/img.png?width=1024&amp;height=578&amp;face=0_0_1024_578');\">&nbsp;</div>\n<div class=\"og-text\">\n<p class=\"og-title\" data-ke-size=\"size16\">122 쉬운게임 - 원스토어</p>\n<p class=\"og-desc\" data-ke-size=\"size16\">간단히 플레이 하는 플록 게임</p>\n<p class=\"og-host\" data-ke-size=\"size16\">m.onestore.co.kr</p>\n</div>\n</a></figure>\n<p data-ke-size=\"size16\">다운이랑 리뷰 부탁드려요&nbsp;</p>\n<p data-ke-size=\"size16\">리뷰하는 기능이 있는지는 잘 모르겠군요</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "어떻게 돌아가는지 알기위해 간단한 게임을 올려보겠습니다.\n \n가입\n쉽습니다. 그냥 가입하면 되네요\n사업자등록증이 필요합니다.\n \n앱 추가\n콘솔 링크: \n앱추가 버튼이 있습니다. 누르면 간단히 됩니다.\n \n앱 출시전 설정\n상단에 [검증 요청] 메뉴가 있는데 여기 누란된 정보들이 표시 됩니다.\n요구사항을 보면서 하나씩 완료 하시면 됩니다.\n원스토어는 조건이 매우 덜 까다롭습니다.\n \n앱 업데이트\n[신규 바이너리 업데이트] 라는 메뉴에 업로드 버튼이 있습니다.\n올리면 검증 시간이 걸린다고 합니다.\n \n \n앱 검증\n검증을 진짜로 하나봅니다.\n\n\n요류가 떻고 사유로 \"게임 플레이 불가능\" 이 라고 적혀있군요 ㄷㄷㄷ\n사람이 해보나봅니다.\n \n검증 성공\n\n\n검증이 완료 되면 이메일로도 오고\n콘솔 페이지에서도 보입니다.\n근무시간이 되면 처리해주나봅니다.\n \n \n배포하기\n\n\n콘솔에서 앱을 고르면 죄측에 [검증 요청] -> [배포 관리] 로 바껴있군요\n \n\n\n우측 상단에 [판매  대기] 였나를 [판매중] 으로 바꿔주면 출시됩니다.\n \n\n\n배포 정보에 가면 출시 국가가 있는데 잘몰라서 모든 국가에 다 출시 눌렀습니다.\n(용기 보소)\n바꾸고 나면 다시 [검증 요청] 보내야하나는거 같습니다.\n \n원스토어 링크: https://m.onestore.co.kr/v2/ko-kr/app/0001002923\n\n \n122 쉬운게임 - 원스토어\n간단히 플레이 하는 플록 게임\nm.onestore.co.kr\n\n다운이랑 리뷰 부탁드려요 \n리뷰하는 기능이 있는지는 잘 모르겠군요",
        "guid": "https://serverdown.tistory.com/1485",
        "categories": [
          "프로그래밍/자작",
          "원스토어",
          "인디게임"
        ],
        "isoDate": "2025-11-19T10:46:19.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "AI 를 업무에 활용하는 방법 / 전문가 에이전트",
        "link": "https://serverdown.tistory.com/1484",
        "pubDate": "Wed, 19 Nov 2025 18:18:26 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1484#entry1484comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"429\" data-origin-height=\"237\"><span data-url=\"https://blog.kakaocdn.net/dn/daMV1u/dJMcaacCjwY/WIZh5GqfUPvE4vHIVKgHNk/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/daMV1u/dJMcaacCjwY/WIZh5GqfUPvE4vHIVKgHNk/img.png\"><img src=\"https://blog.kakaocdn.net/dn/daMV1u/dJMcaacCjwY/WIZh5GqfUPvE4vHIVKgHNk/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FdaMV1u%2FdJMcaacCjwY%2FWIZh5GqfUPvE4vHIVKgHNk%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"429\" height=\"237\" data-origin-width=\"429\" data-origin-height=\"237\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">AI 를 이런식으로 이용할 수 가있군요</p>\n<p data-ke-size=\"size16\">AI 마다 전문 영역화 룰을 지정한후에</p>\n<p data-ke-size=\"size16\">내가 하려는 행동에 대해 물어봅니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">내 업무를 보고 판단할 사람도 미리만들고</p>\n<p data-ke-size=\"size16\">효율성 따지는 사람</p>\n<p data-ke-size=\"size16\">빠른일 좋아하는 사람</p>\n<p data-ke-size=\"size16\">등의 각자의 역활을 지정하고</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">내가 하려는 일을 미리 물어보면</p>\n<p data-ke-size=\"size16\">일을하기전에 미리 대답을 들을 수 있습니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">한두번 확인 작업을 거치면 완벽한 준비를 알 수 있을 것입니다.</p>\n<p data-ke-size=\"size16\">상관에게 자주 컴펌-빠꾸를 반복하면 짜증을 유발 할 수 있기 때문입니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=Rn-35uzYBvI\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=Rn-35uzYBvI</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=Rn-35uzYBvI\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/b91lYq/hyZNILHtRC/rNb1BANxO3pe44wPjEk9rK/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/V91KV/hyZNJcMTvK/qQugq8txBdXWYfFXke8kQ1/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"(코딩지식X) AI 에이전트팀 밤새 일시키고 돈되는 아이디어 해킹하게 만드는 법\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/Rn-35uzYBvI\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">1분 30초에 나옵니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "AI 를 이런식으로 이용할 수 가있군요\nAI 마다 전문 영역화 룰을 지정한후에\n내가 하려는 행동에 대해 물어봅니다.\n \n내 업무를 보고 판단할 사람도 미리만들고\n효율성 따지는 사람\n빠른일 좋아하는 사람\n등의 각자의 역활을 지정하고\n \n내가 하려는 일을 미리 물어보면\n일을하기전에 미리 대답을 들을 수 있습니다.\n \n한두번 확인 작업을 거치면 완벽한 준비를 알 수 있을 것입니다.\n상관에게 자주 컴펌-빠꾸를 반복하면 짜증을 유발 할 수 있기 때문입니다.\n \n영상: https://www.youtube.com/watch?v=Rn-35uzYBvI\n\n\n\n1분 30초에 나옵니다.",
        "guid": "https://serverdown.tistory.com/1484",
        "isoDate": "2025-11-19T09:18:26.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "GEMINI 3 PRO 발표 요약",
        "link": "https://serverdown.tistory.com/1483",
        "pubDate": "Wed, 19 Nov 2025 14:59:32 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1483#entry1483comment",
        "content": "<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"414\" data-origin-height=\"232\"><span data-url=\"https://blog.kakaocdn.net/dn/0g5ic/dJMcacIgVu4/lGeeHa1mld1aQj0XLkVfF1/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/0g5ic/dJMcacIgVu4/lGeeHa1mld1aQj0XLkVfF1/img.png\"><img src=\"https://blog.kakaocdn.net/dn/0g5ic/dJMcacIgVu4/lGeeHa1mld1aQj0XLkVfF1/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2F0g5ic%2FdJMcacIgVu4%2FlGeeHa1mld1aQj0XLkVfF1%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"414\" height=\"232\" data-origin-width=\"414\" data-origin-height=\"232\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">영상: <a href=\"https://www.youtube.com/watch?v=YIV_URly8g0\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.youtube.com/watch?v=YIV_URly8g0</a></p>\n<figure data-ke-type=\"video\" data-ke-style=\"alignCenter\" data-video-host=\"youtube\" data-video-url=\"https://www.youtube.com/watch?v=YIV_URly8g0\" data-video-thumbnail=\"https://scrap.kakaocdn.net/dn/uM80z/hyZN4m1uFs/N4Il4n0K5TpMPQdYAcmwm0/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720,https://scrap.kakaocdn.net/dn/bAQszz/hyZNNHcXaf/BXuGDAxWehxKoswcA4vEtK/img.jpg?width=1280&amp;height=720&amp;face=0_0_1280_720\" data-video-width=\"860\" data-video-height=\"484\" data-video-origin-width=\"860\" data-video-origin-height=\"484\" data-ke-mobilestyle=\"widthContent\" data-video-title=\"제미나이 3 프로 출시! 챗GPT와 기존모델 압살한 현존 지구 최강모델\" data-original-url=\"\"><iframe src=\"https://www.youtube.com/embed/YIV_URly8g0\" width=\"860\" height=\"484\" frameborder=\"\" allowfullscreen=\"true\"></iframe>\n<figcaption style=\"display: none;\"></figcaption>\n</figure>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">요약</p>\n<p data-ke-size=\"size16\">멀티모달이다. 화면을 보고 이해하는 능력이 올라감</p>\n<p data-ke-size=\"size16\">코딩툴을 웹페이지에 내장했다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">이정도가 핵심인거 같습니다.</p>\n<p data-ke-size=\"size16\">결국 AI 가 화면을 이해하면 스마트폰을 타치할 필요없이 말로 처리가 가능해질 것입니다.</p>\n<p data-ke-size=\"size16\">코딩툴이 통합됨에 따라 자동 개발 능력이 향상될 것입니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "영상: https://www.youtube.com/watch?v=YIV_URly8g0\n\n\n\n \n요약\n멀티모달이다. 화면을 보고 이해하는 능력이 올라감\n코딩툴을 웹페이지에 내장했다.\n \n이정도가 핵심인거 같습니다.\n결국 AI 가 화면을 이해하면 스마트폰을 타치할 필요없이 말로 처리가 가능해질 것입니다.\n코딩툴이 통합됨에 따라 자동 개발 능력이 향상될 것입니다.",
        "guid": "https://serverdown.tistory.com/1483",
        "categories": [
          "유튜브",
          "Ai",
          "구글"
        ],
        "isoDate": "2025-11-19T05:59:32.000Z"
      },
      {
        "creator": "SIDNFT",
        "title": "2025-11-18 / MDD 10% 도달 / 약간 사보겠습니다.",
        "link": "https://serverdown.tistory.com/1482",
        "pubDate": "Tue, 18 Nov 2025 20:42:33 +0900",
        "author": "SIDNFT",
        "comments": "https://serverdown.tistory.com/1482#entry1482comment",
        "content": "<h2 data-ke-size=\"size26\">내 상황</h2>\n<p data-ke-size=\"size16\">MDD 10% 는 자산이 최고가에서 -10% 떨어졌다는 뜻입니다.</p>\n<p data-ke-size=\"size16\">1억 가지고 있었다면 9천이 된상태입니다.</p>\n<p data-ke-size=\"size16\">현금은 가만히 뒀는데 5% -&gt; 6.5% 로 비증이 늘었습니다.</p>\n<p data-ke-size=\"size16\">이제 20% 정도 현금을 써서 매수 들어가야합니다.</p>\n<p data-ke-size=\"size16\">바닥이 아닐 수 있기 때문에 현금을 남겨둬야합니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">각종 공포지수 보는 페이지</h2>\n<p data-ke-size=\"size16\">링크: <a href=\"https://www.marketcycleview.com/ko\" target=\"_blank\" rel=\"noopener&nbsp;noreferrer\">https://www.marketcycleview.com/ko</a></p>\n<figure id=\"og_1763466115496\" contenteditable=\"false\" data-ke-type=\"opengraph\" data-ke-align=\"alignCenter\" data-og-type=\"website\" data-og-title=\"MCV - 시장 심리 분석 플랫폼 | 투자 심리지표, 모멘텀 투자\" data-og-description=\"시장 심리를 분석하여 더 나은 투자 결정을 내리세요. 모멘텀 투자, 대통령 사이클, 계절성 분석, 인간지표 등 다양한 투자 도구를 제공합니다.\" data-og-host=\"www.marketcycleview.com\" data-og-source-url=\"https://www.marketcycleview.com/ko\" data-og-url=\"https://www.marketcycleview.com/ko\" data-og-image=\"https://scrap.kakaocdn.net/dn/dqsXw8/hyZN57aVFw/rWxkdBfESNqejQp8BWb7e1/img.png?width=1024&amp;height=1024&amp;face=0_0_1024_1024\"><a href=\"https://www.marketcycleview.com/ko\" target=\"_blank\" rel=\"noopener\" data-source-url=\"https://www.marketcycleview.com/ko\">\n<div class=\"og-image\" style=\"background-image: url('https://scrap.kakaocdn.net/dn/dqsXw8/hyZN57aVFw/rWxkdBfESNqejQp8BWb7e1/img.png?width=1024&amp;height=1024&amp;face=0_0_1024_1024');\">&nbsp;</div>\n<div class=\"og-text\">\n<p class=\"og-title\" data-ke-size=\"size16\">MCV - 시장 심리 분석 플랫폼 | 투자 심리지표, 모멘텀 투자</p>\n<p class=\"og-desc\" data-ke-size=\"size16\">시장 심리를 분석하여 더 나은 투자 결정을 내리세요. 모멘텀 투자, 대통령 사이클, 계절성 분석, 인간지표 등 다양한 투자 도구를 제공합니다.</p>\n<p class=\"og-host\" data-ke-size=\"size16\">www.marketcycleview.com</p>\n</div>\n</a></figure>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<h2 data-ke-size=\"size26\">CNN 공포 탐욕 지수</h2>\n<p><figure class=\"imageblock alignCenter\" data-ke-mobileStyle=\"widthOrigin\" data-origin-width=\"274\" data-origin-height=\"205\"><span data-url=\"https://blog.kakaocdn.net/dn/cTv9Hq/dJMcafSwBF8/62DhPdvFQeOFKK3tDsDXu0/img.png\" data-phocus=\"https://blog.kakaocdn.net/dn/cTv9Hq/dJMcafSwBF8/62DhPdvFQeOFKK3tDsDXu0/img.png\"><img src=\"https://blog.kakaocdn.net/dn/cTv9Hq/dJMcafSwBF8/62DhPdvFQeOFKK3tDsDXu0/img.png\" srcset=\"https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2FcTv9Hq%2FdJMcafSwBF8%2F62DhPdvFQeOFKK3tDsDXu0%2Fimg.png\" onerror=\"this.onerror=null; this.src='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png'; this.srcset='//t1.daumcdn.net/tistory_admin/static/images/no-image-v1.png';\" loading=\"lazy\" width=\"274\" height=\"205\" data-origin-width=\"274\" data-origin-height=\"205\"/></span></figure>\n</p>\n<p data-ke-size=\"size16\">CNN 공포지수 인데요 13이면 많이 떨어졌다고 보시면됩니다.</p>\n<p data-ke-size=\"size16\">이번 불장에서 80 정도까지 올라갔다 떨어진 것입니다.</p>\n<p data-ke-size=\"size16\">전체 사람들중 87% 는 공포에 질린 상태라고 보시면 됩니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>\n<p data-ke-size=\"size16\">무섭지만 매수 할 시점입니다.</p>\n<p data-ke-size=\"size16\">&nbsp;</p>",
        "contentSnippet": "내 상황\nMDD 10% 는 자산이 최고가에서 -10% 떨어졌다는 뜻입니다.\n1억 가지고 있었다면 9천이 된상태입니다.\n현금은 가만히 뒀는데 5% -> 6.5% 로 비증이 늘었습니다.\n이제 20% 정도 현금을 써서 매수 들어가야합니다.\n바닥이 아닐 수 있기 때문에 현금을 남겨둬야합니다.\n \n \n각종 공포지수 보는 페이지\n링크: https://www.marketcycleview.com/ko\n\n \nMCV - 시장 심리 분석 플랫폼 | 투자 심리지표, 모멘텀 투자\n시장 심리를 분석하여 더 나은 투자 결정을 내리세요. 모멘텀 투자, 대통령 사이클, 계절성 분석, 인간지표 등 다양한 투자 도구를 제공합니다.\nwww.marketcycleview.com\n\n \n \nCNN 공포 탐욕 지수\n\n\nCNN 공포지수 인데요 13이면 많이 떨어졌다고 보시면됩니다.\n이번 불장에서 80 정도까지 올라갔다 떨어진 것입니다.\n전체 사람들중 87% 는 공포에 질린 상태라고 보시면 됩니다.\n \n무섭지만 매수 할 시점입니다.",
        "guid": "https://serverdown.tistory.com/1482",
        "categories": [
          "유튜브",
          "자산관리"
        ],
        "isoDate": "2025-11-18T11:42:33.000Z"
      }
    ]
  },
  {
    "name": "coolspeed",
    "category": "개인",
    "posts": []
  },
  {
    "name": "오늘도 끄적끄적",
    "category": "개인",
    "posts": []
  },
  {
    "name": "dx11 Vanica's Lifelog - 夢が夢で終わらないように",
    "category": "개인",
    "posts": []
  },
  {
    "name": "초코사랑",
    "category": "개인",
    "posts": []
  },
  {
    "name": "ZeroCho Blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "imays게임엔진개발자",
    "category": "개인",
    "posts": []
  },
  {
    "name": "RSS feed for hurinmon Blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "기억보단 기록을",
    "category": "개인",
    "posts": []
  },
  {
    "name": "WestwoodForever's Dev Log",
    "category": "개인",
    "posts": []
  },
  {
    "name": "허니몬(Honeymon)의 자바guru",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Wolf Loves Fox :: 일상",
    "category": "개인",
    "posts": []
  },
  {
    "name": "Game Programmer Life",
    "category": "개인",
    "posts": []
  },
  {
    "name": "yuchi's dev",
    "category": "개인",
    "posts": [
      {
        "creator": "megayuchi",
        "title": "인프런에 socket프로그래밍 강좌 올렸습니다.",
        "link": "https://megayuchi.com/2025/11/17/%ec%9d%b8%ed%94%84%eb%9f%b0%ec%97%90-socket%ed%94%84%eb%a1%9c%ea%b7%b8%eb%9e%98%eb%b0%8d-%ea%b0%95%ec%a2%8c-%ec%98%ac%eb%a0%b8%ec%8a%b5%eb%8b%88%eb%8b%a4/",
        "pubDate": "Mon, 17 Nov 2025 07:21:06 +0000",
        "content:encodedSnippet": "“온라인 게임 개발을 위한 socket 프로그래밍”이라는 제목으로 11챕터짜리 강좌를 올렸습니다.\nsocket프로그래밍에 경험이 없지만 본인 프로젝트에 네트워크를 붙이고 싶으신 분들에게 도움이 되리라 생각합니다.\n인프런에서 검색하지 마시고 아래의 링크를 클릭해서 구입해주시면 제게 경제적으로 조금 더 도움이 됩니다.\n온라인 게임 개발을 위한 socket 프로그래밍– https://inf.run/NPjP6\n다른 강의들도 도움이 될 수 있으므로 살펴보시기 바랍니다.\nD3D12프로그래밍 기초편 – https://inf.run/WYdms\nD3D12프로그래밍 기초플러스 – https://inf.run/dW4QZ\nDirectX Raytracing 프로그래밍 – https://inf.run/ovHNq\nWindows System 프로그래밍 – https://inf.run/JQMeC\nWindows Debugging Tips – https://inf.run/8TtQv",
        "dc:creator": "megayuchi",
        "comments": "https://megayuchi.com/2025/11/17/%ec%9d%b8%ed%94%84%eb%9f%b0%ec%97%90-socket%ed%94%84%eb%a1%9c%ea%b7%b8%eb%9e%98%eb%b0%8d-%ea%b0%95%ec%a2%8c-%ec%98%ac%eb%a0%b8%ec%8a%b5%eb%8b%88%eb%8b%a4/#respond",
        "content": "&#8220;온라인 게임 개발을 위한 socket 프로그래밍&#8221;이라는 제목으로 11챕터짜리 강좌를 올렸습니다.socket프로그래밍에 경험이 없지만 본인 프로젝트에 네트워크를 붙이고 싶으신 분들에게 도움이 되리라 생각합니다.인프런에서 검색하지 마시고 아래의 링크를 클릭해서 구입해주시면 제게 경제적으로 조금 더 도움이 됩니다. 온라인 게임 개발을 위한 socket 프로그래밍&#8211; https://inf.run/NPjP6 다른 강의들도 도움이 될 수 있으므로 살펴보시기 바랍니다. D3D12프로그래밍 기초편 &#8211; https://inf.run/WYdmsD3D12프로그래밍 기초플러스 &#8211; https://inf.run/dW4QZDirectX &#8230; <a class=\"more-link\" href=\"https://megayuchi.com/2025/11/17/%ec%9d%b8%ed%94%84%eb%9f%b0%ec%97%90-socket%ed%94%84%eb%a1%9c%ea%b7%b8%eb%9e%98%eb%b0%8d-%ea%b0%95%ec%a2%8c-%ec%98%ac%eb%a0%b8%ec%8a%b5%eb%8b%88%eb%8b%a4/\">More <span class=\"screen-reader-text\">인프런에 socket프로그래밍 강좌&#160;올렸습니다.</span></a>",
        "contentSnippet": "“온라인 게임 개발을 위한 socket 프로그래밍”이라는 제목으로 11챕터짜리 강좌를 올렸습니다.socket프로그래밍에 경험이 없지만 본인 프로젝트에 네트워크를 붙이고 싶으신 분들에게 도움이 되리라 생각합니다.인프런에서 검색하지 마시고 아래의 링크를 클릭해서 구입해주시면 제게 경제적으로 조금 더 도움이 됩니다. 온라인 게임 개발을 위한 socket 프로그래밍– https://inf.run/NPjP6 다른 강의들도 도움이 될 수 있으므로 살펴보시기 바랍니다. D3D12프로그래밍 기초편 – https://inf.run/WYdmsD3D12프로그래밍 기초플러스 – https://inf.run/dW4QZDirectX … More 인프런에 socket프로그래밍 강좌 올렸습니다.",
        "guid": "http://megayuchi.com/?p=7200",
        "categories": [
          "Development",
          "Pub",
          "Game Development",
          "Game Engine Development",
          "socket",
          "winsock"
        ],
        "isoDate": "2025-11-17T07:21:06.000Z"
      }
    ]
  },
  {
    "name": "만화로 나누는 자유/오픈소스 소프트웨어 이야기",
    "category": "개인",
    "posts": []
  },
  {
    "name": "신현석(Hyeonseok Shin)",
    "category": "개인",
    "posts": []
  },
  {
    "name": "개발자 울이 노트",
    "category": "개인",
    "posts": []
  },
  {
    "name": "즐거운 개발자 :: 네이버  블로그",
    "category": "개인",
    "posts": []
  },
  {
    "name": "황제펭귄의 게임개발이야기 [여기는 한국]",
    "category": "개인",
    "posts": []
  },
  {
    "name": "LINE ENGINEERING",
    "category": "기업",
    "posts": [
      {
        "title": "Central Dogma 컨트롤 플레인으로 LY Corporation의 수천 개 서비스를 연결하기",
        "link": "https://techblog.lycorp.co.jp/ko/connecting-thousands-of-services-with-central-dogma-control-plane",
        "pubDate": "Fri, 21 Nov 2025 06:30:00 GMT",
        "content": "이 글은 Tech-Verse 2025에서 발표된 Central Dogma Control Plane으로 LY Corporation의 수천 개 서비스를 연결하기 세션을 글로 옮긴 것입...",
        "contentSnippet": "이 글은 Tech-Verse 2025에서 발표된 Central Dogma Control Plane으로 LY Corporation의 수천 개 서비스를 연결하기 세션을 글로 옮긴 것입...",
        "guid": "https://techblog.lycorp.co.jp/ko/connecting-thousands-of-services-with-central-dogma-control-plane",
        "isoDate": "2025-11-21T06:30:00.000Z"
      },
      {
        "title": "코드 품질 개선 기법 24편: 유산의 가치",
        "link": "https://techblog.lycorp.co.jp/ko/techniques-for-improving-code-quality-24",
        "pubDate": "Fri, 21 Nov 2025 02:00:00 GMT",
        "content": "이 글은 2024년 5월 9일에 일본어로 먼저 발행된 기사를 번역한 글입니다.LY Corporation은 높은 개발 생산성을 유지하기 위해 코드 품질 및 개발 문화 개선에 힘쓰고 ...",
        "contentSnippet": "이 글은 2024년 5월 9일에 일본어로 먼저 발행된 기사를 번역한 글입니다.LY Corporation은 높은 개발 생산성을 유지하기 위해 코드 품질 및 개발 문화 개선에 힘쓰고 ...",
        "guid": "https://techblog.lycorp.co.jp/ko/techniques-for-improving-code-quality-24",
        "isoDate": "2025-11-21T02:00:00.000Z"
      }
    ]
  },
  {
    "name": "뱅크샐러드 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "우아한형제들 기술 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "TOAST Meetup",
    "category": "기업",
    "posts": []
  },
  {
    "name": "ZUM 기술 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "SK Planet",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Spoqa tech blog",
    "category": "기업",
    "posts": []
  },
  {
    "name": "팀 왈도 번역팀",
    "category": "게임",
    "posts": []
  },
  {
    "name": "근원님",
    "category": "개인",
    "posts": []
  },
  {
    "name": "호돌맨",
    "category": "개인",
    "posts": []
  },
  {
    "name": "박우빈",
    "category": "개인",
    "posts": []
  },
  {
    "name": "문다영",
    "category": "개인",
    "posts": []
  },
  {
    "name": "유수민",
    "category": "개인",
    "posts": []
  },
  {
    "name": "안건주",
    "category": "개인",
    "posts": []
  },
  {
    "name": "손현호",
    "category": "개인",
    "posts": []
  },
  {
    "name": "STARTUP BIBLE",
    "category": "개인",
    "posts": [
      {
        "creator": "Kihong Bae",
        "title": "소비자 DNA",
        "link": "https://www.thestartupbible.com/2025/11/koreas-consumer-dna.html",
        "pubDate": "Sun, 23 Nov 2025 21:21:00 +0000",
        "content:encodedSnippet": "2주 전에 잠깐 동경에 갔었는데, 과거부터 친분이 있던 일본 VC들과 다양한 이야기를 했다. 자연스럽게 한국과 일본의 스타트업 생태계 이야기를 특히 많이 했는데, 한국에 집중적으로 투자하는 나 같은 VC는 당연히 일본 시장보단 한국 스타트업 시장이 더 좋다고 믿지만, 내가 만난 일본 VC들도 대부분 한국의 벤처생태계를 부러워하는 느낌을 강하게 받았다. 어떤 일본 VC는 대놓고 나에게 한국 벤처생태계를 볼 때마다 너무나 부럽고, 일본도 한국 시장과 창업가들로부터 A부터 Z까지 모든 걸 적극적으로 배워야 한다고 주장했다.\n일본의 상장 시장의 크기는 한국의 3.5배 정도가 된다. 상당히 크고, 난 한국이 조만간 일본의 상장 시장 규모를 뛰어넘을 것이라고 확신하지만 현재의 이 규모는 상당히 부럽다. 그런데 내가 만난 일본 VC들은 오히려 한국의 역동적이고 큰 IPO 시장이 부럽다고 이야기했다. 무슨 말인지 더 구체적으로 물어보니, 일본의 상장 시장은 크지만, 자세히 보면 tech IPO는 질보단 양으로 만들어지고 있다는 게 이들의 답변이다. 한국 창업가들은 꿈과 야망이 상대적으로 커서 항상 아주 큰 IPO를 꿈꾸면서 사업을 하는데 – 물론, 그렇다고 IPO를 다 하는 것도 아니고, 해도 큰 IPO가 되는 건 아니지만 – 일본 창업가들은 사업하다가 어느 시점에 그냥 작은 IPO를 하는 게 요샌 유행같이 번지고 있다고 했다. 한 1,000억 정도의 IPO를 하면 창업가들은 그래도 잘 먹고 잘살 수 있고, 일본에서 이런 작은 IPO를 하는 게 상대적으로 쉽기 때문에 너도나도 적당한 규모로 사업을 키우고 IPO를 한다고 들었다. 창업가들은 돈을 벌어서 좋지만, 이 회사에 투자한 VC는 큰 재미를 못 보고, 계속 창업가들의 꿈과 야망이 이렇게 줄어들면 일본 스타트업 생태계는 큰 성장을 할 수 없다는 우려를 대화 내내 표시했다. 정확하게 “작은 IPO가 하나씩 될 때마다 일본 창업가들의 야망도 하나씩 줄어드는 것 같다.”라는 말을 했는데, 곰곰이 생각해 보면 일리가 있는 말 같다.\n그리고 일본 VC들로부터 내가 반복적으로 들었던 주제이자, 이들이 한국에 대해서 가장 부러워하는 게 한국인들의 “소비자 DNA(Consumer DNA)”였다. 한국 시장엔 소비자 DNA가 매우 강하게 자리 잡고 있는데, 이는 우리가 네이버, 쿠팡, 카카오, 토스, 당근, 배달의 민족 등과 같은 좋은 자체 B2C 유니콘을 끊임없이 만들고 제품화할 수 있는 이유다. 그리고 계속 이렇게 좋은 소비자 제품들이 시장에 출시되면, 한국인 특유의 경쟁심과 질투가 발동하면서 계속 더 좋은 기능, 더 좋은 UI/UX, 더 좋은 가격의 경쟁 제품들이 나오면서 “양이 질을 만드는” 효과가 극대화된다.\n일본은 이 소비자 DNA가 점점 더 사라져서 이젠 거의 없다는 이야기를 들었다. 일본 창업가들은 대부분 B2B에만 집중하기 때문에 일본을 대표하는 일본의 B2C 제품이 한국과 같이 많지도 않고 다양하지도 않다. 하지만, 인구도 많고 시장이 크기 때문에 일본의 소비자 시장은 외국 회사들의 놀이터가 됐다. 검색은 구글, 동영상은 유튜브, 지도는 구글맵스, 이커머스는 아마존, 택시 호출은 우버 등, 일본을 지배하고 있는 대부분의 B2C 제품은 외산 제품들이다. 그러면서 내가 들었던 말은 일본은 전 세계에서 외국 B2C 소프트웨어 회사들이 가장 쉽게 진출할 수 있는, 가장 큰 시장이 될 것이고됐고, 이들은 일본의 소비자 DNA가 완전히 사라지는 것에 대한 걱정과 아쉬움을 많이 표시했다.\n그리고 한국은 여기서 멈추지 않고 계속 진화하고 발전하고 있다. 우리만의 소비자 DNA를 기반으로 케이팝, 케이푸드, 케이뷰티, 케이콘텐츠와 같은 새로운 무형의 소비자 DNA가 만들어지고 있고, 이 무형의 한국의 문화가 현재 일본 시장을 완전히 쓰나미같이 덮치고 있다. 실은 일본도 한 때는 다른 나라의 문화에 큰 영향을 미쳤는데, 지금은 이게 다 죽었고, 오히려 한국 문화가 과거 일본 문화보다 더 커지고 있는데, 이게 모두 다 일본의 소비자 DNA의 소멸로 인한 아주 좋지 않은 결과라는 결론을 이분은 내렸다.\n물론, 한두 명의 일본 VC가 일본과 한국의 시장을 아주 정확하게 파악하는 것도 아니고, 시장 현황을 일반화할 수도 없지만, 10년 넘게 일본에서 투자하고 있는 VC들에게 이날 내가 들었던 내용만을 기반으로 결론을 내려보면, B2C 분야에서는 한국 창업가들이 일본 시장을 접수할 수 있다는 것이다. 우리가 잘하는 B2C로 시작하지만, 남에게 지는 걸 배 아파하는 한국인 특유의 경쟁심과 질투심으로 결국엔 B2B 사업도 일본 시장에서 더 잘할 수 있을거라 믿는다. 정말로 더 많은 한국 창업가들이 일본 시장에 진출해서 거대한 사업을 만들 수 있길 바란다.\n마지막으로,,,내 친구이자 VC인 일본 투자자가 한국 시장이 부럽다고 하는 가장 큰 이유는 결국엔 우리의 창업가들이다. 한 골 먹으면 두 골을 넣어야지 직성이 풀리는 우리 특유의 성깔?, 절대로 죽지 않고 생존하는 바퀴벌레력, 이 모든 게 한국의 강점이라고 생각한다. 내가 전에 여러 번 포스팅 했지만, 이 강점을 우린 계속 살려야 하고, 이 강점을 살리기 위해서는 더 치열하게, 그리고 열심히 일해야 한다.",
        "dc:creator": "Kihong Bae",
        "comments": "https://www.thestartupbible.com/2025/11/koreas-consumer-dna.html#respond",
        "content": "2주 전에 잠깐 동경에 갔었는데, 과거부터 친분이 있던 일본 VC들과 다양한 이야기를 했다. 자연스럽게 한국과 일본의 스타트업 생태계 이야기를 특히 많이 했는데, 한국에 집중적으로 투자하는 나 같은 VC는 당연히 일본 시장보단 한국 스타트업 시장이 더 좋다고 믿지만, 내가 만난 일본 VC들도 대부분 한국의 벤처생태계를 부러워하는 느낌을 강하게 받았다. 어떤 일본 VC는 대놓고 나에게 한국 벤처생태계를(...)",
        "contentSnippet": "2주 전에 잠깐 동경에 갔었는데, 과거부터 친분이 있던 일본 VC들과 다양한 이야기를 했다. 자연스럽게 한국과 일본의 스타트업 생태계 이야기를 특히 많이 했는데, 한국에 집중적으로 투자하는 나 같은 VC는 당연히 일본 시장보단 한국 스타트업 시장이 더 좋다고 믿지만, 내가 만난 일본 VC들도 대부분 한국의 벤처생태계를 부러워하는 느낌을 강하게 받았다. 어떤 일본 VC는 대놓고 나에게 한국 벤처생태계를(...)",
        "guid": "https://www.thestartupbible.com/?p=9621",
        "categories": [
          "Uncategorized",
          "B2C",
          "brand",
          "consumer",
          "FoundersAtWork",
          "inspiring",
          "korea",
          "vc"
        ],
        "isoDate": "2025-11-23T21:21:00.000Z"
      },
      {
        "creator": "Kihong Bae",
        "title": "새로운 세상, 새로운 시각, 새로운 생각",
        "link": "https://www.thestartupbible.com/2025/11/different-thinking-for-the-whacky-new-world.html",
        "pubDate": "Wed, 19 Nov 2025 21:29:00 +0000",
        "content:encodedSnippet": "요새 한국의 어린이들 10명에게 나중에 커서 뭐 하고 싶은지 물어보면 절반 이상이 연예인, 가수 또는 유튜버가 되고 싶다고 대답한다는 이야기를 전에 어디서 들었다. 관련 자료를 찾아보려고 했는데, 공식적인 시장 조사 자료는 없지만 한국 사회의 분위기를 보면 대충 맞을 것 같고 아마도 몇 년 후에는 이렇게 대답하는 어린이들이 10명 중 10명이 될 것 같은 느낌도 든다.\n나이가 좀 있는 분들과의 식사 자리였는데, 당시 모임에서 대부분 한국의 장래가 어둡고, 요새 젊은 애들 정말 문제가 많다는 분위기 속에서 이런 이야기가 나오긴 했는데 솔직히 나는 이게 그렇게 한국의 미래에 나쁜 영향을 미칠 건 아니라고 했던 기억이 난다. 내가 초등학생일 때 “너희 장래 희망이 뭐니? (너희 커서 뭐가 되고 싶니?)”라고 물어보면 대부분 대통령, 과학자, 교수님, 의사, 변호사, 경찰관, 소방관, 올림픽 금메달리스트 등과 같은 사회에서 전반적으로 존경받고, 좋고 안정적으로 인식되는 직업을 택했다. 나도 아마도 과학자라고 항상 대답했던 것 같은데, 지금 생각해 보면 솔직히 내가 원하는 것보단 주위 사람들이 바라던 답을 했던 것 같다.\n연예인과 유튜버가 과연 과학자나 대통령보다 못 한 직업일까? 일단 위에서 이야기한 모임에 있던 분들 대부분은 그렇게 생각했던 것 같다. 실은 나도 몇 년 전까지만 해도 연예인과 유튜버는 제대로 된 직업이 아니라고 생각했었지만, 이젠 완전히 생각이 바뀌었다. 정확히 말하자면 그동안 보고 검토했던 사업들과 빠르게 변하고 있는 세상 때문에 바뀌기도 했지만, 내가 스스로 내 생각과 인식을 바꾸기 위해서 부단히 노력하기도 했다. 어쨌든, 나는 위의 모임에서 왜 유튜버, 인플루언서 등을 지칭하는 크리에이터라는 업종이 우리가 아는 일반적인 직장과 크게 다르지 않고 실은 왜 훨씬 더 좋은 직업인지 열심히 내 생각을 말했고, 그분들에게 계속 이런 고리타분한 생각을 하면 빠르게 변하는 세상에서 점점 더 도태될 수밖에 없다는 경고도 여러 번 날렸다.\n우리 아버지 세대, 그리고 우리 세대 초반까지만 해도 돈을 벌 수 있는 유일한 수단은 회사에 출근하는 것이었다. 9시에 출근해서 6시에 퇴근하는 게 남과 내가 생각하는, 합법적으로 돈을 벌 수 있는 정상적인 직장 생활이었다. 그런데 요새 우리는 회사로 출근은커녕, 침대에서 잠옷 입고 전 세계 1억 명을 대상으로 말도 안 되는 이야기와 행동을 하면서 연 매출 10억 원을 만들 수 있는, 나같이 올드한 세대가 봤을 땐 참으로 신기한 세상에 살고 있다. 그리고 앞으로 이런 변화와 신기함은 계속 가속화될 것이다. 우리가 만나는 창업가들을 보면서 나는 이 변화를 직접 매일매일 느낄 수 있다. 왜냐하면 점점 더 많은 창업가와 이들이 하는 사업에 대해서 듣다 보면 가장 먼저 떠오르는 생각은, “이게 뭐야 ?”이고, 어떤 사업은 내가 전혀 이해할 수가 없기 때문이다.\n실은, 이런 창업가와 사업을 접할 때마다 “이런 건 사업이 아냐. 제대로 된 직장 경험도 없는 어린애가 폰 앞에서 말도 안 되는 이야기 하는 걸 누가 봐.”라고 생각하면서 그냥 무시하고 패스하는 게 속 편할 수도 있지만, 새로운 시각과 생각으로 모든 걸 바라봐야 한다는 걸 나는 잘 알기 때문에, 불편하기도 하지만 열심히 노력하고 있다.\n새로운 세상에는 새로운 시각과 새로운 생각이 필요하다.",
        "dc:creator": "Kihong Bae",
        "comments": "https://www.thestartupbible.com/2025/11/different-thinking-for-the-whacky-new-world.html#comments",
        "content": "요새 한국의 어린이들 10명에게 나중에 커서 뭐 하고 싶은지 물어보면 절반 이상이 연예인, 가수 또는 유튜버가 되고 싶다고 대답한다는 이야기를 전에 어디서 들었다. 관련 자료를 찾아보려고 했는데, 공식적인 시장 조사 자료는 없지만 한국 사회의 분위기를 보면 대충 맞을 것 같고 아마도 몇 년 후에는 이렇게 대답하는 어린이들이 10명 중 10명이 될 것 같은 느낌도 든다.(...)",
        "contentSnippet": "요새 한국의 어린이들 10명에게 나중에 커서 뭐 하고 싶은지 물어보면 절반 이상이 연예인, 가수 또는 유튜버가 되고 싶다고 대답한다는 이야기를 전에 어디서 들었다. 관련 자료를 찾아보려고 했는데, 공식적인 시장 조사 자료는 없지만 한국 사회의 분위기를 보면 대충 맞을 것 같고 아마도 몇 년 후에는 이렇게 대답하는 어린이들이 10명 중 10명이 될 것 같은 느낌도 든다.(...)",
        "guid": "https://www.thestartupbible.com/?p=9619",
        "categories": [
          "Uncategorized",
          "creator",
          "FoundersAtWork",
          "general",
          "inspiring",
          "media"
        ],
        "isoDate": "2025-11-19T21:29:00.000Z"
      }
    ]
  },
  {
    "name": "매거진 입맛",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "요즘 IT",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "지마켓 기술 블로그",
    "category": "기업",
    "posts": []
  },
  {
    "name": "Kimchi hill",
    "category": "큐레이션",
    "posts": []
  },
  {
    "name": "Hudi.blog",
    "category": "개인",
    "posts": []
  },
  {
    "name": "토스",
    "category": "기업",
    "posts": [
      {
        "title": "7년 이상 연체자라면? 새도약기금 확인해보세요",
        "link": "https://toss.im/tossfeed/article/money-policies-54",
        "pubDate": "Thu, 20 Nov 2025 07:02:00 GMT",
        "content:encodedSnippet": ".css-1vn47db{display:-webkit-box;display:-webkit-flex;display:-ms-flexbox;display:flex;-webkit-flex-direction:column;-ms-flex-direction:column;flex-direction:column;-webkit-flex:none;-ms-flex:none;flex:none;}\n.css-14on8x8{font-size:17px;letter-spacing:0em;line-height:1.6;font-weight:normal;color:var(--adaptiveGrey800);margin:24px 0 8px;}\n.css-1r3ko7u{line-height:0;display:block;}.css-1iisb9p{display:contents;line-height:1.6;}.css-1kxrhf3{white-space:pre-wrap;}지난 10월 1일, 장기 연체로 어려움을 겪는 취약계층과 소상공인을 돕기 위해 새도약기금이 새롭게 시작됐어요. .css-16cuouw{white-space:pre-wrap;color:var(--adaptiveGrey800);background-color:#3fd59936;}향후 1년 동안 누구나 지원 대상이라면 따로 신청하지 않아도 순차적으로 도움을 받을 수 있어요.\n.css-1feg9au{font-size:24px;letter-spacing:0em;line-height:1.6;font-weight:bold;color:var(--adaptiveGrey900);margin:24px 0 4px;}\n.css-q3ktjb{white-space:pre-wrap;font-weight:bold;}새도약기금이란?\n상환능력이 낮은 장기 연체자의 금융권 연체채권을 매입해 소각하거나 채무를 조정해주는 제도\n지원 대상\n.css-uswsmm{display:-webkit-box;display:-webkit-flex;display:-ms-flexbox;display:flex;-webkit-flex-direction:column;-ms-flex-direction:column;flex-direction:column;-webkit-flex:none;-ms-flex:none;flex:none;margin:24px 0 8px;padding:0;list-style:none;}.css-uswsmm ul,.css-uswsmm ol{margin:16px 0 0;}.css-uswsmm>li{margin-bottom:16px;padding-left:24px;}.css-uswsmm>li:last-of-type{margin-bottom:0;}.css-uswsmm>li>span{position:relative;}.css-uswsmm>li>span>:first-child::before{content:'•';font-weight:500;color:var(--adaptiveGrey800);position:absolute;left:-24px;}\n.css-1hwiibq{font-size:17px;line-height:1.6;word-break:keep-all;letter-spacing:0em;font-weight:400;color:var(--adaptiveGrey800);}\n7년 이상 연체* + 5천만 원 이하* 개인 연체자(개인 사업자 포함)\n.css-18442ym{font-size:13px;line-height:1.7;word-break:keep-all;letter-spacing:0em;color:var(--adaptiveGrey600);white-space:pre-wrap;}.css-jfs1hr{white-space:pre-wrap;font-size:13px;line-height:1.7;word-break:keep-all;letter-spacing:0em;color:var(--adaptiveGrey600);white-space:pre-wrap;}*7년 이상 연체: 2018년 6월 19일 이전에 연체가 시작되었거나 기존 채무조정 후 실효한 경우(2025년 6월 19일 발표 기준)\n*5천만 원 이하: 금융회사별 원금 합산 기준(연체이자 불포함)\n금융회사 및 공공기관 보유 금융채권*\n*사행성·유흥업 관련 채권, 외국인 채권 등은 제외\n\n지원 내용\n.css-hokoge{display:-webkit-box;display:-webkit-flex;display:-ms-flexbox;display:flex;-webkit-flex-direction:column;-ms-flex-direction:column;flex-direction:column;-webkit-flex:none;-ms-flex:none;flex:none;margin:24px 0 8px;padding:0;list-style:none;counter-reset:numberedList;}.css-hokoge ul,.css-hokoge ol{margin:16px 0 0;}.css-hokoge>li{counter-increment:numberedList;margin-bottom:16px;padding-left:24px;}.css-hokoge>li:last-of-type{margin-bottom:0;}.css-hokoge>li>span{position:relative;}.css-hokoge>li>span>:first-child::before{content:counter(numberedList) '.';font-weight:500;color:var(--adaptiveGrey800);position:absolute;left:-24px;}\n채권이 매입되면 바로 추심이 중단돼요.\n개인파산처럼 상환 능력이 없을 경우, 채무가 ‘소각’돼요 (1년 이내)\n- 기초생활수급자, 장애연금수령자(중증), 생활조정수당·생계지원금 수급자(보훈 대상자)는 별도 심사없이 소각돼요.\n상환 능력이 부족한 경우, ‘강화된 채무조정’이 적용돼요.\n- 기준 중위소득 60%를 넘거나, 회수 가능한 자산은 있지만 채무가 더 많은 경우.\n- 원금 30~80% 감면, 최장 10년 분할상환, 이자 전액 감면, 상환유예 최대 3년 등이 적용돼요.\n상환 능력이 있는 경우, 추심이 다시 진행되거나 상환 요구가 있어요.\n- 기준 중위소득 125%를 넘거나, 보유 자산이 채무보다 많은 경우에 해당돼요.\n\n지원 방법\n새도약기금은 따로 신청할 필요가 없어요. 상환능력 심사가 끝나면 정부가 각 채무자에게 개별적으로 알려드려요.\n주요 일정은 아래와 같아요.\n\n장기 연체채권 매입: 2025년 10월 ~ 2026년 10월\n상환능력 심사: 2025년 11월 ~ 2027년 6월\n채무 소각·조정: 2025년 12월~\n\n.css-iynyr0{white-space:pre-wrap;cursor:pointer;color:var(--adaptiveGrey600);-webkit-text-decoration:underline!important;text-decoration:underline!important;}새도약기금 홈페이지에서 내 채무가 매입되었는지 여부와 상환능력 심사 결과, 채무 소각 여부 등을 조회할 수 있어요.\n문의\n\n새도약기금 콜센터 1660-0705 (평일 9시~18시)\n.css-1ifza5r{border:0;margin-top:0;margin-bottom:0;height:1px;opacity:1;background:var(--tHairlineBackground);margin:0;}\nEdit 권민지 이지영 Graphic 이제현",
        "content": "최대 원금 80% 감면부터 소각까지 지원해드려요.",
        "contentSnippet": "최대 원금 80% 감면부터 소각까지 지원해드려요.",
        "guid": "https://toss.im/tossfeed/article/money-policies-54",
        "isoDate": "2025-11-20T07:02:00.000Z"
      }
    ]
  },
  {
    "name": "모나미",
    "category": "개인",
    "posts": []
  },
  {
    "name": "김진홍",
    "category": "개인",
    "posts": []
  }
]